[
  {
    "stableId": "bac_anglais_bases_examen_terminale",
    "name": "Bac Anglais: bases + examen (Terminale)",
    "description": "Les essentiels pour l’anglais au bac: grammaire utile, vocabulaire académique, compréhension/oral, connecteurs, faux-amis et stratégies de réponse.",
    "color": "pink",
    "category": "Language",
    "language": "en",
    "difficulty": "Intermediate",
    "tags": [
      "bac",
      "terminale",
      "anglais",
      "grammaire",
      "oral"
    ],
    "cards": [
      {
        "front": "What’s the difference between the present simple and the present continuous?",
        "back": "Present simple describes habits, facts, and routines; present continuous describes actions happening now or temporary situations.",
        "hint": "Habits vs happening now."
      },
      {
        "front": "When do you use the present perfect (vs past simple)?",
        "back": "Use present perfect for past actions linked to the present (no finished time); use past simple for actions at a finished time in the past.",
        "hint": "Link to now vs finished time."
      },
      {
        "front": "Form the past participle of these verbs: go, write, take.",
        "back": "gone, written, taken.",
        "hint": "Irregular verbs set."
      },
      {
        "front": "What is a modal verb and give 3 examples.",
        "back": "A modal expresses ability, possibility, obligation, or advice (e.g., can, might, must).",
        "hint": "Can/might/must."
      },
      {
        "front": "Difference between must and have to?",
        "back": "Must often expresses the speaker’s strong obligation; have to is more external obligation (rules, circumstances).",
        "hint": "Speaker vs external."
      },
      {
        "front": "How do you make a conditional sentence (type 1)?",
        "back": "If + present simple, will + base verb (e.g., If it rains, we will stay home).",
        "hint": "Real future."
      },
      {
        "front": "How do you make a conditional sentence (type 2)?",
        "back": "If + past simple, would + base verb (e.g., If I had time, I would travel more).",
        "hint": "Unreal/imaginary."
      },
      {
        "front": "How do you make a conditional sentence (type 3)?",
        "back": "If + past perfect, would have + past participle (e.g., If I had studied, I would have passed).",
        "hint": "Regret in the past."
      },
      {
        "front": "What’s the difference between since and for?",
        "back": "Since + starting point (since 2019); for + duration (for three years).",
        "hint": "Point vs duration."
      },
      {
        "front": "What is reported speech (basic idea)?",
        "back": "It’s how you report what someone said, often shifting tenses (e.g., “I’m tired” → He said he was tired).",
        "hint": "Shift tenses."
      },
      {
        "front": "Give 3 common linking words for contrast.",
        "back": "However, although, whereas.",
        "hint": "Contrast connectors."
      },
      {
        "front": "Give 3 common linking words for cause and consequence.",
        "back": "Because, therefore, as a result.",
        "hint": "Cause → result."
      },
      {
        "front": "What’s the difference between few and a few?",
        "back": "Few means almost none (negative); a few means some (positive).",
        "hint": "Almost none vs some."
      },
      {
        "front": "What’s the difference between little and a little?",
        "back": "Little means almost none; a little means some, with uncountable nouns.",
        "hint": "Uncountable."
      },
      {
        "front": "How do you form comparatives and superlatives for short adjectives?",
        "back": "Comparative: -er (taller); superlative: the -est (the tallest).",
        "hint": "-er / -est."
      },
      {
        "front": "Give 3 irregular comparatives.",
        "back": "good → better, bad → worse, far → farther/further.",
        "hint": "Good/bad/far."
      },
      {
        "front": "When do you use the definite article 'the'? (one clear rule)",
        "back": "Use 'the' when both speaker and listener know which specific thing you mean (shared reference).",
        "hint": "Specific known reference."
      },
      {
        "front": "What’s the difference between who and which?",
        "back": "Who refers to people; which refers to things/animals in many contexts.",
        "hint": "People vs things."
      },
      {
        "front": "What’s the difference between say and tell?",
        "back": "Say doesn’t require an object (“say something”); tell usually requires a person (“tell someone”).",
        "hint": "Tell + someone."
      },
      {
        "front": "What’s the difference between make and do?",
        "back": "Make is for creating/producing; do is for actions/tasks (do homework).",
        "hint": "Create vs task."
      },
      {
        "front": "Give 5 academic verbs useful in essays.",
        "back": "Argue, claim, suggest, illustrate, conclude.",
        "hint": "Essay verbs."
      },
      {
        "front": "Give 5 useful opinion phrases for oral answers.",
        "back": "In my opinion…, I believe…, It seems to me…, I would say…, From my perspective…",
        "hint": "Opinion starters."
      },
      {
        "front": "What’s a 'false friend' and give one example (FR→EN)?",
        "back": "A word that looks similar but differs in meaning; e.g., 'actually' ≠ 'actuellement' (it means 'en fait').",
        "hint": "Actually ≠ actuellement."
      },
      {
        "front": "Give two ways to paraphrase a word you don’t know.",
        "back": "Use a definition (It’s a kind of…) or use a synonym/near-synonym (It means…).",
        "hint": "Define or synonym."
      },
      {
        "front": "What’s the structure of a strong paragraph (simple)?",
        "back": "Topic sentence + explanation + example + mini-conclusion/transition.",
        "hint": "TEEET."
      },
      {
        "front": "What is the difference between 'some' and 'any'?",
        "back": "Some is common in affirmative statements; any is common in negatives and questions (with exceptions).",
        "hint": "Affirmative vs negative/question."
      },
      {
        "front": "When do you use 'used to'?",
        "back": "To describe past habits or states that are no longer true (I used to play football).",
        "hint": "Past habit no longer true."
      },
      {
        "front": "What’s the difference between 'during' and 'while'?",
        "back": "During + noun (during the week); while + clause (while I was studying).",
        "hint": "Noun vs clause."
      },
      {
        "front": "What’s the passive voice and why use it?",
        "back": "Subject receives the action (The law was passed); used to focus on the action/result or when the agent is unknown/less important.",
        "hint": "Focus on action."
      },
      {
        "front": "Form the passive in present simple.",
        "back": "am/is/are + past participle (e.g., is built).",
        "hint": "Be + V3."
      },
      {
        "front": "Give 5 high-frequency connectors for sequencing.",
        "back": "First, then, next, finally, meanwhile.",
        "hint": "Order words."
      },
      {
        "front": "What does 'despite' mean and how is it used?",
        "back": "It means “in spite of” and is followed by a noun/gerund: despite the rain / despite being tired.",
        "hint": "Noun or -ing."
      },
      {
        "front": "What’s the difference between 'affect' and 'effect'?",
        "back": "Affect is usually a verb (influence); effect is usually a noun (result).",
        "hint": "Verb vs noun."
      },
      {
        "front": "What is a 'thesis statement' in an essay?",
        "back": "A clear sentence that states your main argument and guides the structure of the essay.",
        "hint": "Main argument."
      },
      {
        "front": "Give 3 strategies for listening comprehension.",
        "back": "Predict topic, listen for keywords/signposting, take brief notes of names/numbers/ideas.",
        "hint": "Predict + keywords + notes."
      },
      {
        "front": "Give 3 strategies for reading comprehension.",
        "back": "Skim for main idea, scan for details, infer meaning from context before using a dictionary.",
        "hint": "Skim/scan/infer."
      },
      {
        "front": "How can you improve pronunciation quickly (one actionable method)?",
        "back": "Shadowing: repeat immediately after a native speaker, copying rhythm and stress for 5–10 minutes daily.",
        "hint": "Shadowing."
      },
      {
        "front": "What are 'stress' and 'intonation' in English?",
        "back": "Stress is emphasis on certain syllables/words; intonation is the rise and fall of pitch across a sentence, affecting meaning.",
        "hint": "Emphasis + pitch."
      },
      {
        "front": "Give 5 useful words to describe a graph/trend.",
        "back": "Increase, decrease, stable, peak, fluctuate.",
        "hint": "Trend verbs."
      },
      {
        "front": "Give 3 phrases to compare two documents in an oral exam.",
        "back": "Both documents show…, Unlike the first…, Similarly…,",
        "hint": "Both/unlike/similarly."
      },
      {
        "front": "What is the 'notion' approach in French school English exams?",
        "back": "It’s organizing ideas around broad themes (e.g., identities, power, spaces) and linking documents to a coherent argument.",
        "hint": "Themes + links."
      },
      {
        "front": "Give 5 key terms for debating ideas politely.",
        "back": "I agree/disagree, I’m not sure, That’s a good point, Could you clarify?, Let’s consider…",
        "hint": "Polite debate."
      },
      {
        "front": "Where can you find reliable official information about the bac English exam?",
        "back": "On the French Ministry site and Eduscol pages for languages. Reference: https://eduscol.education.fr/1990/anglais-et-langues-vivantes-voie-generale-et-technologique",
        "hint": "Éduscol LV."
      },
      {
        "front": "Where can you practice high-quality English listening with transcripts?",
        "back": "BBC Learning English provides listening materials and transcripts. Reference: https://www.bbc.co.uk/learningenglish",
        "hint": "BBC Learning English."
      }
    ],
    "sampleIdeas": [
      {
        "name": "Bac English: what to master (skills + tools)",
        "textDescription": "To do well in a bac-level English exam, you need two things: reliable language tools (grammar, connectors, vocabulary) and exam skills (understanding documents, building an argument, speaking clearly). This deck focuses on high-frequency structures that directly improve accuracy and fluency.\n\nA practical routine is: 10 minutes of active recall (flashcards), then 10 minutes of input (short video/audio), then 10 minutes of output (write or speak). Output matters: you must practice forming sentences, not just recognizing rules.\n\nFor oral tasks, structure answers: 1) introduce the topic, 2) describe the document(s), 3) analyze and give a viewpoint, 4) conclude with a broader link. Use connectors to make your speech sound organized.\n\nFinally, track mistakes: write down your top 10 recurring errors (tenses, articles, prepositions) and build mini-cards to eliminate them.",
        "videoURL": "https://www.youtube.com/watch?v=H0y0u2j4fFY",
        "externalLinkURL": "https://eduscol.education.fr/1990/anglais-et-langues-vivantes-voie-generale-et-technologique",
        "linkedCardIndices": []
      },
      {
        "name": "Core grammar checklist (the minimum that pays off)",
        "textDescription": "A small set of grammar points yields a big score boost: present perfect vs past simple, conditionals, modals, passive voice, articles, and connectors. These appear constantly in writing and speaking.\n\nWhen revising, avoid abstract memorization. Instead, build “trigger sentences” (e.g., I have lived here since…, If I had…, It was built in…). Then practice transforming them: active→passive, direct→reported, present→past.\n\nFor bac writing, clarity beats complexity. A correct simple sentence is better than a complex one with errors. Use a few advanced tools (however, whereas, therefore) and keep your verb tenses consistent.\n\nA strong habit: after writing or speaking, quickly check verbs (tense), articles (a/the/zero), and connectors (logical flow).",
        "videoURL": "https://www.youtube.com/watch?v=1P0q9fY9rJg",
        "externalLinkURL": "https://www.bbc.co.uk/learningenglish/english/course/lower-intermediate",
        "linkedCardIndices": []
      },
      {
        "name": "Oral performance: sound clear, organized, confident",
        "textDescription": "In an oral exam, the goal is not perfect native pronunciation; it’s intelligibility and structure. Focus on stress (which words you emphasize) and intonation (how your pitch moves). These two features strongly affect how “natural” you sound.\n\nShadowing is the fastest method: pick a 1–2 minute clip, listen once, then repeat immediately, copying rhythm and pauses. Do it daily. Record yourself once a week to notice progress.\n\nTo stay organized, use a template: “The document deals with… It shows… This suggests that… In my opinion…”. Add two connectors per answer (however, therefore) to show reasoning.\n\nIf you forget a word, don’t freeze. Paraphrase: define it, give an example, or use a near-synonym. Fluency is about continuing with meaning.",
        "videoURL": "https://www.youtube.com/watch?v=5iYz9o6yKpg",
        "externalLinkURL": "https://www.bbc.co.uk/learningenglish/english/features/pronunciation",
        "linkedCardIndices": []
      },
      {
        "name": "Reading & listening: strategies that actually work",
        "textDescription": "For reading, start with skimming: read titles, first sentences, and scan for names, dates, connectors. This gives you a mental map. Then scan for details: numbers, quotes, examples.\n\nFor listening, predict topic and vocabulary from context, then listen for signposts (first, however, because). Don’t try to understand every word: focus on meaning units. Write only keywords.\n\nA key skill is inference: guess unknown words from context and grammar (noun/verb/adjective). Many bac tasks reward understanding the message rather than translating.\n\nTraining method: choose short audios with transcripts, listen twice, then read transcript, then listen again. This improves both comprehension and vocabulary.",
        "videoURL": "https://www.youtube.com/watch?v=Qx7C2b8mJZg",
        "externalLinkURL": "https://www.bbc.co.uk/learningenglish",
        "linkedCardIndices": []
      },
      {
        "name": "Academic vocabulary: write and speak more convincingly",
        "textDescription": "Bac-level English benefits from academic verbs (argue, suggest, claim) and precise connectors (whereas, therefore). These tools help you build analysis instead of simple description.\n\nDon’t learn long word lists. Learn words in “chunks”: ‘It can be argued that…’, ‘This suggests that…’, ‘As a result…’. Chunks improve fluency and reduce grammar errors.\n\nAlso learn common false friends: actually, eventually, library, assist. These cause frequent misunderstandings. Create mini-cards with one example sentence.\n\nFinally, practice describing data: increase, decrease, remain stable, peak. These appear in many documents and help you comment on graphs or trends quickly.",
        "videoURL": "https://www.youtube.com/watch?v=8l7c0nH8oKQ",
        "externalLinkURL": "https://www.oxfordlearnersdictionaries.com/",
        "linkedCardIndices": []
      }
    ]
  },
  {
    "stableId": "bac_francais_oeuvres_parcours_revision",
    "name": "Bac Français: œuvres & parcours (révision)",
    "description": "Réviser efficacement les œuvres, parcours et lectures (descriptif) pour l’écrit et l’oral: repères, auteurs, mouvements, scènes clés, citations courtes, et entraînement à l’entretien.",
    "color": "blue",
    "category": "Language",
    "language": "fr",
    "difficulty": "Advanced",
    "tags": [
      "bac",
      "terminale",
      "francais",
      "litterature",
      "oeuvres"
    ],
    "cards": [
      {
        "front": "Qu’est-ce qu’une « œuvre intégrale » en français (Première) ?",
        "back": "Une œuvre étudiée dans l’année (ou une partie substantielle et cohérente), rattachée à un objet d’étude et à un parcours.",
        "hint": "Œuvre étudiée + objet + parcours."
      },
      {
        "front": "Qu’est-ce qu’un « parcours » associé à une œuvre ?",
        "back": "Un angle de mise en perspective qui relie l’œuvre à des textes complémentaires, à un contexte et à des enjeux (genre, époque, thèmes).",
        "hint": "Mise en perspective."
      },
      {
        "front": "Qu’appelle-t-on une « lecture cursive » ?",
        "back": "Une lecture complémentaire (souvent en lien avec un objet d’étude/parcours) qui sert d’exemples et nourrit l’entretien.",
        "hint": "Lecture complémentaire."
      },
      {
        "front": "Qu’est-ce que le « descriptif » (ou liste) pour l’oral de français ?",
        "back": "Le document qui récapitule les textes étudiés, les œuvres et les lectures cursives: base officielle de ton année pour l’oral.",
        "hint": "Carte d’identité de l’année."
      },
      {
        "front": "Pourquoi faut-il toujours partir de TON descriptif (et pas d’une liste trouvée en ligne) ?",
        "back": "Parce que l’oral porte sur les textes réellement étudiés en classe; ton descriptif encadre ce qui peut être tiré.",
        "hint": "Ton année = ton corpus."
      },
      {
        "front": "Quel est l’objectif de la présentation d’œuvre (2e partie de l’oral) ?",
        "back": "Montrer que tu connais l’œuvre et que tu sais en dégager des enjeux, avec des exemples précis, en lien avec le parcours.",
        "hint": "Enjeux + exemples + parcours."
      },
      {
        "front": "Quel est le piège principal quand on présente une œuvre à l’oral ?",
        "back": "Raconter l’intrigue au lieu de sélectionner des passages/scènes utiles et d’expliquer ce qu’ils prouvent sur un enjeu.",
        "hint": "Résumé ≠ analyse."
      },
      {
        "front": "Quelle structure simple pour présenter une œuvre en ~3 minutes ?",
        "back": "1) Identifier l’œuvre (auteur, genre, date) 2) Résumé très bref 3) 2–3 enjeux 4) 2 scènes/passage + effet 5) Lien avec le parcours.",
        "hint": "ID → bref → enjeux → scènes → parcours."
      },
      {
        "front": "Combien de passages/scènes clés par œuvre est un bon minimum pour être solide ?",
        "back": "Vise 3 scènes/passages clés par œuvre, chacun relié à un enjeu et à une citation courte.",
        "hint": "3 scènes clés."
      },
      {
        "front": "Combien de citations courtes par œuvre est un objectif réaliste et utile ?",
        "back": "En pratique, 3 à 5 citations courtes par œuvre, comprises (sens) et réutilisables sur plusieurs questions.",
        "hint": "3–5 micro-citations."
      },
      {
        "front": "Quelle différence entre une citation “décoration” et une citation “preuve” ?",
        "back": "Une citation preuve est expliquée: tu dis ce qu’elle montre et comment elle soutient ton idée, au lieu de la poser sans commentaire.",
        "hint": "Citer puis expliquer."
      },
      {
        "front": "Qu’est-ce qu’un “enjeu” d’œuvre (au bac) ?",
        "back": "Une question importante que l’œuvre fait travailler (valeurs, conflit, critique, vision de l’humain) et que tu peux prouver par des passages.",
        "hint": "Grande question + preuves."
      },
      {
        "front": "Qu’est-ce qu’un “réseau d’exemples” pour une œuvre ?",
        "back": "Un ensemble de 3–4 passages reliés à un même enjeu, mobilisable selon la question d’entretien ou le sujet d’écrit.",
        "hint": "3–4 preuves pour 1 idée."
      },
      {
        "front": "Qu’est-ce que “contextualiser” une œuvre sans faire du hors-sujet ?",
        "back": "Donner 1–2 repères utiles (époque, mouvement, situation) qui éclairent un passage, puis revenir immédiatement au texte.",
        "hint": "1–2 repères utiles."
      },
      {
        "front": "Pourquoi connaître le genre (roman/théâtre/poésie/essai) aide-t-il à l’oral ?",
        "back": "Parce que le genre oriente les effets attendus (dialogue, scène, versification, argumentation) et la façon de commenter.",
        "hint": "Genre → effets attendus."
      },
      {
        "front": "Pourquoi connaître le registre dominant d’un passage aide-t-il à l’entretien ?",
        "back": "Parce que tu peux expliquer l’effet sur le lecteur (émotion, rire, critique) et justifier les choix d’écriture.",
        "hint": "Effet sur le lecteur."
      },
      {
        "front": "Qu’est-ce qu’un personnage “fonction” (roman/théâtre) ?",
        "back": "Un personnage construit pour remplir un rôle (adjuvant/opposant, confident, double) et faire avancer un enjeu.",
        "hint": "Rôle dans l’intrigue."
      },
      {
        "front": "Qu’est-ce que la double énonciation au théâtre et pourquoi c’est utile ?",
        "back": "Le personnage parle à un autre personnage mais le texte s’adresse aussi au public; cela crée ironie dramatique, tension, révélation.",
        "hint": "Personnage + public."
      },
      {
        "front": "Qu’est-ce qu’une didascalie et à quoi sert-elle ?",
        "back": "Une indication scénique (gestes, décor, ton) qui guide la mise en scène et peut produire un effet (comique, tension, symbolique).",
        "hint": "Indication de scène."
      },
      {
        "front": "Quel lien faire entre une scène-clé et un enjeu ?",
        "back": "Décrire brièvement la scène, citer un détail, puis expliquer ce qu’il révèle sur un personnage, un conflit ou une idée de l’œuvre.",
        "hint": "Scène → détail → interprétation."
      },
      {
        "front": "Qu’est-ce qu’un narrateur et pourquoi il faut le distinguer de l’auteur ?",
        "back": "Le narrateur est une voix dans le texte (1re/3e personne, fiabilité) ; l’auteur est la personne réelle. Cette distinction évite les contresens.",
        "hint": "Voix du texte vs auteur."
      },
      {
        "front": "Qu’est-ce que la focalisation interne et quel effet produit-elle ?",
        "back": "Le récit est filtré par un personnage; cela crée proximité, subjectivité, et peut limiter l’information au lecteur.",
        "hint": "Dans la tête d’un perso."
      },
      {
        "front": "Qu’est-ce que la focalisation zéro ?",
        "back": "Le narrateur en sait plus que les personnages (omniscient) et peut donner des informations globales sur le passé/avenir.",
        "hint": "Narrateur omniscient."
      },
      {
        "front": "Qu’est-ce qu’un incipit et pourquoi il est stratégique ?",
        "back": "Le début d’une œuvre; il installe cadre, ton, enjeux, pacte de lecture et peut annoncer le destin du récit.",
        "hint": "Début = contrat."
      },
      {
        "front": "Qu’est-ce qu’un dénouement et comment l’exploiter à l’oral ?",
        "back": "La résolution finale; elle révèle souvent la portée de l’œuvre (morale, critique, tragique) et permet de relier à l’enjeu global.",
        "hint": "Fin = sens."
      },
      {
        "front": "Qu’est-ce qu’un “mouvement” dans une explication linéaire ?",
        "back": "Une partie du texte où l’idée, l’action ou le ton progresse; découper en mouvements structure ton analyse.",
        "hint": "Progression interne."
      },
      {
        "front": "Pourquoi les connecteurs logiques comptent-ils dans un texte argumentatif ?",
        "back": "Ils montrent la structure du raisonnement (cause, conséquence, concession) et aident à identifier thèse/arguments.",
        "hint": "Charpente logique."
      },
      {
        "front": "Quelle différence entre convaincre et persuader (réutilisable en œuvres) ?",
        "back": "Convaincre vise la raison (preuves) ; persuader vise l’émotion (pathos, style). Beaucoup de textes combinent les deux.",
        "hint": "Raison vs émotion."
      },
      {
        "front": "Qu’est-ce qu’une “thèse implicite” dans un texte d’idées ?",
        "back": "Une position non énoncée directement mais déduite de l’ironie, des exemples choisis, des oppositions et du raisonnement.",
        "hint": "À déduire."
      },
      {
        "front": "Qu’est-ce qu’un portrait (littéraire) et à quoi sert-il ?",
        "back": "Une description construite d’un personnage (physique/moral/social) qui révèle une critique, une valeur ou une évolution.",
        "hint": "Décrire pour signifier."
      },
      {
        "front": "Quelle différence entre description statique et description dynamique ?",
        "back": "Statique: tableau figé; dynamique: description liée à une action/une progression, souvent plus narrative et révélatrice.",
        "hint": "Tableau vs action."
      },
      {
        "front": "Qu’est-ce qu’un “passage clé” en poésie ?",
        "back": "Un passage où l’image, le rythme, la sonorité ou la structure (strophes, reprises) concentrent un enjeu (émotion, idée, révélation).",
        "hint": "Concentration d’effet."
      },
      {
        "front": "Qu’est-ce que l’alexandrin (repère utile) ?",
        "back": "Un vers de 12 syllabes souvent structuré par une césure (6/6); il sert à analyser rythme et effets.",
        "hint": "12 syllabes."
      },
      {
        "front": "Pourquoi la rime et les sonorités peuvent être des “preuves” ?",
        "back": "Parce qu’elles produisent des effets (insistance, musicalité, tension, harmonie/dissonance) qui soutiennent l’interprétation.",
        "hint": "Effet sonore."
      },
      {
        "front": "Qu’est-ce qu’un champ lexical et comment l’utiliser sur une œuvre ?",
        "back": "Un ensemble de mots liés à une idée; sur une œuvre, il aide à prouver un thème dominant et ses variations.",
        "hint": "Famille de mots."
      },
      {
        "front": "Qu’est-ce que la modalisation et pourquoi c’est utile en entretien ?",
        "back": "Les marques de jugement/doute/certitude (modalisateurs, conditionnel, verbes d’opinion); elles aident à repérer une position et un ton.",
        "hint": "Attitude du locuteur."
      },
      {
        "front": "Qu’est-ce qu’un “registre satirique” et quel type d’exemples mobiliser ?",
        "back": "Une critique par ironie, caricature, contraste; mobilise scènes de dénonciation, portraits ridicules, décalages de ton.",
        "hint": "Critique par moquerie."
      },
      {
        "front": "Qu’est-ce qu’un “registre lyrique” et quels indices repérer ?",
        "back": "Expression des émotions (je, exclamations, rythme, images), souvent pour créer une proximité et une intensité affective.",
        "hint": "Émotion + je."
      },
      {
        "front": "Qu’est-ce qu’un “registre tragique” et quels indices repérer ?",
        "back": "Fatalité, impuissance, menace; lexique de la mort, du destin, conflits insolubles; effet de pitié et de peur.",
        "hint": "Fatalité."
      },
      {
        "front": "Qu’est-ce qu’un “registre comique” et quels procédés le créent ?",
        "back": "Le rire par situation, gestes, mots, répétitions, quiproquo, décalage; il peut divertir ou critiquer.",
        "hint": "Rire: situation/mots."
      },
      {
        "front": "Quelle différence entre thème et enjeu (sur une œuvre) ?",
        "back": "Le thème est “de quoi ça parle”; l’enjeu est “quelle question importante ça fait travailler” (valeurs, critique, vision).",
        "hint": "Quoi vs pourquoi."
      },
      {
        "front": "Quelle est la meilleure façon de réviser une œuvre sans relire tout le livre ?",
        "back": "Relire 3 scènes clés, refaire une fiche 1 page, apprendre 3–5 citations courtes, et t’entraîner à 10 questions d’entretien avec exemples.",
        "hint": "3 scènes + 1 fiche + 5 citations + 10 questions."
      },
      {
        "front": "Quel réflexe quand une question d’entretien te surprend ?",
        "back": "Reformuler, répondre avec une idée claire + un exemple précis, puis relier à un enjeu ou au parcours.",
        "hint": "Reformuler → idée → exemple → lien."
      },
      {
        "front": "Pourquoi préparer 2 “angles” par œuvre est-il indispensable ?",
        "back": "Parce que les questions varient: personnages, scènes, valeurs, style, construction, portée. Deux angles évitent le blocage.",
        "hint": "Deux portes d’entrée."
      },
      {
        "front": "Comment faire un lien simple entre une œuvre et son parcours en 1 phrase ?",
        "back": "Formule: « Le parcours met en avant X; dans l’œuvre, cela apparaît quand Y (passage) et produit Z (effet/valeur). »",
        "hint": "X → Y → Z."
      },
      {
        "front": "Où trouver la liste officielle des œuvres et parcours de l’année scolaire 2025-2026 ?",
        "back": "Dans le Bulletin officiel qui publie le programme national d’œuvres pour l’enseignement du français. Réf : https://www.education.gouv.fr/bo/2025/Hebdo30/MENE2518792N",
        "hint": "Le BO (programme national)."
      },
      {
        "front": "Pourquoi vérifier les œuvres/parcours dans le BO est indispensable ?",
        "back": "Parce que la liste peut être actualisée; le BO/Éduscol est la référence fiable, contrairement aux listes non officielles.",
        "hint": "Source officielle."
      },
      {
        "front": "À l’oral du bac de français, que comprend la 1re partie de l’épreuve ?",
        "back": "Une explication linéaire d’un texte tiré de ton descriptif, suivie d’une question de grammaire. Réf : https://www.education.gouv.fr/bo/20/Special7/MENE2019312N.htm",
        "hint": "Texte + grammaire."
      },
      {
        "front": "À l’oral, que comprend la 2e partie de l’épreuve ?",
        "back": "La présentation d’une œuvre choisie (souvent parmi celles étudiées) puis un entretien avec l’examinateur. Réf : https://www.education.gouv.fr/bo/20/Special7/MENE2019312N.htm",
        "hint": "Œuvre choisie + entretien."
      }
    ],
    "sampleIdeas": [
      {
        "name": "Vérifier la liste officielle 2025-2026 (œuvres/parcours)",
        "textDescription": "La première règle pour une révision fiable est de vérifier les œuvres et parcours dans un texte officiel. Le Bulletin officiel publie la liste nationale des œuvres et des parcours pour l’année scolaire: c’est la référence à partir de laquelle les manuels, fiches et vidéos se construisent.\n\nPourquoi c’est essentiel ? Parce que des listes circulent en ligne sans préciser l’année scolaire, ou mélangent voie générale et technologique. Une seule source te garantit de ne pas préparer de mauvais repères.\n\nMéthode pratique: (1) ouvre le BO de l’année, (2) repère tes objets d’étude, (3) compare avec ton descriptif de classe, (4) fixe une liste “ton année” et organise tes fiches autour.\n\nEnsuite, tu peux utiliser des ressources pédagogiques pour approfondir — mais le point de départ reste la liste officielle.",
        "videoURL": "https://www.youtube.com/watch?v=MFtMwFkw8lI",
        "externalLinkURL": "https://www.education.gouv.fr/bo/2025/Hebdo30/MENE2518792N",
        "linkedCardIndices": []
      },
      {
        "name": "Ton descriptif: comment le transformer en plan de révision",
        "textDescription": "Le descriptif (liste des textes, œuvres et lectures) est ta “carte d’identité” pour l’oral. L’examinateur s’appuie dessus: le texte de l’explication linéaire vient de ce corpus. Réviser sans ton descriptif, c’est réviser à l’aveugle.\n\nTransforme-le en plan: pour chaque texte, note 1 enjeu + 2 procédés + 1 citation courte. Pour chaque œuvre, vise 3 scènes + 3 enjeux + 3–5 citations. Pour chaque lecture cursive, prépare 3 idées + 2 scènes + 1 lien avec le parcours.\n\nEnsuite, entraîne-toi: tire un texte au hasard, fais un plan d’explication en 5 minutes, puis un mini-exposé de 2 minutes. Répète souvent.\n\nTu verras vite une différence: moins de stress, plus de précision, et des réponses plus riches en entretien.",
        "videoURL": "https://www.youtube.com/watch?v=_dcyQwIeSyw",
        "externalLinkURL": "https://www.education.gouv.fr/bo/20/Special7/MENE2019312N.htm",
        "linkedCardIndices": []
      },
      {
        "name": "Fiche d’œuvre 1 page (format qui marche)",
        "textDescription": "Une fiche d’œuvre efficace doit être portable dans ta tête. Le format “1 page” force à sélectionner l’essentiel: résumé en 5 lignes, 3 enjeux, 3 scènes, 3–5 citations, 5 mots-clés, 1 phrase de lien au parcours, et 5 questions d’entretien possibles.\n\nCommence par les scènes: choisis trois moments qui incarnent les enjeux. Pour chacune: un détail précis + ce qu’il prouve. Ensuite choisis des citations courtes “flexibles”, réutilisables sur plusieurs questions.\n\nL’erreur classique est la fiche trop longue: tu la relis, mais tu ne l’utilises pas. Une fiche courte se transforme en entraînement oral.\n\nTest final: si tu peux présenter l’œuvre en 3 minutes avec ta fiche, elle est bonne. Sinon, simplifie et rends-la plus “preuve-driven”.",
        "videoURL": "https://www.youtube.com/watch?v=kgFrQkeiihg",
        "externalLinkURL": "https://www.lumni.fr/dossier/les-oeuvres-au-bac-de-francais",
        "linkedCardIndices": []
      },
      {
        "name": "Citations: choisir, apprendre, réutiliser",
        "textDescription": "Les citations ne sont pas un décor: elles servent à prouver une idée. Une citation utile est courte, compréhensible et reliée à un enjeu. Vise 3–5 citations par œuvre, chacune associée à une idée claire.\n\nMéthode d’apprentissage: écris la citation, puis écris en dessous (1) ce qu’elle veut dire, (2) ce qu’elle prouve, (3) dans quelle scène/passage elle apparaît. Ensuite, entraîne-toi à l’intégrer dans une phrase d’analyse.\n\nPour l’oral, prépare un “pack”: citation + scène + enjeu. En entretien, tu peux répondre vite: « Cette citation, dans la scène X, montre Y parce que… ».\n\nMieux vaut 3 citations maîtrisées que 10 citations récitées sans exploitation.",
        "videoURL": "https://www.youtube.com/watch?v=Y0cyTDoaomM",
        "externalLinkURL": "https://www.lumni.fr/dossier/les-oeuvres-au-bac-de-francais",
        "linkedCardIndices": []
      },
      {
        "name": "Relier œuvre et parcours en 30 secondes",
        "textDescription": "Le parcours n’est pas un chapitre à réciter: c’est un angle pour interpréter l’œuvre. Pour faire un lien rapide, tu dois passer par un passage concret.\n\nStructure gagnante: (1) idée du parcours (X), (2) passage de l’œuvre (Y), (3) effet/valeur (Z). Exemple de phrase: « Le parcours met en avant X; dans l’œuvre, on le voit quand Y, ce qui produit Z. »\n\nEntraîne-toi avec 5 cartes “parcours → passage”: pour chaque œuvre, choisis 2 passages qui incarnent les idées du parcours. Tu auras toujours une réponse solide.\n\nCe réflexe rend l’entretien plus riche et montre que tu comprends la logique du programme.",
        "videoURL": "https://www.youtube.com/watch?v=RR8Bq0f4iFE",
        "externalLinkURL": "https://eduscol.education.fr/1712/programmes-et-ressources-en-francais-voie-gt",
        "linkedCardIndices": []
      },
      {
        "name": "Théâtre: double énonciation, didascalies, scènes clés",
        "textDescription": "Pour le théâtre, trois repères font souvent la différence: la double énonciation (ce qu’entend le public en plus des personnages), les didascalies (indications de jeu/décor), et la construction des scènes (entrée/sortie, quiproquo, révélation, bascule).\n\nEn révision, sélectionne 3 scènes: une scène d’exposition, une scène de conflit/bascule, et une scène de dénouement. Pour chacune: enjeu + 1 détail de mise en scène + 1 réplique courte.\n\nLes didascalies sont des preuves: elles peuvent créer tension, comique, symbolique. Ne les ignore pas.\n\nÀ l’oral, relie toujours le théâtre à ses effets: tension dramatique, ironie, critique, émotion.",
        "videoURL": "https://www.youtube.com/watch?v=F5Qz4kJ3jps",
        "externalLinkURL": "https://fr.wikipedia.org/wiki/Double_%C3%A9nonciation",
        "linkedCardIndices": []
      },
      {
        "name": "Roman: narrateur, focalisation, incipit, dénouement",
        "textDescription": "Pour analyser un roman, quatre repères sont très rentables: narrateur (qui raconte), focalisation (qui voit), incipit (contrat de lecture) et dénouement (portée finale). Ces outils transforment un résumé en analyse.\n\nExemples de questions d’entretien: « Que nous fait comprendre la focalisation interne ici ? », « Que promet l’incipit ? », « En quoi la fin éclaire-t-elle le sens global ? ».\n\nEn révision, prends 2 passages: un passage très “subjectif” (focalisation interne) et un passage plus “omniscient” (zéro), puis explique l’effet sur le lecteur.\n\nL’objectif n’est pas de tout connaître: c’est de savoir prouver une interprétation par un passage précis.",
        "videoURL": "https://www.youtube.com/watch?v=EJ5n5y3t2is",
        "externalLinkURL": "https://fr.wikipedia.org/wiki/Focalisation",
        "linkedCardIndices": []
      },
      {
        "name": "Poésie: rythme, images, formes (ce qui rapporte)",
        "textDescription": "En poésie, ce qui “rapporte” en analyse est souvent: les images (comparaisons, métaphores), le rythme (mètre, césure, enjambement), les sonorités (allitérations/assonances) et la forme (strophes, reprises, refrain).\n\nNe cherche pas à tout nommer: choisis 2–3 éléments forts et explique l’effet (intensité, rupture, douceur, insistance). Relie ensuite à l’enjeu: émotion, souvenir, critique, célébration.\n\nEn révision, entraîne-toi sur 10 vers: compte les syllabes, repère une image, repère un effet sonore, puis écris une phrase “effet → sens”.\n\nAvec cette méthode, tu peux analyser rapidement un extrait sans te noyer dans le technique.",
        "videoURL": "https://www.youtube.com/watch?v=E0xQv6C81-w",
        "externalLinkURL": "https://fr.wikipedia.org/wiki/Alexandrin",
        "linkedCardIndices": []
      },
      {
        "name": "Littérature d’idées: thèse, arguments, ironie",
        "textDescription": "Dans un texte d’idées, l’enjeu est de repérer une thèse et la stratégie argumentative. Le texte peut convaincre (raison) et persuader (émotion), et il peut aussi critiquer par l’ironie ou l’exemple.\n\nMéthode rapide: (1) repère la thèse (explicite ou implicite), (2) liste 2–3 arguments, (3) repère un procédé (ironie, question rhétorique, exemple frappant), (4) explique l’effet.\n\nPour l’entretien, prépare des phrases prêtes: « L’auteur défend… », « Il le justifie par… », « Il cherche à… », « L’ironie révèle… ».\n\nCe type de texte devient facile quand tu lis la charpente (connecteurs, oppositions) plutôt que de rester sur la surface.",
        "videoURL": "https://www.youtube.com/watch?v=2E5J9_9h0mM",
        "externalLinkURL": "https://fr.wikipedia.org/wiki/Argumentation",
        "linkedCardIndices": []
      },
      {
        "name": "Oral: réussir l’entretien (banque de questions)",
        "textDescription": "L’entretien récompense la précision. Prépare une banque de questions pour chaque œuvre: personnages, scènes marquantes, valeurs, style, construction, lien parcours, comparaison avec une lecture cursive.\n\nStructure de réponse qui marche: idée claire → exemple précis → lien enjeu/parcours. Si tu t’éparpilles, reviens à cette structure.\n\nEntraîne-toi comme un sportif: 10 questions par œuvre, en 45 secondes chacune, enregistrées. Corrige ensuite: manque d’exemples ? pas de lien parcours ? trop de résumé ?\n\nAprès quelques sessions, tu gagnes en fluidité et tu n’as plus besoin de “réciter”: tu sais mobiliser tes preuves.",
        "videoURL": "https://www.youtube.com/watch?v=6XIe9opcRGc",
        "externalLinkURL": "https://www.lumni.fr/dossier/l-oral-du-bac-de-francais",
        "linkedCardIndices": []
      }
    ]
  },
  {
    "stableId": "bac_francais_outils_reperes_ecrit_oral",
    "name": "Bac Français: outils & repères (écrit+oral)",
    "description": "Les fondamentaux à connaître pour analyser un texte et réussir l’écrit et l’oral du bac de français: genres, registres, figures, narration, versification, argumentation et grammaire clé.",
    "color": "purple",
    "category": "Language",
    "language": "fr",
    "difficulty": "Intermediate",
    "tags": [
      "bac",
      "terminale",
      "francais",
      "analyse",
      "methodologie"
    ],
    "cards": [
      {
        "front": "Quelle différence fais-tu entre genre, registre et mouvement littéraire ?",
        "back": "Le genre est une forme (roman, théâtre, poésie) ; le registre est un effet recherché (tragique, comique, satirique…) ; le mouvement est un courant historique (classicisme, romantisme…).",
        "hint": "Forme / effet / courant."
      },
      {
        "front": "Qu’appelle-t-on « registre littéraire » ?",
        "back": "L’effet principal que le texte cherche à produire sur le lecteur (émouvoir, faire rire, effrayer, dénoncer…).",
        "hint": "Effet sur le lecteur."
      },
      {
        "front": "Cite 4 registres fréquents au bac et leur effet principal.",
        "back": "Lyrique (émotion), tragique (pitié/terreur), comique (rire), satirique (critique par moquerie/ironie).",
        "hint": "Lyrique/tragique/comique/satire."
      },
      {
        "front": "Qu’est-ce qu’une figure de style (définition simple) ?",
        "back": "Un procédé d’écriture qui modifie l’expression ordinaire pour produire un effet (image, insistance, contraste, ironie…).",
        "hint": "Procédé → effet."
      },
      {
        "front": "Quelle différence entre comparaison et métaphore ?",
        "back": "La comparaison rapproche deux éléments avec un outil de comparaison (comme, tel que) ; la métaphore rapproche sans outil (assimilation directe).",
        "hint": "Avec / sans “comme”."
      },
      {
        "front": "Qu’est-ce qu’une antithèse et quel effet produit-elle ?",
        "back": "L’opposition de deux idées/termes dans une même construction, souvent pour créer un contraste et renforcer une tension.",
        "hint": "Opposition mise en scène."
      },
      {
        "front": "Qu’est-ce que l’ironie (au sens littéraire) ?",
        "back": "Dire le contraire de ce qu’on pense ou faire entendre un décalage, pour critiquer ou provoquer une lecture à double sens.",
        "hint": "Double sens."
      },
      {
        "front": "Qu’appelle-t-on « champ lexical » ?",
        "back": "Un ensemble de mots liés à une même idée/thème, qui crée une cohérence et oriente l’interprétation.",
        "hint": "Famille de mots."
      },
      {
        "front": "Qu’est-ce que la modalisation ?",
        "back": "Les marques qui expriment l’attitude du locuteur (certitude, doute, jugement) : adverbes, verbes d’opinion, conditionnel, ponctuation…",
        "hint": "Doute/certitude/jugement."
      },
      {
        "front": "Qu’est-ce qu’un point de vue (focalisation) en narration ?",
        "back": "La manière dont l’information est donnée : focalisation zéro (omniscient), interne (par un personnage), externe (vision “caméra”).",
        "hint": "Zéro / interne / externe."
      },
      {
        "front": "Quelle différence entre narrateur et auteur ?",
        "back": "Le narrateur est une voix construite dans le texte ; l’auteur est la personne réelle qui écrit. On n’attribue pas automatiquement les idées du narrateur à l’auteur.",
        "hint": "Voix du texte vs personne réelle."
      },
      {
        "front": "Qu’est-ce que la double énonciation au théâtre ?",
        "back": "Au théâtre, un personnage parle à un autre personnage, mais le texte s’adresse aussi au public (effets dramatiques, ironie, révélation).",
        "hint": "Personnage + public."
      },
      {
        "front": "Qu’appelle-t-on un « monologue » et à quoi sert-il ?",
        "back": "Une prise de parole d’un personnage seul, qui dévoile pensées, conflit intérieur ou décision, et fait avancer l’action.",
        "hint": "Parole seul."
      },
      {
        "front": "Qu’est-ce qu’un alexandrin ?",
        "back": "Un vers de 12 syllabes, souvent structuré en deux hémistiches (6/6) séparés par une césure.",
        "hint": "12 syllabes."
      },
      {
        "front": "Quelle différence entre rime riche, suffisante et pauvre ?",
        "back": "Pauvre: 1 son commun ; suffisante: 2 sons ; riche: 3 sons ou plus partagés entre les mots rimant.",
        "hint": "1 / 2 / 3+ sons."
      },
      {
        "front": "Qu’est-ce qu’une thèse dans un texte argumentatif ?",
        "back": "L’idée principale que l’auteur défend. Elle est soutenue par des arguments et des exemples, parfois en réponse à une thèse opposée.",
        "hint": "Idée défendue."
      },
      {
        "front": "Qu’est-ce qu’un argument et comment le rendre convaincant ?",
        "back": "Un raisonnement qui soutient une thèse ; il devient convaincant s’il est justifié et illustré par un exemple précis (fait, citation, référence).",
        "hint": "Raison + preuve."
      },
      {
        "front": "Quelle est la différence entre convaincre et persuader ?",
        "back": "Convaincre s’appuie sur la raison (logique, preuves) ; persuader s’appuie davantage sur l’émotion et la mise en scène (pathos).",
        "hint": "Raison vs émotion."
      },
      {
        "front": "Qu’est-ce qu’une « problématique » au bac de français ?",
        "back": "Une question directrice qui met en tension les enjeux du texte/sujet et organise l’analyse ou l’argumentation.",
        "hint": "Question qui guide."
      },
      {
        "front": "Dans un commentaire, quel enchaînement d’analyse est le plus sûr ?",
        "back": "Repérer un procédé, expliquer l’effet produit, puis relier à l’enjeu global du passage (sens/interprétation).",
        "hint": "Procédé → effet → enjeu."
      },
      {
        "front": "Quelle est la différence entre paraphrase et analyse ?",
        "back": "La paraphrase répète ce que dit le texte ; l’analyse explique comment il le dit et ce que cela produit comme sens et effet.",
        "hint": "Répéter vs expliquer."
      },
      {
        "front": "Qu’est-ce qu’une proposition subordonnée (rappel utile) ?",
        "back": "Une proposition dépendante d’une principale, introduite souvent par un subordonnant (que, qui, lorsque…), avec des fonctions (relative, complétive, circonstancielle).",
        "hint": "Dépend de la principale."
      },
      {
        "front": "Pourquoi les valeurs des temps sont-elles importantes à l’oral (grammaire) ?",
        "back": "Parce qu’elles expliquent le sens: un présent peut être d’énonciation, de vérité générale ou de narration; le choix du temps produit un effet.",
        "hint": "Sens du temps choisi."
      },
      {
        "front": "À l’oral du bac de français, quelles sont les deux grandes parties de l’épreuve ?",
        "back": "1) Explication linéaire + question de grammaire ; 2) Présentation d’une œuvre choisie + entretien. Réf : https://www.education.gouv.fr/bo/20/Special7/MENE2019312N.htm",
        "hint": "Texte/grammaire puis œuvre/entretien."
      }
    ],
    "sampleIdeas": [
      {
        "name": "Cadre officiel: programme & épreuves (EAF)",
        "textDescription": "Avant de réviser, il faut sécuriser le cadre officiel: le programme de français de première (voie générale et technologique) fixe les objets d’étude, la logique œuvre/parcours, et les compétences attendues. Les épreuves anticipées (écrit + oral) sont décrites par une note de service: formats, déroulé, et ce qui est évalué.\n\nPour utiliser ces textes sans te perdre, transforme-les en checklist: (1) savoir définir les notions d’analyse (genre, registre, figures, narration), (2) savoir rédiger une réponse structurée (intro, axes/parties, transitions), (3) savoir mobiliser tes œuvres et lectures de l’année.\n\nQuand tu as un doute (sur un format, une attente, le rôle des œuvres/parcours), reviens à l’officiel. Tu évites ainsi de réviser des “mythes” ou des consignes obsolètes.\n\nEnsuite seulement, tu peux utiliser des ressources d’entraînement (vidéos, fiches) pour gagner en vitesse et en clarté.",
        "videoURL": "https://www.youtube.com/playlist?list=PLaBhcH5THSyDuMbL0WpjLVgskwASkOUF8",
        "externalLinkURL": "https://eduscol.education.fr/document/5795/download",
        "linkedCardIndices": []
      },
      {
        "name": "Boîte à outils: analyser un texte littéraire",
        "textDescription": "Une analyse réussie repose sur une boîte à outils stable: identifier le genre (poésie, théâtre, roman, essai), repérer la situation d’énonciation (qui parle, à qui, quand), et comprendre le mouvement du texte (progression des idées ou des émotions).\n\nEnsuite, repère des procédés ciblés (figures, rythmes, champs lexicaux, temps verbaux, modalités) et explique toujours l’effet produit. L’erreur classique est de nommer un procédé sans dire à quoi il sert.\n\nPour aller plus loin, relie ces effets à un enjeu (ce que le texte cherche à faire: émouvoir, dénoncer, convaincre, construire un personnage, installer une tension). C’est ce lien qui transforme une liste d’observations en interprétation.\n\nAstuce: entraîne-toi sur de petits extraits en 3 minutes: 1 enjeu, 3 procédés, 3 effets. Avec la répétition, tu deviens rapide et précis.",
        "videoURL": "https://www.youtube.com/watch?v=gzi_x-aLN_E",
        "externalLinkURL": "https://www.lumni.fr/dossier/l-essentiel-a-savoir-pour-reussir-les-etudes-de-textes-litteraires",
        "linkedCardIndices": []
      },
      {
        "name": "Commentaire: trouver un plan solide",
        "textDescription": "Le plan du commentaire est une traduction de ta lecture: il organise tes idées en 2–3 axes cohérents, chacun soutenu par des preuves (citations courtes) et une interprétation. Un bon axe n’est pas un procédé (“les métaphores”), mais une idée (“un portrait critique”, “une progression vers la rupture”).\n\nMéthode simple: repère d’abord les mouvements du texte, puis propose 2–3 grandes idées qui expliquent comment le texte construit son effet. Pour chaque axe, liste 3 éléments: un procédé, une citation, un effet.\n\nVérifie ensuite la cohérence: chaque axe doit répondre à la problématique. Si un axe ne répond pas, il est hors-plan.\n\nEnfin, annonce ton plan clairement dans l’introduction: le correcteur doit comprendre en 20 secondes le trajet de ta copie.",
        "videoURL": "https://www.youtube.com/watch?v=FpRkrLh1-nY",
        "externalLinkURL": "https://www.lumni.fr/video/le-plan-du-commentaire-compose",
        "linkedCardIndices": []
      },
      {
        "name": "Commentaire: écrire une introduction efficace",
        "textDescription": "Une introduction efficace présente le texte, fait émerger un enjeu, puis annonce une problématique et un plan. Elle n’a pas besoin d’être longue: elle doit être précise.\n\nCommence par identifier l’auteur, l’œuvre (si connue), le genre et la situation du passage. Ajoute seulement le contexte qui éclaire l’extrait. Puis formule une problématique: une question qui met en tension ce que fait le texte (effet, intention, enjeu).\n\nAnnonce ensuite le plan avec 2–3 axes formulés comme des idées (pas comme des mots techniques). Cela évite les plans “catalogues”.\n\nAstuce: écris d’abord problématique + plan, puis reviens à la présentation. Tu éviteras le blabla.",
        "videoURL": "https://www.youtube.com/watch?v=Tz9uHq8vm_Q",
        "externalLinkURL": "https://www.lumni.fr/video/l-introduction-du-commentaire-compose",
        "linkedCardIndices": []
      },
      {
        "name": "Dissertation: construire un plan (dialectique/thématique)",
        "textDescription": "En dissertation, le plan dépend de la forme de la question. Certaines questions appellent une discussion (plan dialectique): une réponse plausible, une objection qui nuance, puis un dépassement qui approfondit. D’autres questions appellent plutôt trois aspects complémentaires (plan thématique) qui couvrent le sujet.\n\nPour choisir, commence par analyser les termes et reformuler le sujet. Demande-toi ensuite: peut-on répondre par oui/non ? Si oui, le dialectique est souvent pertinent. Si non, un thématique bien pensé est préférable.\n\nDans tous les cas, chaque partie doit apporter une étape de réponse, soutenue par des exemples précis (œuvres, textes, lectures). Les transitions servent à montrer la progression.\n\nLe secret: un plan n’est pas un modèle; c’est une solution au problème posé par ce sujet-là.",
        "videoURL": "https://www.youtube.com/watch?v=-Tkcnze-EsQ",
        "externalLinkURL": "https://www.lumni.fr/video/le-plan-de-la-dissertation",
        "linkedCardIndices": []
      },
      {
        "name": "Dissertation: réussir l’introduction",
        "textDescription": "L’introduction doit montrer que tu as compris le sujet et que tu sais où tu vas. Elle comporte: une accroche utile (liée à l’objet d’étude), des définitions/reformulation, une problématique, puis l’annonce du plan.\n\nLes définitions sont cruciales: elles évitent le hors-sujet. Une problématique efficace révèle une tension: pourquoi la question n’est pas évidente.\n\nL’annonce du plan doit suivre la logique de la problématique. Si ton plan ne découle pas du problème, il risque d’être plaqué.\n\nConseil pratique: écris d’abord définitions + problématique + plan, puis ajoute l’accroche en une phrase. Tu gagneras en clarté et en temps.",
        "videoURL": "https://www.youtube.com/watch?v=fJvfVP0tGuU",
        "externalLinkURL": "https://www.lumni.fr/video/l-introduction-de-la-dissertation",
        "linkedCardIndices": []
      },
      {
        "name": "Oral: réussir l’explication linéaire",
        "textDescription": "L’explication linéaire suit le texte dans l’ordre, mais ce n’est pas un résumé. Tu dois montrer la progression (mouvements) et expliquer comment le texte produit son effet.\n\nMéthode: (1) introduis le texte et l’enjeu en quelques phrases, (2) annonce 2–3 mouvements, (3) pour chaque mouvement, choisis 1–2 procédés forts et explique leur effet, (4) fais un mini-bilan final qui répond à ton enjeu.\n\nPour éviter la paraphrase: chaque fois que tu dis “le texte dit…”, ajoute “ce qui montre…” ou “ce qui produit…”.\n\nEntraîne-toi en conditions réelles: 12 minutes d’exposé chronométré + 3 questions. La clarté vient de la répétition.",
        "videoURL": "https://www.youtube.com/watch?v=wtz886vHa4Q",
        "externalLinkURL": "https://www.lumni.fr/video/l-explication-lineaire-a-l-oral",
        "linkedCardIndices": []
      },
      {
        "name": "Oral: question de grammaire (les pièges fréquents)",
        "textDescription": "La question de grammaire n’attend pas une leçon complète: elle attend une identification juste et une explication claire. Ton plan mental: identifier le fait de langue, le nommer, expliquer la construction, puis dire l’effet de sens si pertinent.\n\nLes pièges fréquents: confondre relative et complétive, oublier la fonction, ou parler des temps verbaux sans préciser leur valeur (présent de narration, présent de vérité générale…).\n\nPour réviser efficacement, travaille par familles: propositions (principales/subordonnées), classes de mots, fonctions, valeurs des temps et modes.\n\nÀ l’oral, la simplicité gagne: une réponse courte, exacte, et illustrée par un exemple du texte vaut mieux qu’une réponse longue et confuse.",
        "videoURL": "https://www.youtube.com/watch?v=bnHoA9jDF30",
        "externalLinkURL": "https://lesfondamentaux.reseau-canope.fr/video/francais/grammaire/phrase-simple-phrase-complexe/les-propositions-subordonnees-relatives",
        "linkedCardIndices": []
      },
      {
        "name": "Figures de style indispensables (liste utile Bac)",
        "textDescription": "Au bac, l’objectif n’est pas de réciter 40 figures: c’est d’identifier celles qui aident vraiment à expliquer un effet. Priorité: comparaison/métaphore (image), antithèse/oxymore (contraste), hyperbole/litote (intensité), anaphore (insistance), ironie/antiphrase (double sens).\n\nLa règle d’or: nommer une figure ne suffit jamais. Il faut dire ce qu’elle fait: crée une image, renforce une tension, ridiculise, dramatise, etc.\n\nMéthode d’entraînement: prends 5 phrases et force-toi à écrire “figure → effet → enjeu”. Tu construis un réflexe d’analyse.\n\nEn oral, mieux vaut citer 1 figure bien expliquée que 4 figures mal reliées au sens.",
        "videoURL": "https://www.youtube.com/watch?v=13nS9zxW4oA",
        "externalLinkURL": "https://www.lumni.fr/dossier/l-essentiel-a-savoir-pour-reussir-les-etudes-de-textes-litteraires",
        "linkedCardIndices": []
      },
      {
        "name": "Registres littéraires: reconnaître et expliquer l’effet",
        "textDescription": "Un registre est un effet dominant: tragique (fatalité, peur/pitié), comique (rire), satirique (critique), lyrique (expression des émotions), fantastique (hésitation), épique (grandiose), pathétique (compassion).\n\nPour les reconnaître, cherche des indices: lexique, tonalité, rythmes, ponctuation, images, scènes types. Ensuite, explique l’effet sur le lecteur: ce n’est pas “c’est tragique”, c’est “le texte produit une impression de… parce que…”.\n\nAstuce: associe chaque registre à 2 marqueurs (lexique/figures) et 1 effet. Tu mémorises vite.\n\nDans un commentaire, relie le registre à l’enjeu: pourquoi l’auteur choisit cet effet ici ?",
        "videoURL": "https://www.youtube.com/watch?v=bW0cJ3EbRHg",
        "externalLinkURL": "https://app.lesbonsprofs.com/nos-cours/seconde/francais/les-registres-litteraires-1196",
        "linkedCardIndices": []
      }
    ]
  },
  {
    "stableId": "bac_geographie_territoires_reperes_terminale",
    "name": "Bac Géographie: territoires & repères (Terminale)",
    "description": "Repères indispensables en géographie (terminale): mondialisation, métropoles, flux, interfaces, mers et océans, UE, inégalités territoriales. Définitions + exemples localisés.",
    "color": "green",
    "category": "Geography",
    "language": "fr",
    "difficulty": "Advanced",
    "tags": [
      "bac",
      "terminale",
      "geographie",
      "territoires",
      "mondialisation"
    ],
    "cards": [
      {
        "front": "Qu’est-ce qu’un territoire en géographie (définition utile) ?",
        "back": "Un espace approprié et organisé par des acteurs (habitants, États, entreprises) avec des pratiques, des représentations et des enjeux.",
        "hint": "Espace approprié + acteurs."
      },
      {
        "front": "Qu’est-ce que la mondialisation (définition Bac) ?",
        "back": "Un processus d’intensification des échanges et des interdépendances à l’échelle mondiale, connectant les territoires de façon inégale.",
        "hint": "Échanges + interdépendances."
      },
      {
        "front": "Qu’est-ce qu’un flux (en géographie) ?",
        "back": "Un déplacement mesurable (personnes, marchandises, capitaux, données) entre lieux, organisé par des réseaux.",
        "hint": "Déplacements + réseaux."
      },
      {
        "front": "Qu’est-ce qu’une interface (en géographie) ?",
        "back": "Un espace de contact et d’échanges entre deux ensembles (littoral, détroit, frontière dynamique) où se concentrent flux et enjeux.",
        "hint": "Contact + échanges."
      },
      {
        "front": "Qu’est-ce qu’une métropole ?",
        "back": "Une grande ville qui concentre fonctions de commandement (économiques, politiques, culturelles) et polarise un espace.",
        "hint": "Commandement."
      },
      {
        "front": "Qu’est-ce que la métropolisation ?",
        "back": "La concentration des populations, activités et fonctions stratégiques dans les grandes villes, renforçant hiérarchies et inégalités.",
        "hint": "Concentration urbaine."
      },
      {
        "front": "Qu’est-ce qu’une mégalopole ?",
        "back": "Un vaste ensemble urbanisé continu ou quasi-continu regroupant plusieurs métropoles et fortes densités (ex: BosWash).",
        "hint": "Grand couloir urbain."
      },
      {
        "front": "Donne un exemple de mégalopole et sa localisation.",
        "back": "La mégalopole américaine BosWash, du Nord-Est des États-Unis (Boston à Washington).",
        "hint": "Côte Est USA."
      },
      {
        "front": "Qu’est-ce qu’une FTN (firme transnationale) ?",
        "back": "Une entreprise implantée dans plusieurs pays, organisant production, recherche et ventes à l’échelle mondiale (siège, filiales, sous-traitants).",
        "hint": "Entreprise multi-pays."
      },
      {
        "front": "Qu’est-ce qu’un hub (transport/logistique) ?",
        "back": "Un nœud majeur où se concentrent et se redistribuent les flux (aéroport, port), facilitant les correspondances et la connexion aux réseaux mondiaux.",
        "hint": "Nœud de redistribution."
      },
      {
        "front": "Donne un exemple de hub portuaire mondial.",
        "back": "Le port de Shanghai (Chine) est un hub majeur des échanges maritimes mondiaux (conteneurs).",
        "hint": "Shanghai."
      },
      {
        "front": "Qu’est-ce qu’une ZIP (zone industrialo-portuaire) ?",
        "back": "Un espace portuaire et industriel où se concentrent activités de production, stockage et logistique, connecté aux routes maritimes et terrestres.",
        "hint": "Port + industrie + logistique."
      },
      {
        "front": "Qu’est-ce qu’une façade maritime ?",
        "back": "Un littoral fortement équipé et urbanisé, concentrant ports, industries et flux (ex: Northern Range).",
        "hint": "Littoral organisé."
      },
      {
        "front": "Cite une grande façade maritime européenne et ce qu’elle concentre.",
        "back": "La Northern Range (de Le Havre à Hambourg) concentre ports majeurs, industries et échanges européens.",
        "hint": "Le Havre → Hambourg."
      },
      {
        "front": "Pourquoi les mers et océans sont-ils centraux dans la mondialisation ?",
        "back": "Ils supportent une grande part du commerce mondial, structurent routes/détroits, et concentrent enjeux de ressources, puissance et câbles sous-marins.",
        "hint": "Routes + détroits."
      },
      {
        "front": "Qu’est-ce qu’un détroit stratégique ? Donne un exemple.",
        "back": "Un passage maritime étroit concentrant le trafic et les tensions; exemple: le détroit de Malacca.",
        "hint": "Passage étroit."
      },
      {
        "front": "Qu’est-ce qu’un canal stratégique ? Donne un exemple.",
        "back": "Une voie artificielle raccourcissant les routes; exemple: canal de Suez (entre Méditerranée et mer Rouge).",
        "hint": "Suez/Panama."
      },
      {
        "front": "Qu’est-ce qu’une ZEE ?",
        "back": "Une zone maritime (jusqu’à 200 milles nautiques) où un État a des droits souverains d’exploitation des ressources. Réf : https://www.un.org/depts/los/convention_agreements/texts/unclos/unclos_e.pdf",
        "hint": "200 milles."
      },
      {
        "front": "Pourquoi les câbles sous-marins sont-ils un enjeu géopolitique ?",
        "back": "Ils transportent l’essentiel des données internationales; leur contrôle, protection ou sabotage affecte économie, sécurité et souveraineté numérique.",
        "hint": "Internet sous la mer."
      },
      {
        "front": "Qu’est-ce qu’un espace productif (définition) ?",
        "back": "Un espace où se concentrent activités économiques (industrie, agriculture, services) organisé par des acteurs et des infrastructures.",
        "hint": "Activités + organisation."
      },
      {
        "front": "Qu’est-ce qu’une chaîne de valeur mondiale ?",
        "back": "La division internationale des étapes de production (conception, fabrication, assemblage, distribution) réparties entre plusieurs territoires.",
        "hint": "Étapes réparties."
      },
      {
        "front": "Pourquoi parle-t-on d’inégalités d’intégration à la mondialisation ?",
        "back": "Parce que certains territoires sont très connectés (métropoles, hubs) tandis que d’autres restent périphériques ou marginalisés.",
        "hint": "Centres/périphéries."
      },
      {
        "front": "Qu’est-ce qu’un centre d’impulsion ?",
        "back": "Un territoire qui commande et organise des flux (décision, innovation, finance) et influence l’économie mondiale.",
        "hint": "Décision/innovation."
      },
      {
        "front": "Cite deux centres d’impulsion mondiaux.",
        "back": "New York et Londres sont des centres majeurs (finance, commandement).",
        "hint": "Finance."
      },
      {
        "front": "Qu’est-ce qu’une puissance (en géographie/géopolitique) ?",
        "back": "La capacité d’un acteur à influencer d’autres acteurs et l’organisation de l’espace mondial par des moyens économiques, militaires, diplomatiques, culturels.",
        "hint": "Influencer."
      },
      {
        "front": "Qu’est-ce que la Triade (concept) ?",
        "back": "Les trois grands pôles dominants de l’économie mondiale (Amérique du Nord, Europe occidentale, Asie orientale) historiquement les plus intégrés.",
        "hint": "3 pôles majeurs."
      },
      {
        "front": "Pourquoi le concept de Triade est-il discuté aujourd’hui ?",
        "back": "Parce que la hiérarchie évolue (montée de la Chine, émergents) et les flux se recomposent; la domination n’est plus aussi exclusive.",
        "hint": "Hiérarchie change."
      },
      {
        "front": "Qu’est-ce qu’un pays émergent (définition) ?",
        "back": "Un pays en forte croissance et insertion internationale, mais avec des inégalités internes et des fragilités (sociales, institutionnelles).",
        "hint": "Croissance + inégalités."
      },
      {
        "front": "Cite un exemple de pays émergent et une caractéristique.",
        "back": "L’Inde: forte croissance et poids démographique, mais fortes inégalités socio-spatiales.",
        "hint": "Inde."
      },
      {
        "front": "Qu’est-ce qu’un PMA (pays les moins avancés) ?",
        "back": "Catégorie de l’ONU regroupant des pays très vulnérables (faible revenu, indicateurs sociaux faibles, fragilité économique). Réf : https://www.un.org/development/desa/dpad/least-developed-country-category.html",
        "hint": "Catégorie ONU."
      },
      {
        "front": "Qu’est-ce que l’urbanisation ?",
        "back": "L’augmentation de la part de population vivant en ville et l’extension des espaces urbanisés.",
        "hint": "Plus de citadins."
      },
      {
        "front": "Qu’est-ce qu’un espace périurbain ?",
        "back": "Un espace autour des villes, mêlant fonctions urbaines et rurales, souvent marqué par mobilités pendulaires et étalement urbain.",
        "hint": "Autour des villes."
      },
      {
        "front": "Qu’est-ce qu’un étalement urbain ?",
        "back": "L’extension des villes sur les espaces périphériques, souvent liée à l’automobile, au logement pavillonnaire et aux zones d’activités.",
        "hint": "Ville qui s’étend."
      },
      {
        "front": "Qu’est-ce qu’un ghetto et à quoi renvoie la ségrégation socio-spatiale ?",
        "back": "Le ghetto est un espace de concentration d’un groupe; la ségrégation socio-spatiale désigne la séparation des groupes sociaux dans l’espace urbain.",
        "hint": "Séparation dans la ville."
      },
      {
        "front": "Qu’est-ce qu’une ville mondiale (global city) ?",
        "back": "Une métropole très connectée qui concentre fonctions de commandement et réseaux internationaux (finance, sièges, culture).",
        "hint": "Très connectée."
      },
      {
        "front": "Cite une ville mondiale et une fonction de commandement.",
        "back": "New York: fonctions financières (Wall Street) et sièges d’organisations internationales (ONU).",
        "hint": "Finance/ONU."
      },
      {
        "front": "Qu’est-ce qu’une smart city (idée générale) ?",
        "back": "Une ville utilisant données et technologies pour gérer mobilité, énergie, services, avec enjeux de gouvernance, données et inégalités.",
        "hint": "Données en ville."
      },
      {
        "front": "Qu’est-ce qu’un risque (en géographie) ?",
        "back": "La combinaison d’un aléa (événement) et d’une vulnérabilité (enjeux exposés), produisant des dommages potentiels.",
        "hint": "Aléa + vulnérabilité."
      },
      {
        "front": "Donne un exemple de risque lié au littoral.",
        "back": "Submersion et érosion côtière: aléa tempête/élévation du niveau marin + vulnérabilité des populations et infrastructures littorales.",
        "hint": "Submersion/érosion."
      },
      {
        "front": "Qu’est-ce que le développement durable (définition) ?",
        "back": "Un développement qui répond aux besoins du présent sans compromettre la capacité des générations futures, en articulant économie, social et environnement.",
        "hint": "3 piliers."
      },
      {
        "front": "Qu’est-ce qu’une transition énergétique ?",
        "back": "La transformation du système énergétique vers des sources moins carbonées, l’efficacité, et des usages plus sobres, avec enjeux sociaux et géopolitiques.",
        "hint": "Moins carboné."
      },
      {
        "front": "Pourquoi l’énergie est-elle un enjeu géopolitique ?",
        "back": "Parce qu’elle conditionne puissance et développement; dépendances, routes, producteurs et prix créent rivalités et alliances.",
        "hint": "Dépendances."
      },
      {
        "front": "Qu’est-ce que la littoralisation ?",
        "back": "La concentration des populations et activités sur les littoraux, liée aux échanges maritimes et à l’attractivité, mais augmentant les risques.",
        "hint": "Concentration sur littoraux."
      },
      {
        "front": "Qu’est-ce que l’UE en géographie (angle Bac) ?",
        "back": "Un ensemble régional intégré (marché, politiques) inséré dans la mondialisation, avec centres puissants et contrastes internes.",
        "hint": "Intégration + contrastes."
      },
      {
        "front": "Qu’est-ce que la dorsale européenne (mégalopole européenne) ?",
        "back": "Le cœur dense et riche de l’Europe occidentale reliant grandes métropoles et axes majeurs (Londres–Benelux–Rhénanie–Suisse–Nord Italie).",
        "hint": "Cœur européen."
      },
      {
        "front": "Cite deux grandes métropoles de la dorsale européenne.",
        "back": "Londres et Francfort (ou Paris, Amsterdam, Milan), pôles de commandement et de flux.",
        "hint": "Commandement européen."
      },
      {
        "front": "Qu’est-ce qu’une frontière (en géographie) ?",
        "back": "Une limite politique et/ou une zone de contact; elle peut être barrière, filtre ou interface selon les flux et les politiques.",
        "hint": "Barrière/filtre/interface."
      },
      {
        "front": "Donne un exemple de frontière-interface en Europe.",
        "back": "La frontière franco-belge: échanges intenses, mobilités quotidiennes, économie transfrontalière.",
        "hint": "Interface."
      },
      {
        "front": "Pourquoi les routes maritimes et détroits sont-ils des “points de tension” ?",
        "back": "Parce qu’ils concentrent le trafic et peuvent être contrôlés ou perturbés, affectant commerce, énergie et sécurité.",
        "hint": "Concentration + contrôle."
      },
      {
        "front": "Où trouver des définitions fiables et des dossiers de géographie (Terminale) ?",
        "back": "Sur Géoconfluences (ENS) et Éduscol, ressources de référence. Réf : https://geoconfluences.ens-lyon.fr/ et https://eduscol.education.fr/1667/programmes-et-ressources-en-histoire-geographie-voie-gt",
        "hint": "Géoconfluences / Éduscol."
      }
    ],
    "sampleIdeas": [
      {
        "name": "Programme officiel Terminale (HG): base fiable",
        "textDescription": "Pour réviser juste, commence par le programme officiel de terminale. Il fixe les thèmes, les capacités (croquis, composition, analyse) et les notions attendues. C’est le point de départ le plus fiable avant d’utiliser des fiches.\n\nMéthode: transforme le programme en liste de repères: (1) 25 définitions utilisables, (2) 15 exemples localisés (ports, détroits, métropoles), (3) 5 cartes mentales (flux, hiérarchies, interfaces).\n\nEnsuite, utilise des ressources de référence (Éduscol, Géoconfluences) pour consolider définitions, cartes et études de cas.\n\nEnfin, fais du rappel actif: récite une définition + donne un exemple localisé en 15 secondes. C’est exactement ce que le bac valorise.",
        "videoURL": "https://www.youtube.com/watch?v=UR6bTiak6W4",
        "externalLinkURL": "https://eduscol.education.fr/1667/programmes-et-ressources-en-histoire-geographie-voie-gt",
        "linkedCardIndices": []
      },
      {
        "name": "Mondialisation: flux, acteurs, hiérarchies",
        "textDescription": "La mondialisation s’explique par l’intensification des flux (marchandises, capitaux, personnes, données) et par la puissance des réseaux (maritimes, aériens, numériques). Les acteurs clés sont les États, les FTN, les organisations internationales et les grandes villes.\n\nPour analyser, pense en hiérarchies: centres d’impulsion (métropoles globales, façades, hubs) et périphéries plus ou moins intégrées. Les inégalités d’intégration sont un point essentiel.\n\nExemples solides: Northern Range (façade), Shanghai (hub), Malacca (détroit), New York/Londres (commandement), câbles sous-marins (données).\n\nÀ l’écrit, relie toujours un exemple à un mécanisme: “ce lieu est stratégique parce que…”.",
        "videoURL": "https://www.youtube.com/watch?v=8Bbe0E41xzs",
        "externalLinkURL": "https://geoconfluences.ens-lyon.fr/glossaire/mondialisation",
        "linkedCardIndices": []
      },
      {
        "name": "Métropolisation: ville mondiale, réseaux, inégalités",
        "textDescription": "La métropolisation est la concentration des fonctions de commandement et des richesses dans les grandes villes. Les métropoles se connectent entre elles par des réseaux (aérien, financier, numérique) et structurent les territoires.\n\nUne ville mondiale (global city) combine connectivité internationale, commandement économique, innovation et influence culturelle. Mais la métropolisation produit aussi des inégalités: gentrification, ségrégation, périphéries en difficulté.\n\nExemples: New York (finance), Londres (services), Paris (commandement), Shanghai (hub), Dubaï (plateforme).\n\nPour le bac, associe définition + 1 exemple + 1 limite (inégalités, coûts, pollution).",
        "videoURL": "https://www.youtube.com/watch?v=9VwG5b0x3gA",
        "externalLinkURL": "https://geoconfluences.ens-lyon.fr/glossaire/metropolisation",
        "linkedCardIndices": []
      },
      {
        "name": "Mers et océans: routes, détroits, ZEE, câbles",
        "textDescription": "Les mers et océans sont centraux car ils supportent l’essentiel des échanges maritimes et concentrent des points de passage obligés (détroits, canaux). Ils sont aussi des espaces de puissance (bases, contrôle) et de ressources (pêche, hydrocarbures).\n\nLes ZEE donnent aux États des droits d’exploitation jusqu’à 200 milles nautiques, ce qui crée rivalités et stratégies de souveraineté. Les câbles sous-marins, eux, transportent une grande partie des données mondiales: enjeu de sécurité et de contrôle.\n\nExemples: Malacca, Ormuz, Bab el-Mandeb; Suez, Panama; mer de Chine méridionale; câbles transatlantiques.\n\nAu bac, une bonne copie relie espace maritime et géopolitique: commerce, énergie, sécurité.",
        "videoURL": "https://www.youtube.com/watch?v=j1IPvZAjMlQ",
        "externalLinkURL": "https://www.un.org/depts/los/convention_agreements/texts/unclos/unclos_e.pdf",
        "linkedCardIndices": []
      },
      {
        "name": "Façades maritimes et ports: Northern Range, Asie orientale",
        "textDescription": "Une façade maritime est un littoral très équipé qui concentre ports, industries et échanges. Elle organise les flux à grande échelle. En Europe, la Northern Range est une façade majeure; en Asie, les façades chinoises et plus largement d’Asie orientale structurent une grande part du commerce mondial.\n\nLes ports fonctionnent comme hubs: ils concentrent, transbordent et redistribuent. Les ZIP associent activités portuaires et industrielles, reliant mer et hinterland.\n\nExemples: Rotterdam/Anvers (Northern Range), Shanghai/Ningbo, Singapour. Les corridors terrestres (rail, fleuves) relient ces ports aux espaces intérieurs.\n\nPour le bac: définis, localise, explique le rôle, puis donne une limite (congestion, pollution, dépendances).",
        "videoURL": "https://www.youtube.com/watch?v=nf8S1uCkAG8",
        "externalLinkURL": "https://geoconfluences.ens-lyon.fr/glossaire/facade-maritime",
        "linkedCardIndices": []
      },
      {
        "name": "UE: dorsale européenne, centres et périphéries",
        "textDescription": "L’Union européenne est un espace intégré mais contrasté. La dorsale européenne (mégalopole) concentre métropoles, axes et richesses. D’autres espaces sont plus périphériques ou spécialisés.\n\nPour analyser l’UE, pense en réseaux (axes, corridors), en centres (métropoles, régions motrices) et en politiques (cohésion, marché). La mondialisation renforce certaines régions mais peut fragiliser d’autres.\n\nExemples: Londres–Benelux–Rhénanie–Suisse–Nord Italie (dorsale), ports du Nord, métropoles comme Paris, Francfort, Milan.\n\nUne bonne copie montre à la fois puissance (marché, normes) et limites (inégalités, tensions politiques).",
        "videoURL": "https://www.youtube.com/watch?v=GTof_Wlc2lo",
        "externalLinkURL": "https://geoconfluences.ens-lyon.fr/glossaire/dorsale-europeenne",
        "linkedCardIndices": []
      },
      {
        "name": "Développement: IDH, inégalités, émergents, PMA",
        "textDescription": "Le développement se mesure par plusieurs indicateurs: revenu, santé, éducation. L’IDH (PNUD) synthétise ces dimensions. Les territoires ne suivent pas la même trajectoire: émergents, pays développés, PMA.\n\nLes inégalités sont aussi internes: elles opposent souvent métropoles connectées et régions marginalisées. C’est un point central pour comprendre la mondialisation.\n\nExemples: Inde (émergent, fortes inégalités), pays du Sahel (vulnérabilités), littoraux dynamiques vs arrière-pays.\n\nAu bac, relie toujours un indicateur à une explication: pourquoi ce territoire progresse ou stagne ?",
        "videoURL": "https://www.youtube.com/watch?v=6SXm7k8cQxM",
        "externalLinkURL": "https://hdr.undp.org/",
        "linkedCardIndices": []
      },
      {
        "name": "Villes: ségrégation, gentrification, périurbanisation",
        "textDescription": "Les dynamiques urbaines combinent concentration et fragmentation. La ségrégation socio-spatiale sépare les groupes sociaux dans l’espace (quartiers riches/pauvres). La gentrification transforme certains quartiers par l’arrivée de populations plus aisées.\n\nLa périurbanisation et l’étalement urbain étendent la ville vers la périphérie, avec dépendance automobile, consommation d’espace et inégalités de mobilité.\n\nExemples: grandes métropoles françaises (Paris, Lyon) et leurs couronnes; modèles dans le monde (banlieues, gated communities).\n\nPour le bac: définis + donne un exemple concret + explique un effet (prix, mobilités, environnement).",
        "videoURL": "https://www.youtube.com/watch?v=HcJ7y7wGQh4",
        "externalLinkURL": "https://geoconfluences.ens-lyon.fr/glossaire/periurbanisation",
        "linkedCardIndices": []
      },
      {
        "name": "Transitions: énergie, climat, risques (territoires vulnérables)",
        "textDescription": "Les transitions (énergétique, écologique) transforment les territoires: choix énergétiques, sobriété, infrastructures, dépendances. Elles créent aussi des tensions (acceptabilité, coûts, justice sociale).\n\nLes risques se définissent par aléa + vulnérabilité. Les littoraux concentrent population et activités (littoralisation) mais sont exposés à submersion, tempêtes et érosion, amplifiés par le changement climatique.\n\nExemples: deltas densément peuplés, villes littorales, territoires touristiques, infrastructures portuaires.\n\nAu bac, relie un risque à des politiques: prévention, adaptation, urbanisme, relocalisation.",
        "videoURL": "https://www.youtube.com/watch?v=4S4kq0XgWAE",
        "externalLinkURL": "https://www.ipcc.ch/",
        "linkedCardIndices": []
      },
      {
        "name": "Cartes et définitions fiables: Géoconfluences (référence)",
        "textDescription": "Géoconfluences (ENS de Lyon) est une ressource de référence pour la géographie: définitions précises, dossiers thématiques, cartes et bibliographies. Elle est particulièrement utile pour éviter les définitions approximatives.\n\nPour réviser avec cette ressource: choisis une notion (mondialisation, métropolisation, interface), lis la définition, puis écris ta version en 2 lignes. Ensuite, ajoute 1 exemple localisé.\n\nUtilise aussi les entrées “glossaire”: elles t’aident à stabiliser ton vocabulaire de copie et à gagner en précision.\n\nEntraîne-toi: chaque jour, 3 notions → 3 définitions + 3 exemples. En deux semaines, tu es très solide.",
        "videoURL": "https://www.youtube.com/watch?v=Vd1eU7m7u1A",
        "externalLinkURL": "https://geoconfluences.ens-lyon.fr/",
        "linkedCardIndices": []
      }
    ]
  },
  {
    "stableId": "bac_grand_oral_methode_contenu",
    "name": "Bac Grand Oral: méthode + contenu",
    "description": "Préparer le Grand Oral: construire une question, structurer un exposé, argumenter, gérer le temps et le stress, et mobiliser des exemples solides (sciences, société, culture).",
    "color": "orange",
    "category": "Language",
    "language": "fr",
    "difficulty": "Intermediate",
    "tags": [
      "bac",
      "terminale",
      "grand oral",
      "methodologie",
      "presentation"
    ],
    "cards": [
      {
        "front": "Quel est l’objectif principal du Grand Oral (en 1 phrase) ?",
        "back": "Évaluer ta capacité à présenter clairement une question liée à tes enseignements, à argumenter et à échanger avec le jury.",
        "hint": "Présenter + argumenter + échanger."
      },
      {
        "front": "Que doit contenir une bonne question de Grand Oral ?",
        "back": "Un enjeu clair, un lien explicite avec tes spécialités, et une formulation ouverte qui permet d’argumenter (pas une question fermée).",
        "hint": "Enjeu + spé + ouverte."
      },
      {
        "front": "Donne un exemple de formulation ouverte (pattern).",
        "back": "“Dans quelle mesure… ?” ou “Comment… ?” ou “Pourquoi… ?”, car cela invite à discuter et nuancer.",
        "hint": "Dans quelle mesure."
      },
      {
        "front": "Qu’est-ce qu’une problématique (différence avec le sujet) ?",
        "back": "Une problématique transforme un thème en question argumentative en mettant en tension deux idées (enjeu/débat).",
        "hint": "Mettre en tension."
      },
      {
        "front": "Quelle structure simple fonctionne presque toujours à l’oral ?",
        "back": "Accroche → définition des termes → problématique → plan en 2-3 parties → conclusion + ouverture.",
        "hint": "Accroche + définitions + plan."
      },
      {
        "front": "Qu’est-ce qu’une accroche efficace ?",
        "back": "Une phrase courte qui capte l’attention (fait, chiffre, exemple, question) et introduit directement le thème.",
        "hint": "Fait/chiffre/exemple."
      },
      {
        "front": "Quelle règle d’or pour les définitions à l’oral ?",
        "back": "Définir seulement les mots clés, en 1–2 phrases, sans entrer dans un cours complet.",
        "hint": "Court et utile."
      },
      {
        "front": "Comment annoncer un plan à l’oral sans être scolaire ?",
        "back": "En une phrase fluide: “Je vais d’abord…, puis…, avant de…”.",
        "hint": "Je vais d’abord…"
      },
      {
        "front": "À quoi sert un exemple dans l’argumentation ?",
        "back": "À rendre une idée concrète et crédible: un argument sans exemple paraît abstrait et faible.",
        "hint": "Concret + crédible."
      },
      {
        "front": "Donne une règle simple pour choisir tes exemples.",
        "back": "Choisir des exemples précis, localisés/quantifiés si possible, et directement liés à l’argument (pas décoratifs).",
        "hint": "Précis + lié."
      },
      {
        "front": "Qu’est-ce qu’un contre-argument utile ?",
        "back": "Une objection plausible à laquelle tu réponds, ce qui montre nuance et maîtrise.",
        "hint": "Objection + réponse."
      },
      {
        "front": "Comment gérer une question du jury quand tu ne sais pas ?",
        "back": "Reformule, pose le cadre, propose une hypothèse raisonnable, et relie à ce que tu sais; évite d’inventer des chiffres.",
        "hint": "Reformuler + hypothèse."
      },
      {
        "front": "Quelle technique pour gagner du temps pendant les questions ?",
        "back": "Commencer par reformuler la question en 1 phrase puis répondre en 2 idées + 1 exemple.",
        "hint": "Reformuler."
      },
      {
        "front": "Qu’est-ce que la “voix posée” (conseil concret) ?",
        "back": "Parler plus lentement que d’habitude, articuler, et marquer des pauses; la clarté vaut plus que la vitesse.",
        "hint": "Ralentir + pauses."
      },
      {
        "front": "Comment utiliser tes mains à l’oral sans distraire ?",
        "back": "Gestes simples pour structurer (1,2,3), éviter de jouer avec un stylo; mains visibles et calmes.",
        "hint": "Gestes simples."
      },
      {
        "front": "Quel rythme de préparation est réaliste les 2 dernières semaines ?",
        "back": "Répéter l’exposé 1 fois/jour (10–15 min) + 1 session questions/réponses (5–10 min) + corriger 1 point ciblé.",
        "hint": "Répétition quotidienne."
      },
      {
        "front": "Comment éviter d’apprendre par cœur mot à mot ?",
        "back": "Apprendre une trame (mots clés) et s’entraîner à reformuler; utiliser des cartes “idée→exemple→phrase”.",
        "hint": "Trame, pas script."
      },
      {
        "front": "Qu’est-ce qu’un “pitch” de 20 secondes et pourquoi le faire ?",
        "back": "Un mini-résumé (question + thèse + plan) pour lancer l’oral et retrouver le fil en cas de stress.",
        "hint": "Mini-résumé."
      },
      {
        "front": "Donne 5 connecteurs utiles à l’oral.",
        "back": "D’abord, ensuite, cependant, donc, enfin.",
        "hint": "Ordre + contraste + cause."
      },
      {
        "front": "Comment annoncer une transition élégante ?",
        "back": "“Cela nous amène à…” ou “À partir de là, on peut…” pour passer au point suivant.",
        "hint": "Cela nous amène à."
      },
      {
        "front": "Qu’est-ce qu’un support mental efficace (sans fiche) ?",
        "back": "3 titres de parties + 2 mots clés par partie + 1 exemple; c’est suffisant pour parler sans lire.",
        "hint": "3 titres + mots clés."
      },
      {
        "front": "Comment répondre en 30 secondes de façon structurée ?",
        "back": "Thèse en 1 phrase → 2 arguments → 1 exemple → mini-conclusion.",
        "hint": "1-2-1-1."
      },
      {
        "front": "Quelle erreur fréquente fait chuter la note à l’oral ?",
        "back": "Réciter un cours sans problématique ni exemples, ou parler trop vite sans structure.",
        "hint": "Récitation."
      },
      {
        "front": "Pourquoi la gestion du temps est-elle cruciale ?",
        "back": "Parce qu’un oral trop long coupe la conclusion et affaiblit la structure; trop court donne l’impression de vide.",
        "hint": "Conclusion."
      },
      {
        "front": "Donne une stratégie simple pour tenir 5 minutes.",
        "back": "Prévoir 3 parties d’environ 1 min chacune + 1 intro 40 s + 1 conclusion 40 s, avec une marge.",
        "hint": "3×1 min."
      },
      {
        "front": "Qu’est-ce qu’un “exemple mobilisable” (bac) ?",
        "back": "Un exemple que tu peux expliquer en 2–3 phrases avec contexte + mécanisme + conséquence.",
        "hint": "Contexte-mécanisme-conséquence."
      },
      {
        "front": "Exemple mobilisable (sciences): cite un thème fréquent et un angle.",
        "back": "Climat: “Comment l’augmentation du CO2 modifie l’équilibre énergétique?” avec référence GIEC (IPCC).",
        "hint": "CO2/énergie."
      },
      {
        "front": "Exemple mobilisable (technologie): cite un thème et un angle.",
        "back": "Cyber: “En quoi la cybersécurité est-elle un enjeu de souveraineté?” avec référence ANSSI.",
        "hint": "Souveraineté."
      },
      {
        "front": "Exemple mobilisable (économie/société): cite un thème et un angle.",
        "back": "Inflation: “Comment l’inflation affecte-t-elle le pouvoir d’achat?” en distinguant causes et effets.",
        "hint": "Pouvoir d’achat."
      },
      {
        "front": "Qu’est-ce que le stress à l’oral (physiologie simple) ?",
        "back": "Une réponse normale du corps (adrénaline) qui peut aider; l’enjeu est de la canaliser par respiration et préparation.",
        "hint": "Réponse normale."
      },
      {
        "front": "Technique de respiration simple avant de parler ?",
        "back": "Respiration 4–6: inspirer 4 secondes, expirer 6 secondes, répéter 3–5 fois pour ralentir le rythme.",
        "hint": "4-6."
      },
      {
        "front": "Comment utiliser les silences à ton avantage ?",
        "back": "Faire une pause avant une idée importante; cela clarifie et donne l’air sûr plutôt qu’hésitant.",
        "hint": "Pause."
      },
      {
        "front": "Que faire si tu perds le fil ?",
        "back": "Revenir au pitch (question + thèse) puis annoncer la suite: “Je reviens à mon point 2…”.",
        "hint": "Revenir au pitch."
      },
      {
        "front": "Comment gérer une relance agressive du jury ?",
        "back": "Rester calme, reconnaître le point, reformuler et répondre avec un exemple; ne pas se justifier émotionnellement.",
        "hint": "Calme + exemple."
      },
      {
        "front": "Pourquoi citer une source fiable peut aider ?",
        "back": "Cela crédibilise un fait (ex: GIEC, ONU, INSEE) et évite les erreurs; mais cite peu et correctement.",
        "hint": "Crédibilité."
      },
      {
        "front": "Quelles sources françaises fiables pour données économiques ?",
        "back": "INSEE et Banque de France sont des références pour chiffres et analyses.",
        "hint": "INSEE."
      },
      {
        "front": "Quelles sources fiables pour climat et biodiversité ?",
        "back": "IPCC (GIEC) pour climat, IPBES pour biodiversité.",
        "hint": "IPCC/IPBES."
      },
      {
        "front": "Quelles sources fiables pour sécurité numérique ?",
        "back": "ANSSI (France) et ENISA (UE) pour cybersécurité.",
        "hint": "ANSSI."
      },
      {
        "front": "Où trouver des ressources officielles sur le Grand Oral (référence) ?",
        "back": "Sur Éduscol (dossier Grand Oral, attendus et conseils). Réf : https://eduscol.education.fr/1500/le-grand-oral",
        "hint": "Éduscol."
      }
    ],
    "sampleIdeas": [
      {
        "name": "Attendus officiels & critères (source Éduscol)",
        "textDescription": "Pour préparer le Grand Oral sans perdre de temps, appuie-toi sur les attendus officiels: ils décrivent ce qui est évalué (clarté, structure, argumentation, interaction avec le jury). C’est ta “grille de pilotage”.\n\nUn bon entraînement consiste à répéter avec une grille simple: (1) est-ce que ma question est claire et liée aux spécialités ? (2) est-ce que je définis les termes clés ? (3) est-ce que je donne des exemples précis ? (4) est-ce que je réponds vraiment aux questions du jury ?\n\nLa qualité se joue sur la structure et les preuves: un oral bien organisé avec 2–3 exemples solides vaut mieux qu’un exposé très long. Les exemples doivent être expliqués, pas seulement cités.\n\nEnfin, travaille l’interaction: reformuler la question du jury et répondre en 2 idées + 1 exemple est une technique très fiable.",
        "videoURL": "https://www.youtube.com/watch?v=K0mQp2QG8YI",
        "externalLinkURL": "https://eduscol.education.fr/1500/le-grand-oral",
        "linkedCardIndices": []
      },
      {
        "name": "Construire une question excellente (modèle en 4 étapes)",
        "textDescription": "Une bonne question de Grand Oral est ouverte, problématisée et ancrée dans tes spécialités. Méthode en 4 étapes: (1) choisir un thème qui t’intéresse réellement, (2) poser un enjeu concret (pourquoi c’est important), (3) formuler une tension (avantages/limites, causes/conséquences), (4) définir un périmètre (pays, période, échelle).\n\nExemple: au lieu de “Le réchauffement climatique”, préfère “Dans quelle mesure la réduction des émissions suffit-elle à limiter le réchauffement, et quelles limites d’adaptation restent incontournables ?”. Tu as alors un débat, pas un cours.\n\nEnsuite, prépare 3 arguments maximum, chacun avec 1 exemple mobilisable. Tu dois pouvoir expliquer chaque exemple en 2–3 phrases (contexte, mécanisme, conséquence).\n\nEnfin, anticipe 6 questions du jury (objections, précisions) et prépare des réponses courtes. L’oral devient alors un échange maîtrisé.",
        "videoURL": "https://www.youtube.com/watch?v=7kKp7oYxqf4",
        "externalLinkURL": "https://www.lumni.fr/dossier/le-grand-oral-du-bac",
        "linkedCardIndices": []
      },
      {
        "name": "Plan minute par minute (tenir 5 minutes sans stress)",
        "textDescription": "La gestion du temps est un des facteurs les plus visibles pour un jury: si tu dépasses, tu perds ta conclusion; si tu es trop court, tu parais peu préparé. Un plan minute par minute aide énormément.\n\nProposition fiable: 0:00–0:40 intro (accroche + définitions + problématique). 0:40–1:40 partie 1 (cadre). 1:40–2:40 partie 2 (analyse). 2:40–3:40 partie 3 (limites/nuances). 3:40–4:20 conclusion (réponse claire). 4:20–5:00 ouverture (si temps).\n\nEntraîne-toi avec un chronomètre et accepte d’être “un peu trop court” au début: il vaut mieux ajouter ensuite que couper. Après chaque répétition, corrige un seul point (rythme, transition, exemple).\n\nAstuce: place tes exemples au milieu des parties, pas à la fin, pour éviter de les sacrifier quand tu es pressé.",
        "videoURL": "https://www.youtube.com/watch?v=UoO7w2eB8rY",
        "externalLinkURL": "https://www.onisep.fr/Choisir-mes-etudes/Apres-le-bac/Le-bac-general/Le-grand-oral",
        "linkedCardIndices": []
      },
      {
        "name": "Gérer les questions du jury (technique 3 étapes)",
        "textDescription": "Les questions du jury évaluent ta capacité à réfléchir et dialoguer, pas à réciter. La meilleure technique est en 3 étapes: (1) reformuler la question (tu gagnes du temps et montres que tu as compris), (2) répondre en 2 idées maximum, (3) illustrer par un exemple précis.\n\nSi tu ne sais pas, ne bluffe pas. Dis “Je n’ai pas la donnée exacte, mais on peut raisonner ainsi…” puis propose une hypothèse cohérente et relie à tes connaissances. Les jurys valorisent l’honnêteté et le raisonnement.\n\nEntraîne-toi en “mode jury”: quelqu’un te pose une question au hasard, tu appliques la structure. Au bout de 20 répétitions, tu as des automatismes.\n\nPrépare aussi des phrases de contrôle: “Ce que je peux affirmer, c’est…”, “Il faut distinguer…”, “Une limite importante est…”.",
        "videoURL": "https://www.youtube.com/watch?v=Jp6tJw0fK7g",
        "externalLinkURL": "https://eduscol.education.fr/1500/le-grand-oral",
        "linkedCardIndices": []
      },
      {
        "name": "Sources fiables à citer (IPCC, INSEE, ANSSI)",
        "textDescription": "Citer une source fiable renforce la crédibilité, surtout sur des faits chiffrés. L’objectif n’est pas de saturer l’oral de références, mais de sécuriser 1 ou 2 points clés.\n\nPour climat: IPCC (GIEC) synthétise la littérature scientifique mondiale. Pour économie française: INSEE et Banque de France. Pour cybersécurité: ANSSI. Pour mer/droit: ONU (UNCLOS). Pour biodiversité: IPBES.\n\nMéthode: choisis une source par domaine, mémorise ce qu’elle est (1 phrase) et un chiffre/constat que tu peux citer sans erreur. Exemple: “Selon le GIEC, limiter le réchauffement exige des réductions rapides des émissions” (sans inventer un pourcentage si tu n’es pas sûr).\n\nÀ l’oral, cite sobrement: “Source: GIEC” ou “Source: INSEE”, puis reviens à ton argument. Le jury veut comprendre ton raisonnement, pas une bibliographie.",
        "videoURL": "https://www.youtube.com/watch?v=QBCsuAZZBFg",
        "externalLinkURL": "https://www.ipcc.ch/",
        "linkedCardIndices": []
      },
      {
        "name": "Voix, posture, respiration: protocole 2 minutes",
        "textDescription": "La performance orale se joue sur des paramètres physiques simples: respiration, rythme, posture. Un protocole court avant de parler fait une vraie différence.\n\nProtocole 2 minutes: 30 secondes d’ancrage (pieds au sol, épaules basses), 60 secondes de respiration 4–6 (inspire 4, expire 6), 30 secondes de “pitch” (question + thèse + plan). Tu arrives prêt.\n\nPendant l’oral: parle plus lentement que tu ne crois nécessaire, articule, et fais des pauses. Les pauses donnent de la force à tes idées. Garde les mains visibles et utilise des gestes simples pour compter les parties.\n\nAprès une question: respire une fois, reformule, puis répond. Ce micro-temps augmente la qualité et diminue le stress.",
        "videoURL": "https://www.youtube.com/watch?v=5qap5aO4i9A",
        "externalLinkURL": "https://www.lumni.fr/dossier/le-grand-oral-du-bac",
        "linkedCardIndices": []
      },
      {
        "name": "Banque d’exemples (10 thèmes) à adapter à tes spé",
        "textDescription": "Une banque d’exemples te donne de la sécurité: tu peux illustrer rapidement sans chercher dans le vide. Prépare 10 exemples “mobilisables”, chacun expliquable en 2–3 phrases.\n\nExemples de thèmes: climat (IPCC), biodiversité (IPBES), cybersécurité (ANSSI), énergie (AIE), inflation (INSEE), IA/éthique (UNESCO), eau (UN Water), santé (OMS), espace (UNOOSA), mers/droit (UNCLOS).\n\nPour chaque exemple: 1) contexte (où/quand), 2) mécanisme (comment), 3) conséquence/enjeu (pourquoi ça compte). Cela suffit pour être convaincant.\n\nEnsuite, relie l’exemple à ta question: un exemple doit prouver quelque chose dans ton raisonnement, pas simplement montrer que tu sais des choses.",
        "videoURL": "https://www.youtube.com/watch?v=GZ5Hf9LQ9x8",
        "externalLinkURL": "https://www.un.org/depts/los/convention_agreements/texts/unclos/unclos_e.pdf",
        "linkedCardIndices": []
      },
      {
        "name": "Éviter les erreurs qui coûtent cher (checklist)",
        "textDescription": "Certaines erreurs reviennent et coûtent cher car elles donnent l’impression d’un oral peu maîtrisé: question trop vague, absence de plan, exemples non expliqués, débit trop rapide, et réponses évasives.\n\nChecklist de contrôle: 1) Ma question contient une tension ? 2) J’ai défini 3 mots clés ? 3) J’ai 3 arguments + 3 exemples ? 4) Je finis par une réponse claire ? 5) J’ai préparé 6 questions du jury ?\n\nSur le fond, évite d’inventer des chiffres. Si tu veux citer une donnée, vérifie-la et mémorise-la. Sinon, reste qualitatif et explique le mécanisme.\n\nSur la forme, entraîne-toi debout et chronométré. Répéter assis donne souvent un faux confort et un débit qui s’effondre le jour J.",
        "videoURL": "https://www.youtube.com/watch?v=K0mQp2QG8YI",
        "externalLinkURL": "https://eduscol.education.fr/1500/le-grand-oral",
        "linkedCardIndices": []
      }
    ]
  },
  {
    "stableId": "bac_hggsp_notions_reperes_terminale",
    "name": "Bac HGGSP: notions & repères (Terminale)",
    "description": "Notions indispensables de la spécialité HGGSP (terminale): puissance, espaces de conquête, guerre/paix, histoire & mémoires, environnement, information, cyber. Définitions + exemples mobilisables.",
    "color": "purple",
    "category": "History",
    "language": "fr",
    "difficulty": "Advanced",
    "tags": [
      "bac",
      "terminale",
      "hggsp",
      "geopolitique",
      "sciences politiques"
    ],
    "cards": [
      {
        "front": "Qu’est-ce que la géopolitique (définition Bac) ?",
        "back": "L’étude des rivalités de pouvoir sur des territoires, en analysant acteurs, représentations, ressources et rapports de force.",
        "hint": "Rivalités + territoires."
      },
      {
        "front": "Qu’est-ce qu’une puissance (définition HGGSP) ?",
        "back": "La capacité d’un acteur à influencer d’autres acteurs et l’organisation du monde par des moyens économiques, militaires, diplomatiques et culturels.",
        "hint": "Influencer."
      },
      {
        "front": "Qu’est-ce que le hard power ?",
        "back": "La puissance fondée sur la contrainte (surtout militaire et économique) pour imposer une décision ou dissuader.",
        "hint": "Contrainte."
      },
      {
        "front": "Qu’est-ce que le soft power ?",
        "back": "La puissance d’influence fondée sur l’attraction (culture, valeurs, médias, diplomatie), plutôt que la contrainte.",
        "hint": "Attraction."
      },
      {
        "front": "Qu’est-ce que le smart power ?",
        "back": "Une stratégie combinant soft power et hard power selon les objectifs et les contextes.",
        "hint": "Combinaison."
      },
      {
        "front": "Qu’est-ce que la souveraineté ?",
        "back": "Le pouvoir suprême d’un État sur son territoire et sa population, sans autorité supérieure (dans le cadre du droit international).",
        "hint": "Pouvoir suprême."
      },
      {
        "front": "Qu’est-ce qu’un acteur étatique ?",
        "back": "Un acteur organisé en État, disposant d’institutions, de frontières reconnues et d’une souveraineté (plus ou moins contestée).",
        "hint": "État."
      },
      {
        "front": "Qu’est-ce qu’un acteur non étatique ?",
        "back": "Un acteur qui n’est pas un État mais pèse sur les relations internationales (FTN, ONG, groupes armés, organisations internationales).",
        "hint": "Pas un État."
      },
      {
        "front": "Qu’est-ce qu’un espace stratégique ?",
        "back": "Un espace où se concentrent des enjeux majeurs (routes, ressources, sécurité) et des rivalités d’acteurs.",
        "hint": "Enjeux + rivalités."
      },
      {
        "front": "Qu’est-ce qu’un bien commun mondial ?",
        "back": "Une ressource ou un espace dont l’usage concerne l’humanité entière et exige coopération (ex: climat, océans, biodiversité).",
        "hint": "Usage mondial."
      },
      {
        "front": "Qu’est-ce qu’une ZEE et à quoi sert-elle ?",
        "back": "Une zone (jusqu’à 200 milles nautiques) où l’État côtier a des droits d’exploitation des ressources; elle renforce les enjeux maritimes. Réf : https://www.un.org/depts/los/convention_agreements/texts/unclos/unclos_e.pdf",
        "hint": "200 milles."
      },
      {
        "front": "Pourquoi les détroits sont-ils stratégiques ?",
        "back": "Ils concentrent le trafic maritime: contrôle ou perturbation peut affecter commerce, énergie et sécurité.",
        "hint": "Points de passage."
      },
      {
        "front": "Donne un exemple de détroit stratégique et un enjeu.",
        "back": "Le détroit de Malacca: passage majeur entre océan Indien et Pacifique, enjeu de sécurité et d’approvisionnement asiatique.",
        "hint": "Asie, trafic."
      },
      {
        "front": "Qu’est-ce que la “maritimisation” de l’économie mondiale ?",
        "back": "La montée du rôle des mers dans les échanges et la production (ports, routes, chaînes logistiques), renforçant les littoraux et hubs.",
        "hint": "Échanges par mer."
      },
      {
        "front": "Pourquoi les câbles sous-marins sont-ils un enjeu de puissance ?",
        "back": "Ils transportent l’essentiel des données internationales; leur protection et leur contrôle touchent économie, espionnage et souveraineté numérique.",
        "hint": "Internet sous la mer."
      },
      {
        "front": "Qu’est-ce que l’espace extra-atmosphérique comme enjeu géopolitique ?",
        "back": "Un espace de puissance (satellites, navigation, observation, communications) où se jouent sécurité, économie et rivalités.",
        "hint": "Satellites."
      },
      {
        "front": "Pourquoi les satellites sont-ils stratégiques ?",
        "back": "Ils fournissent communications, GPS, observation et renseignement; leur destruction ou brouillage peut handicaper un État.",
        "hint": "GPS/observation."
      },
      {
        "front": "Qu’est-ce que le droit international (définition simple) ?",
        "back": "Un ensemble de règles et traités qui encadrent les relations entre États et organisations (guerre, mer, commerce, droits).",
        "hint": "Règles entre États."
      },
      {
        "front": "Qu’est-ce que l’ONU et son objectif principal ?",
        "back": "Organisation internationale créée en 1945 pour maintenir la paix et la sécurité internationales et favoriser la coopération.",
        "hint": "Paix, 1945."
      },
      {
        "front": "Qu’est-ce que la sécurité collective ?",
        "back": "Principe selon lequel une agression contre un membre est traitée comme une menace pour tous, nécessitant une réponse collective (idéalement via ONU).",
        "hint": "Menace commune."
      },
      {
        "front": "Qu’est-ce qu’une opération de maintien de la paix (OMP) ?",
        "back": "Une mission onusienne visant à stabiliser une zone de conflit (protéger civils, soutenir accords, sécuriser), avec mandat et limites. Réf : https://peacekeeping.un.org/en",
        "hint": "Casques bleus."
      },
      {
        "front": "Quelle différence entre guerre “interétatique” et “intraétatique” ?",
        "back": "Interétatique: entre États; intraétatique: guerre civile à l’intérieur d’un État, souvent avec acteurs externes.",
        "hint": "Entre États / interne."
      },
      {
        "front": "Qu’est-ce qu’une guerre asymétrique ?",
        "back": "Un conflit opposant des forces très inégales où le plus faible compense par guérilla, terrorisme, cyber, information.",
        "hint": "Forces inégales."
      },
      {
        "front": "Qu’est-ce que le terrorisme (définition utile) ?",
        "back": "Une stratégie de violence visant à créer la peur et à influencer des décisions politiques, souvent par des attaques symboliques.",
        "hint": "Peur + politique."
      },
      {
        "front": "Qu’est-ce que la dissuasion nucléaire ?",
        "back": "Stratégie qui vise à empêcher un adversaire d’attaquer en lui promettant des dommages inacceptables en retour (capacité de seconde frappe).",
        "hint": "Dommages inacceptables."
      },
      {
        "front": "Qu’est-ce que la prolifération nucléaire ?",
        "back": "La diffusion des armes nucléaires à de nouveaux États (ou acteurs), augmentant risques de crise, d’escalade et d’accident.",
        "hint": "Diffusion."
      },
      {
        "front": "Quel traité encadre la non-prolifération nucléaire (référence) ?",
        "back": "Le Traité sur la non-prolifération (TNP), pilier du régime de non-prolifération. Réf : https://disarmament.unoda.org/wmd/nuclear/npt/",
        "hint": "TNP."
      },
      {
        "front": "Qu’est-ce qu’un crime contre l’humanité ?",
        "back": "Des actes inhumains commis dans le cadre d’une attaque généralisée ou systématique contre une population civile.",
        "hint": "Attaque systématique."
      },
      {
        "front": "Qu’est-ce que la CPI (Cour pénale internationale) ?",
        "back": "Une juridiction internationale permanente jugeant certains crimes graves (génocide, crimes contre l’humanité, crimes de guerre) quand conditions remplies. Réf : https://www.icc-cpi.int/",
        "hint": "Justice internationale."
      },
      {
        "front": "Quelle différence entre histoire et mémoire ?",
        "back": "L’histoire est une démarche critique fondée sur sources; la mémoire est un vécu/une représentation collective, sélective et évolutive.",
        "hint": "Critique vs vécu."
      },
      {
        "front": "Qu’est-ce qu’un “enjeu mémoriel” ?",
        "back": "Une situation où la mémoire d’un événement devient un objet de débats politiques, identitaires ou diplomatiques.",
        "hint": "Mémoire débattue."
      },
      {
        "front": "Qu’est-ce qu’une loi mémorielle (idée générale) ?",
        "back": "Une loi par laquelle l’État intervient sur la qualification ou la reconnaissance d’un passé, suscitant débats sur liberté de recherche.",
        "hint": "État et passé."
      },
      {
        "front": "Qu’est-ce que la justice transitionnelle ?",
        "back": "Ensemble de mécanismes pour traiter un passé de violences (tribunaux, commissions vérité, réparations) afin de reconstruire la société.",
        "hint": "Après-conflit."
      },
      {
        "front": "Qu’est-ce que l’Anthropocène (définition) ?",
        "back": "Idée d’une époque où l’activité humaine devient une force majeure de transformation des systèmes terrestres (climat, biodiversité, sols).",
        "hint": "Humain force majeure."
      },
      {
        "front": "Qu’est-ce qu’une COP climatique ?",
        "back": "Une conférence des parties de la Convention-cadre de l’ONU sur le climat (UNFCCC) où se négocient objectifs et règles climatiques.",
        "hint": "UNFCCC."
      },
      {
        "front": "Qu’est-ce que l’Accord de Paris (2015) ?",
        "back": "Un accord UNFCCC visant à limiter le réchauffement bien en dessous de 2°C et à poursuivre l’effort vers 1,5°C, via contributions nationales (NDC). Réf : https://unfccc.int/process-and-meetings/the-paris-agreement/the-paris-agreement",
        "hint": "2015, 1,5–2°C."
      },
      {
        "front": "Qu’est-ce qu’un risque (en HGGSP/geo) ?",
        "back": "La combinaison d’un aléa (événement) et d’une vulnérabilité (enjeux exposés), produisant des dommages potentiels.",
        "hint": "Aléa + vulnérabilité."
      },
      {
        "front": "Qu’est-ce qu’une ressource stratégique ?",
        "back": "Une ressource essentielle (énergie, minerais, eau, données) dont l’accès et le contrôle influencent puissance et sécurité.",
        "hint": "Accès/contrôle."
      },
      {
        "front": "Qu’est-ce que l’information (au sens HGGSP) ?",
        "back": "Des contenus (faits, données, récits) produits et diffusés; leur sélection, vérification et circulation influencent opinions et décisions.",
        "hint": "Contenus diffusés."
      },
      {
        "front": "Qu’est-ce que la désinformation ?",
        "back": "La diffusion volontaire d’informations fausses ou manipulées pour tromper, influencer ou déstabiliser.",
        "hint": "Volontairement faux."
      },
      {
        "front": "Qu’est-ce qu’une “guerre informationnelle” ?",
        "back": "Un ensemble d’actions visant à influencer perceptions et comportements par propagande, cyber, narratifs et manipulation des médias.",
        "hint": "Influencer perceptions."
      },
      {
        "front": "Qu’est-ce qu’une plateforme numérique (angle géopolitique) ?",
        "back": "Un acteur privé qui organise l’accès à l’information et aux services (algorithmes, données), pouvant peser sur politique et souveraineté.",
        "hint": "Algorithmes + données."
      },
      {
        "front": "Pourquoi la liberté de la presse est-elle un indicateur démocratique ?",
        "back": "Parce qu’elle conditionne contrôle du pouvoir, pluralisme des opinions et accès à une information vérifiable.",
        "hint": "Contrôle du pouvoir."
      },
      {
        "front": "Qu’est-ce que le cyberespace ?",
        "back": "Un espace structuré par réseaux informatiques, infrastructures et usages, où se jouent échanges, surveillance, attaques et rivalités.",
        "hint": "Réseaux + rivalités."
      },
      {
        "front": "Qu’est-ce qu’une cyberattaque ?",
        "back": "Une action offensive visant à perturber, espionner ou détruire des systèmes informatiques (services, données, infrastructures).",
        "hint": "Perturber/espionner."
      },
      {
        "front": "Qu’est-ce qu’une ingérence ?",
        "back": "Une action visant à influencer la vie politique ou sociale d’un autre État (information, cyber, financement, pression diplomatique).",
        "hint": "Influencer un autre État."
      },
      {
        "front": "Qu’est-ce qu’une frontière (en HGGSP) ?",
        "back": "Une limite politique et/ou une zone de contact pouvant être barrière, filtre ou interface selon les flux et les politiques.",
        "hint": "Barrière/filtre/interface."
      },
      {
        "front": "Qu’est-ce qu’un “mur” ou une fermeture frontalière indique souvent ?",
        "back": "Un durcissement de la souveraineté face à des flux (migrations, commerce, menaces) et un choix politique de contrôle territorial.",
        "hint": "Contrôle des flux."
      },
      {
        "front": "Qu’est-ce que la mondialisation (rappel utile) ?",
        "back": "L’intensification des échanges et interdépendances mondiales, connectant les territoires de façon hiérarchisée et inégale.",
        "hint": "Interdépendances."
      },
      {
        "front": "Quelle source officielle donne le programme HGGSP Terminale (référence) ?",
        "back": "Le programme officiel (annexe) publié par le Ministère. Réf : https://www.education.gouv.fr/sites/default/files/imported_files/document/spe254_annexe_1159180.pdf",
        "hint": "PDF ministère."
      },
      {
        "front": "Où trouver des ressources pédagogiques fiables et mises à jour pour HGGSP ?",
        "back": "Sur Éduscol (page dédiée HGGSP voie générale). Réf : https://eduscol.education.fr/1676/programmes-et-ressources-en-histoire-geographie-geopolitique-et-sciences-politiques-voie-g",
        "hint": "Éduscol HGGSP."
      }
    ],
    "sampleIdeas": [
      {
        "name": "Programme HGGSP Terminale: ce qui est attendu",
        "textDescription": "Le point de départ le plus fiable est le programme officiel de terminale HGGSP. Il présente les thèmes, les capacités (analyser, problématiser, argumenter) et le cadre de connaissances attendu. C’est la référence pour éviter les “hors-sujets” et réviser de façon ciblée.\n\nStratégie de révision “programme-first”: pour chaque thème, fixe 12 notions (définitions), 8 exemples localisés (cas, espaces), et 5 dates/repères. Ensuite, entraîne-toi à mobiliser ces éléments dans une réponse courte: définition + exemple + enjeu.\n\nLes ressources Éduscol complètent le programme en proposant des dossiers et des pistes de mise en œuvre, utiles pour stabiliser les études de cas et actualiser certains enjeux.\n\nGarde ces deux liens en favoris: tu peux toujours vérifier qu’un point est au programme et trouver des ressources solides pour approfondir.",
        "videoURL": "https://www.youtube.com/watch?v=xZ3KEwskPlw",
        "externalLinkURL": "https://www.education.gouv.fr/sites/default/files/imported_files/document/spe254_annexe_1159180.pdf",
        "linkedCardIndices": []
      },
      {
        "name": "Mers et océans: routes, détroits, ZEE, puissance",
        "textDescription": "Les mers et océans sont au cœur des échanges et des rivalités: ils supportent des routes commerciales majeures, concentrées dans des détroits et canaux stratégiques. Les ports et les façades maritimes organisent ces flux, tandis que la sécurisation des routes (piraterie, tensions régionales) devient un enjeu.\n\nLa ZEE donne aux États des droits d’exploitation des ressources jusqu’à 200 milles nautiques. Cela explique des tensions autour de la délimitation maritime et des revendications de souveraineté, notamment là où les ressources (pêche, hydrocarbures) sont importantes.\n\nEnfin, un enjeu souvent oublié au lycée est le numérique: une grande partie du trafic Internet passe par des câbles sous-marins. Leur protection touche à la souveraineté et à la sécurité.\n\nPour réviser: connais 3 passages obligés (Malacca, Ormuz, Suez) et 2 espaces disputés (Arctique, mer de Chine méridionale) + une définition précise de la ZEE.",
        "videoURL": "https://www.youtube.com/watch?v=9JPydWTn4wQ",
        "externalLinkURL": "https://www.un.org/depts/los/convention_agreements/texts/unclos/unclos_e.pdf",
        "linkedCardIndices": []
      },
      {
        "name": "Espace: satellites, privatisation et rivalités",
        "textDescription": "L’espace extra-atmosphérique est devenu un espace stratégique: satellites de communication, navigation (GPS), observation et renseignement. Ces usages civils et militaires se combinent, ce qui rend l’espace crucial pour l’économie et la sécurité.\n\nDepuis plusieurs années, la privatisation accélère (entreprises, lancements, constellations). Cela change l’équilibre: baisse des coûts, innovation, mais aussi enjeux de dépendance, de régulation et de souveraineté.\n\nLa militarisation est un autre point clé: brouillage, tests anti-satellites, surveillance. Une crise spatiale peut avoir des effets en chaîne sur la vie quotidienne (transport, finance, secours).\n\nPour réviser, retiens: 1) pourquoi le satellite est stratégique; 2) un exemple d’acteur privé; 3) un enjeu de droit et de régulation internationale.",
        "videoURL": "https://www.youtube.com/watch?v=LEIV-D-816I",
        "externalLinkURL": "https://www.unoosa.org/oosa/en/ourwork/spacelaw/treaties/introouterspacetreaty.html",
        "linkedCardIndices": []
      },
      {
        "name": "Faire la guerre / faire la paix: ONU et limites",
        "textDescription": "La guerre contemporaine combine conflits interétatiques, guerres civiles, terrorismes, et interventions extérieures. Les conflits sont souvent asymétriques et s’accompagnent d’une bataille de l’information.\n\nL’ONU incarne l’idéal de sécurité collective, mais son action dépend d’équilibres politiques et de mandats. Les opérations de maintien de la paix visent la stabilisation et la protection des civils, avec des limites (mandat, moyens, consentement des parties).\n\nComprendre la différence entre légalité et légitimité est utile: une intervention peut être contestée même si elle se réclame du droit, et inversement. Le droit international structure les débats, sans les faire disparaître.\n\nEn copie, mobilise un exemple (maintien de la paix, crise) pour montrer comment la paix se “fabrique” (diplomatie, médiation, sanctions, reconstruction).",
        "videoURL": "https://www.youtube.com/watch?v=TEjAtdHGGNM",
        "externalLinkURL": "https://peacekeeping.un.org/en",
        "linkedCardIndices": []
      },
      {
        "name": "Dissuasion nucléaire: logique et enjeux actuels",
        "textDescription": "La dissuasion nucléaire vise à empêcher l’adversaire d’attaquer en le menaçant de destructions inacceptables. Elle repose sur la crédibilité (capacités) et la communication stratégique. Elle a structuré la Guerre froide et continue de peser sur les crises.\n\nLa prolifération augmente les risques: multiplication d’acteurs, erreurs de calcul, accidents. Le TNP encadre la non-prolifération, mais les tensions géopolitiques mettent sous pression les régimes de contrôle.\n\nDans une copie, évite le jugement moral immédiat: commence par expliquer la logique, puis discute ses limites (escalade, accidents, instabilité). Tu peux ensuite ouvrir sur les débats de sécurité régionale.\n\nOutil de révision: associe “dissuasion” à 3 mots: crédibilité, seconde frappe, escalade.",
        "videoURL": "https://www.youtube.com/watch?v=bfIfEYTdV6w",
        "externalLinkURL": "https://disarmament.unoda.org/wmd/nuclear/npt/",
        "linkedCardIndices": []
      },
      {
        "name": "Histoire, mémoire, justice: Nuremberg → CPI",
        "textDescription": "Histoire et mémoire ne se confondent pas: l’histoire est une démarche critique appuyée sur des sources, alors que la mémoire est vécue, sélective, et souvent porteuse d’enjeux identitaires. Les “guerres de mémoire” peuvent peser sur la politique intérieure et la diplomatie.\n\nLa justice internationale est un autre pilier: après 1945, Nuremberg symbolise la volonté de juger des crimes de masse. Aujourd’hui, la CPI vise à poursuivre certains crimes graves lorsque les conditions de compétence sont réunies.\n\nMais la justice internationale a des limites: dépendance aux États (arrestations, coopération), accusations de sélectivité, rapports de puissance. Cela fait partie des enjeux HGGSP: droit vs politique.\n\nEn copie, montre comment mémoire et justice peuvent contribuer à l’apaisement, mais aussi rouvrir des fractures selon les contextes.",
        "videoURL": "https://www.youtube.com/watch?v=yZ2-nmo5938",
        "externalLinkURL": "https://www.icc-cpi.int/",
        "linkedCardIndices": []
      },
      {
        "name": "Environnement: Anthropocène, COP et Accord de Paris",
        "textDescription": "Les enjeux environnementaux deviennent géopolitiques car ils touchent à la sécurité, au développement et aux ressources. Le concept d’Anthropocène souligne le rôle majeur des activités humaines dans les transformations climatiques et écologiques.\n\nLa gouvernance climatique s’organise autour de l’UNFCCC et des COP, où les États négocient des objectifs et des règles. L’Accord de Paris (2015) repose sur des contributions nationales (NDC) et sur une logique de progression, mais sa mise en œuvre dépend des rapports de force, des intérêts et des capacités.\n\nPour le bac, l’important est de montrer la tension entre coopération nécessaire et rivalités (compétition industrielle, énergie, inégalités). Les transitions peuvent aussi produire des conflits sociaux (coûts, acceptabilité) et géopolitiques (dépendances).\n\nEn révision: apprends la définition de l’Accord de Paris + 2 enjeux (justice climatique, financement) + 1 exemple d’énergie ou ressource stratégique.",
        "videoURL": "https://www.youtube.com/watch?v=QBCsuAZZBFg",
        "externalLinkURL": "https://unfccc.int/process-and-meetings/the-paris-agreement/the-paris-agreement",
        "linkedCardIndices": []
      },
      {
        "name": "Désinformation: une guerre des récits",
        "textDescription": "La désinformation consiste à diffuser volontairement du faux ou du manipulé pour influencer ou déstabiliser. Elle s’appuie sur la vitesse de circulation, l’émotion, et parfois des réseaux coordonnés.\n\nDans une guerre informationnelle, l’objectif n’est pas seulement de convaincre mais aussi de semer le doute, de diviser, et de saturer l’espace public. Les plateformes jouent un rôle central via algorithmes, publicité et données.\n\nPour analyser, distingue: information (faits vérifiables), opinion (interprétation), propagande (message orienté), désinformation (tromperie). Les outils de vérification (sources, recoupement, contexte) deviennent une compétence civique.\n\nEn copie, un bon réflexe est de relier désinformation et souveraineté: capacité d’un État à protéger son débat public et ses infrastructures numériques.",
        "videoURL": "https://www.youtube.com/watch?v=w6XtiubJY2c",
        "externalLinkURL": "https://en.unesco.org/fightfakenews",
        "linkedCardIndices": []
      },
      {
        "name": "Cyberespace: conflictualité et souveraineté numérique",
        "textDescription": "Le cyberespace est un espace de rivalités où se mêlent attaques, espionnage, sabotage et influence. Les cibles peuvent être des États, entreprises ou infrastructures critiques (énergie, santé, transports).\n\nLes cyberattaques brouillent les frontières: attribution difficile, actions sous le seuil de la guerre, multiplicité d’acteurs. Cela transforme la sécurité: protection des systèmes, résilience, coopération internationale, mais aussi tentations de contrôle.\n\nLa souveraineté numérique devient un enjeu: maîtrise des données, cloud, normes, et dépendances technologiques. Les États développent des doctrines et des agences de cybersécurité.\n\nEn copie, montre l’ambivalence: le numérique connecte et enrichit, mais crée vulnérabilités et nouveaux rapports de force.",
        "videoURL": "https://www.youtube.com/watch?v=H6vnLv4FtkM",
        "externalLinkURL": "https://www.ssi.gouv.fr/",
        "linkedCardIndices": []
      },
      {
        "name": "Méthode HGGSP: composition efficace (sans blabla)",
        "textDescription": "Une bonne copie HGGSP repose sur 3 gestes: définir les termes, problématiser (faire apparaître une tension), puis argumenter avec exemples précis. Le piège est la récitation: ce qui compte, c’est de montrer un raisonnement.\n\nPlan efficace: I) poser le cadre (acteurs, espaces, notions), II) analyser les dynamiques (rivalités, coopérations, hiérarchies), III) discuter limites et évolutions (nouvelles conflictualités, incertitudes, futurs possibles). Chaque partie doit contenir 2–3 exemples localisés.\n\nEn introduction: accroche courte, définitions, problématique, annonce de plan. En conclusion: réponse à la problématique + ouverture maîtrisée.\n\nTechnique de révision: pour chaque notion, prépare un “pack” (définition + 1 exemple + 1 limite). C’est la meilleure façon de produire une copie riche et contrôlée en temps limité.",
        "videoURL": "https://www.youtube.com/watch?v=_3Dr5HbyyP4",
        "externalLinkURL": "https://eduscol.education.fr/1676/programmes-et-ressources-en-histoire-geographie-geopolitique-et-sciences-politiques-voie-g",
        "linkedCardIndices": []
      }
    ]
  },
  {
    "stableId": "bac_histoire_reperes_chronologiques_1945",
    "name": "Bac Histoire: repères chronologiques (1945→)",
    "description": "Les dates et repères indispensables (monde, Europe, France) de 1945 à aujourd’hui: Guerre froide, décolonisations, construction européenne, France de la Vᵉ République, grandes ruptures du monde contemporain.",
    "color": "green",
    "category": "History",
    "language": "fr",
    "difficulty": "Intermediate",
    "tags": [
      "bac",
      "terminale",
      "histoire",
      "chronologie",
      "dates"
    ],
    "cards": [
      {
        "front": "1945: quel événement marque officiellement la fin de la Seconde Guerre mondiale en Europe ?",
        "back": "La capitulation de l’Allemagne nazie, le 8 mai 1945, qui met fin à la guerre en Europe.",
        "hint": "8 mai 1945."
      },
      {
        "front": "1945: quelle organisation internationale est créée pour maintenir la paix ?",
        "back": "L’ONU, fondée en juin 1945 pour préserver la paix et favoriser la coopération internationale.",
        "hint": "Organisation mondiale."
      },
      {
        "front": "1945: pourquoi les bombardements d’Hiroshima et Nagasaki sont-ils un tournant ?",
        "back": "Ils inaugurent l’ère nucléaire et modifient durablement les rapports de force et la peur d’une guerre totale.",
        "hint": "Ère nucléaire."
      },
      {
        "front": "1947: que sont la doctrine Truman et le plan Marshall ?",
        "back": "La doctrine Truman lance l’endiguement du communisme; le plan Marshall aide à reconstruire l’Europe occidentale et renforce l’influence américaine.",
        "hint": "Endiguement + aide économique."
      },
      {
        "front": "1947: quelle doctrine soviétique répond à Truman ?",
        "back": "La doctrine Jdanov, qui oppose le camp “impérialiste” au camp “démocratique”, structure l’affrontement idéologique.",
        "hint": "Réponse soviétique."
      },
      {
        "front": "1948-1949: qu’est-ce que le blocus de Berlin ?",
        "back": "L’URSS bloque les accès terrestres à Berlin-Ouest; les Occidentaux organisent un pont aérien, révélant la bipolarisation.",
        "hint": "Pont aérien."
      },
      {
        "front": "1949: quelle alliance militaire occidentale est créée ?",
        "back": "L’OTAN, alliance de défense collective autour des États-Unis.",
        "hint": "Alliance occidentale."
      },
      {
        "front": "1949: quel événement majeur en Asie renforce la bipolarisation ?",
        "back": "La victoire communiste en Chine (proclamation de la RPC), qui change l’équilibre mondial.",
        "hint": "Chine communiste."
      },
      {
        "front": "1950-1953: que montre la guerre de Corée ?",
        "back": "Une guerre “chaude” de la Guerre froide: affrontement indirect Est-Ouest autour d’un conflit local, aboutissant à un statu quo près du 38e parallèle.",
        "hint": "38e parallèle."
      },
      {
        "front": "1954: que marque la bataille de Diên Biên Phu ?",
        "back": "La défaite française en Indochine, accélérant la fin de l’empire colonial français en Asie.",
        "hint": "Indochine."
      },
      {
        "front": "1955: quel pacte militaire structure le bloc de l’Est ?",
        "back": "Le pacte de Varsovie, alliance militaire dirigée par l’URSS.",
        "hint": "Bloc de l’Est."
      },
      {
        "front": "1956: que symbolise l’insurrection de Budapest ?",
        "back": "La répression soviétique en Hongrie montre la domination de l’URSS sur l’Europe de l’Est et les limites des réformes.",
        "hint": "Répression soviétique."
      },
      {
        "front": "1956: que révèle la crise de Suez ?",
        "back": "Le recul des puissances coloniales européennes et la montée en puissance des États-Unis et de l’URSS dans l’ordre mondial.",
        "hint": "Déclin colonial."
      },
      {
        "front": "1957: quel traité fonde la CEE ?",
        "back": "Le traité de Rome (25 mars 1957), créant la Communauté économique européenne (CEE) et le Marché commun.",
        "hint": "Rome, 1957."
      },
      {
        "front": "1961: que représente la construction du mur de Berlin ?",
        "back": "La matérialisation de la division de l’Europe et du monde en deux blocs; symbole de la Guerre froide.",
        "hint": "Ville divisée."
      },
      {
        "front": "1962: qu’est-ce que la crise de Cuba ?",
        "back": "Une confrontation nucléaire entre États-Unis et URSS autour de missiles soviétiques à Cuba; moment où le monde frôle la guerre nucléaire.",
        "hint": "Missiles."
      },
      {
        "front": "1962: quelle étape majeure de la décolonisation concerne la France ?",
        "back": "L’indépendance de l’Algérie (accords d’Évian), après une guerre longue et violente.",
        "hint": "Accords d’Évian."
      },
      {
        "front": "1963: quel discours marque un symbole de la Guerre froide à Berlin ?",
        "back": "Le discours de JFK à Berlin-Ouest (“Ich bin ein Berliner”), symbole du soutien américain.",
        "hint": "JFK à Berlin."
      },
      {
        "front": "1968: pourquoi 1968 est-il un repère social et politique en France ?",
        "back": "Le mouvement de Mai 68 (grèves, contestations) bouleverse la société et marque une rupture culturelle et politique.",
        "hint": "Mai 68."
      },
      {
        "front": "1969: quelle date marque le premier pas sur la Lune ?",
        "back": "Le 20 juillet 1969, Apollo 11: symbole de la course à l’espace pendant la Guerre froide.",
        "hint": "Apollo 11."
      },
      {
        "front": "1973: quel choc économique mondial survient ?",
        "back": "Le premier choc pétrolier, qui met fin aux Trente Glorieuses et provoque inflation et chômage dans beaucoup de pays.",
        "hint": "Pétrole."
      },
      {
        "front": "1975: que symbolisent les accords d’Helsinki ?",
        "back": "Une étape de la détente: reconnaissance des frontières européennes et engagement sur les droits de l’homme, tout en maintenant la division Est-Ouest.",
        "hint": "Détente."
      },
      {
        "front": "1979: quel événement majeur transforme l’équilibre au Moyen-Orient ?",
        "back": "La révolution iranienne, qui renverse le Shah et instaure une République islamique, modifiant les rapports régionaux.",
        "hint": "Iran, 1979."
      },
      {
        "front": "1979: quelle intervention soviétique relance les tensions de la Guerre froide ?",
        "back": "L’invasion de l’Afghanistan par l’URSS, qui durcit les relations Est-Ouest.",
        "hint": "Afghanistan."
      },
      {
        "front": "1981: quelle abolition importante a lieu en France ?",
        "back": "L’abolition de la peine de mort en 1981, portée par Robert Badinter.",
        "hint": "Badinter."
      },
      {
        "front": "1985: quelle politique de réforme est lancée en URSS par Gorbatchev ?",
        "back": "La perestroïka (réformes) et la glasnost (transparence), qui fragilisent le système soviétique.",
        "hint": "Réformes URSS."
      },
      {
        "front": "1986: quel accident nucléaire en Europe marque les esprits ?",
        "back": "La catastrophe de Tchernobyl, révélant les risques nucléaires et l’importance de l’information.",
        "hint": "Tchernobyl."
      },
      {
        "front": "1989: quel événement symbolise la fin de la division de l’Europe ?",
        "back": "La chute du mur de Berlin (9 novembre 1989), ouvrant la voie à la réunification allemande et à la fin de la Guerre froide.",
        "hint": "9 novembre."
      },
      {
        "front": "1991: quel événement marque la fin officielle de l’URSS ?",
        "back": "La dissolution de l’Union soviétique en décembre 1991, mettant fin au bloc de l’Est.",
        "hint": "Fin URSS."
      },
      {
        "front": "1992: quel traité transforme la CEE en Union européenne ?",
        "back": "Le traité de Maastricht (1992), qui crée l’Union européenne et prépare l’euro.",
        "hint": "Maastricht."
      },
      {
        "front": "1994: quel événement fonde une nouvelle architecture économique mondiale ?",
        "back": "La création de l’OMC (Organisation mondiale du commerce) en 1994, qui encadre les règles du commerce mondial.",
        "hint": "Commerce mondial."
      },
      {
        "front": "1995: quelle étape importante d’intégration européenne concerne l’espace Schengen ?",
        "back": "La mise en application de Schengen facilite la libre circulation, même si tous les États de l’UE n’y participent pas de la même façon.",
        "hint": "Libre circulation."
      },
      {
        "front": "1999: que représente l’euro (avant les billets/pièces) ?",
        "back": "En 1999, l’euro devient une monnaie scripturale pour certains usages (comptes, marchés) avant son lancement en billets/pièces en 2002.",
        "hint": "Scriptural avant 2002."
      },
      {
        "front": "2001: quel événement déclenche la « guerre contre le terrorisme » ?",
        "back": "Les attentats du 11 septembre 2001 aux États-Unis, entraînant des interventions et un durcissement sécuritaire mondial.",
        "hint": "11 septembre."
      },
      {
        "front": "2002: quelle étape monétaire européenne a lieu ?",
        "back": "Mise en circulation des billets et pièces en euro dans les pays participants.",
        "hint": "Billets/pièces."
      },
      {
        "front": "2004: que signifie l’élargissement de l’UE à l’Est ?",
        "back": "L’entrée de nombreux États d’Europe centrale et orientale marque la réunification politique du continent, avec nouveaux défis économiques et géopolitiques.",
        "hint": "UE vers l’Est."
      },
      {
        "front": "2005: quel événement politique européen marque un frein institutionnel ?",
        "back": "Le rejet par référendum en France (et aux Pays-Bas) du traité établissant une Constitution pour l’Europe.",
        "hint": "Référendum UE."
      },
      {
        "front": "2007-2008: quelle crise économique mondiale éclate ?",
        "back": "La crise financière partie des États-Unis (subprimes) provoque récession, chômage et fragilise la mondialisation financière.",
        "hint": "Subprimes."
      },
      {
        "front": "2010-2012: quel type de crise touche fortement la zone euro ?",
        "back": "La crise des dettes souveraines (notamment Grèce), entraînant plans d’aide, politiques d’austérité et débats sur la gouvernance économique.",
        "hint": "Dette, zone euro."
      },
      {
        "front": "2011: que représentent les « printemps arabes » ?",
        "back": "Une vague de soulèvements dans plusieurs pays arabes, avec des trajectoires diverses (transition, répression, guerre civile).",
        "hint": "Soulèvements."
      },
      {
        "front": "2014: quel événement réouvre une forte tension en Europe de l’Est ?",
        "back": "L’annexion de la Crimée par la Russie et le conflit en Ukraine, relançant les tensions avec l’Occident.",
        "hint": "Crimée."
      },
      {
        "front": "2015: quels attentats marquent la France et reconfigurent les débats de sécurité ?",
        "back": "Les attentats de janvier et du 13 novembre 2015 à Paris, qui renforcent les enjeux de sécurité et d’état d’urgence.",
        "hint": "2015, Paris."
      },
      {
        "front": "2016: que signifie le vote du Brexit ?",
        "back": "Le vote du Royaume-Uni pour quitter l’UE, révélant tensions sur souveraineté, économie et migrations.",
        "hint": "Sortie de l’UE."
      },
      {
        "front": "2020: quel événement mondial bouleverse les sociétés et économies ?",
        "back": "La pandémie de Covid-19, provoquant crise sanitaire, confinements, perturbations économiques et débats sur la mondialisation.",
        "hint": "Covid-19."
      },
      {
        "front": "2022: quel conflit majeur a lieu en Europe ?",
        "back": "L’invasion à grande échelle de l’Ukraine par la Russie, transformant l’équilibre géopolitique européen et mondial.",
        "hint": "Ukraine 2022."
      },
      {
        "front": "En France, qu’est-ce que la Vᵉ République et quand commence-t-elle ?",
        "back": "Régime politique instauré en 1958 (Constitution de 1958), renforçant l’exécutif, notamment le rôle du Président.",
        "hint": "1958."
      },
      {
        "front": "1962 (France): quelle réforme institutionnelle importante concerne l’élection présidentielle ?",
        "back": "Le Président de la République est élu au suffrage universel direct (réforme majeure de la Vᵉ République).",
        "hint": "Suffrage universel direct."
      },
      {
        "front": "1974 (France): quel abaissement de l’âge de la majorité est décidé ?",
        "back": "La majorité civile est abaissée à 18 ans en 1974.",
        "hint": "18 ans."
      },
      {
        "front": "1989: que représente la Convention internationale des droits de l’enfant ?",
        "back": "Un traité international adopté par l’ONU en 1989 fixant des droits fondamentaux pour les enfants, largement ratifié.",
        "hint": "Droits de l’enfant."
      },
      {
        "front": "Pourquoi 1945 est-elle une date-charnière pour l’ordre mondial ?",
        "back": "Parce qu’elle combine fin d’un conflit mondial, création d’institutions (ONU) et montée des superpuissances, ouvrant la bipolarisation.",
        "hint": "Nouveau monde."
      }
    ],
    "sampleIdeas": [
      {
        "name": "Le programme officiel (Terminale HG): point de départ fiable",
        "textDescription": "Pour réviser “juste”, commence par le programme officiel de terminale générale. Il indique les thèmes, les capacités attendues et les repères qui structurent les connaissances: c’est la référence stable avant d’utiliser fiches, vidéos et annales.\n\nUne stratégie efficace consiste à transformer le programme en plan de révision: pour chaque thème, prépare une frise (10–15 dates), une liste d’acteurs/lieux (10 repères) et une mini-banque d’exemples (5 cas). Cela te donne des réponses rapides et solides.\n\nEnsuite, utilise les ressources Éduscol pour consolider les notions et trouver des supports (cartes, dossiers, démarches). Tu sécurises ainsi la qualité et l’actualité de tes repères.\n\nEnfin, entraîne-toi: une frise apprise devient utile seulement si tu sais l’utiliser pour expliquer causes et conséquences.",
        "videoURL": "https://www.youtube.com/watch?v=iWvPZQm6HrI",
        "externalLinkURL": "https://www.education.gouv.fr/sites/default/files/imported_files/document/spe243_annexe1_1159172.pdf",
        "linkedCardIndices": []
      },
      {
        "name": "Guerre froide (1947-1991): frise minimale à maîtriser",
        "textDescription": "La Guerre froide se lit comme une chronologie de tensions et de phases (montée des tensions, crises, détente, durcissement, effondrement). Les repères essentiels incluent 1947 (Truman), 1948-49 (Berlin), 1961 (mur), 1962 (Cuba), 1975 (Helsinki), 1989 (mur), 1991 (URSS).\n\nPour ne pas confondre les événements, associe chaque date à un lieu et à un mécanisme: Berlin = division; Cuba = risque nucléaire; Helsinki = détente et droits; 1989/1991 = fin du bloc de l’Est.\n\nAu bac, le plus important n’est pas la récitation: c’est de savoir expliquer ce que l’événement change dans les rapports de force.\n\nEn entraînement, réponds à la question: “Pourquoi cette date est un tournant ?” en 2 phrases maximum.",
        "videoURL": "https://www.youtube.com/watch?v=SZdncx-ghxM",
        "externalLinkURL": "https://www.lumni.fr/dossier/la-guerre-froide",
        "linkedCardIndices": []
      },
      {
        "name": "Décolonisations: repères et logiques",
        "textDescription": "Les décolonisations sont des processus variés: négociations, conflits, transitions rapides ou longues. Les repères utiles incluent la fin de la Seconde Guerre mondiale (accélération), l’Indochine (Diên Biên Phu), l’Algérie (accords d’Évian) et la recomposition du « tiers-monde ».\n\nPour analyser, pense à trois facteurs: affaiblissement des métropoles, montée des nationalismes, contexte de Guerre froide (influences, aides, rivalités). Cela explique pourquoi certaines indépendances sont conflictuelles.\n\nAu bac, tu gagnes des points si tu relies une date à un mécanisme (guerre, négociation, pression internationale) et à une conséquence (nouveaux États, conflits, frontières).\n\nPrépare 3 cas précis (un en Asie, un en Afrique du Nord, un en Afrique subsaharienne) pour illustrer la diversité.",
        "videoURL": "https://www.youtube.com/watch?v=i-sRU7OjQaI",
        "externalLinkURL": "https://fr.wikipedia.org/wiki/D%C3%A9colonisation",
        "linkedCardIndices": []
      },
      {
        "name": "Construction européenne: 1957 → Maastricht → euro",
        "textDescription": "La construction européenne se lit par étapes: après des coopérations sectorielles, le traité de Rome (1957) fonde la CEE et le Marché commun. Ensuite, l’intégration s’approfondit et s’élargit.\n\nMaastricht (1992) crée l’Union européenne et prépare l’union économique et monétaire. L’euro devient monnaie scripturale en 1999, puis billets et pièces en 2002.\n\nPour réussir, associe chaque traité à un effet: Rome = marché; Maastricht = UE + citoyenneté + euro; 2004 = élargissement majeur; Brexit = crise de projet.\n\nEn rédaction, l’enjeu est d’expliquer pourquoi ces étapes répondent à des objectifs (paix, prospérité, puissance) mais créent aussi des tensions (souveraineté, inégalités).",
        "videoURL": "https://www.youtube.com/watch?v=TyYBmTEqnN0",
        "externalLinkURL": "https://www.lumni.fr/video/le-traite-de-rome",
        "linkedCardIndices": []
      },
      {
        "name": "France: Vᵉ République (1958→) en 6 repères",
        "textDescription": "Pour la France, la Vᵉ République est un repère institutionnel central: Constitution de 1958 (exécutif renforcé), puis suffrage universel direct pour l’élection présidentielle (1962). Ces règles structurent la vie politique contemporaine.\n\nEnsuite, identifie quelques repères sociétaux: Mai 68 (rupture culturelle), abolition de la peine de mort (1981), transformations économiques après 1973 (chômage, mutations), et débats récents sur sécurité et libertés.\n\nAu bac, l’objectif est de lier institutions et société: comment les règles du pouvoir influencent les crises et les réformes.\n\nEntraîne-toi: résume la Vᵉ République en 5 lignes avec 3 dates et 2 conséquences.",
        "videoURL": "https://www.youtube.com/watch?v=9x4WcXyHqS0",
        "externalLinkURL": "https://fr.wikipedia.org/wiki/Cinqui%C3%A8me_R%C3%A9publique",
        "linkedCardIndices": []
      },
      {
        "name": "1973: choc pétrolier et fin des Trente Glorieuses (repère)",
        "textDescription": "Le premier choc pétrolier (1973) marque une rupture économique: hausse des coûts de l’énergie, inflation, ralentissement de la croissance et montée du chômage. Dans beaucoup de pays, il met fin à la période de forte croissance d’après-guerre.\n\nCe repère sert à expliquer les transformations sociales et politiques: politiques économiques, montée des inégalités, recompositions industrielles.\n\nPour argumenter, relie toujours le choc à une conséquence: désindustrialisation, tertiarisation, débats sur l’État social.\n\nEn entraînement, réponds: “En quoi 1973 change-t-il les trajectoires économiques ?” en 2 phrases et un exemple.",
        "videoURL": "https://www.youtube.com/watch?v=6z0w4D4i4yQ",
        "externalLinkURL": "https://fr.wikipedia.org/wiki/Choc_p%C3%A9trolier_de_1973",
        "linkedCardIndices": []
      },
      {
        "name": "1989-1991: fin de la Guerre froide (tournant)",
        "textDescription": "La chute du mur (1989) et la dissolution de l’URSS (1991) marquent la fin de l’ordre bipolaire. L’Europe se recompose, l’Allemagne se réunifie, et les États d’Europe centrale et orientale changent de régime.\n\nCe tournant s’accompagne d’espoirs (démocratisation, “dividendes de la paix”) mais aussi de nouvelles tensions (conflits régionaux, élargissement de l’UE/OTAN, instabilités).\n\nAu bac, on attend que tu expliques le mécanisme: crise interne soviétique + réformes + effondrement du système d’alliances.\n\nEntraîne-toi: cite 2 conséquences en Europe et 2 dans le monde de ce tournant.",
        "videoURL": "https://www.youtube.com/watch?v=CgHItzaijSQ",
        "externalLinkURL": "https://www.lumni.fr/video/la-guerre-froide",
        "linkedCardIndices": []
      },
      {
        "name": "2001: attentats du 11 septembre et nouveau contexte géopolitique",
        "textDescription": "Les attentats du 11 septembre 2001 constituent un repère du monde contemporain: ils ouvrent une période de “guerre contre le terrorisme”, modifient les politiques de sécurité et influencent la politique internationale.\n\nCe repère sert à expliquer des interventions, des débats sur libertés/sécurité, et des recompositions d’alliances. Il s’inscrit dans un monde déjà globalisé où l’information circule vite.\n\nAu bac, l’enjeu est d’expliquer comment un événement peut produire des effets durables: politiques, militaires, juridiques et culturels.\n\nEntraîne-toi: explique en 3 lignes pourquoi 2001 est un tournant et cite 2 conséquences.",
        "videoURL": "https://www.youtube.com/watch?v=6ZrK8o1wqcs",
        "externalLinkURL": "https://fr.wikipedia.org/wiki/Attentats_du_11_septembre_2001",
        "linkedCardIndices": []
      },
      {
        "name": "2008: crise financière mondiale (repère)",
        "textDescription": "La crise de 2008 (subprimes) illustre les risques de la mondialisation financière: un choc né aux États-Unis se diffuse rapidement au monde entier. Elle provoque récession, chômage, et une remise en question de certains modèles économiques.\n\nCe repère est utile pour expliquer les tensions sociales et politiques: défiance, montée des inégalités, débats sur régulation, et crise de confiance.\n\nAu bac, relie le repère à un mécanisme: titrisation, endettement, interdépendances. Tu n’as pas besoin de technicité excessive: l’idée centrale est la contagion.\n\nEntraîne-toi: résume la crise en 2 causes et 2 conséquences, avec un exemple européen (crise de la zone euro).",
        "videoURL": "https://www.youtube.com/watch?v=G6Y8b6B0S8g",
        "externalLinkURL": "https://fr.wikipedia.org/wiki/Crise_financi%C3%A8re_de_2007-2008",
        "linkedCardIndices": []
      },
      {
        "name": "2020-2022: pandémie et retour de la guerre en Europe",
        "textDescription": "Deux repères très récents structurent le début des années 2020: la pandémie de Covid-19 (crise sanitaire et économique mondiale) et l’invasion à grande échelle de l’Ukraine par la Russie (2022), qui transforme la sécurité européenne.\n\nCes repères montrent un monde d’interdépendances (chaînes de valeur, santé, énergie) mais aussi de rivalités (puissance, sanctions, alliances). Ils sont utiles pour expliquer les nouvelles tensions et les politiques publiques.\n\nAu bac, l’essentiel est d’éviter la simple actualité: relie ces événements à des dynamiques de fond (mondialisation, puissances, crises).\n\nEntraîne-toi: cite 3 effets (énergie, économie, diplomatie) et 2 acteurs majeurs impliqués.",
        "videoURL": "https://www.youtube.com/watch?v=4S4kq0XgWAE",
        "externalLinkURL": "https://fr.wikipedia.org/wiki/Invasion_de_l%27Ukraine_par_la_Russie_en_2022",
        "linkedCardIndices": []
      }
    ]
  },
  {
    "stableId": "bac_maths_spe_essentiels_terminale",
    "name": "Bac Maths Spé: essentiels (Terminale)",
    "description": "Les notions-clés de maths en Terminale générale (spécialité): fonctions, limites, dérivation, suites, exponentielle/ln, probabilités (binomiale), géométrie de l’espace et algorithmique.",
    "color": "blue",
    "category": "Mathematics",
    "language": "fr",
    "difficulty": "Advanced",
    "tags": [
      "bac",
      "terminale",
      "maths",
      "specialite",
      "analyse"
    ],
    "cards": [
      {
        "front": "Qu’est-ce qu’une fonction (définition simple) ?",
        "back": "Une fonction associe à chaque nombre x d’un ensemble de départ un unique nombre f(x).",
        "hint": "Une valeur de sortie par x."
      },
      {
        "front": "Qu’est-ce que l’ensemble de définition d’une fonction ?",
        "back": "L’ensemble des valeurs de x pour lesquelles l’expression de f(x) a un sens (et est définie).",
        "hint": "Les x autorisés."
      },
      {
        "front": "Qu’appelle-t-on image et antécédent ?",
        "back": "L’image est f(x). Un antécédent de y est une valeur x telle que f(x)=y.",
        "hint": "f(x) et “qui donne y”."
      },
      {
        "front": "Comment lire les variations d’une fonction sur un tableau de variations ?",
        "back": "Si f monte quand x augmente, f est croissante; si f descend, elle est décroissante. Les extremums se lisent aux changements de sens.",
        "hint": "Monte/descend."
      },
      {
        "front": "Qu’est-ce qu’une limite de fonction en a (idée) ?",
        "back": "La valeur vers laquelle f(x) se rapproche quand x se rapproche de a, même si f(a) n’existe pas ou diffère.",
        "hint": "Se rapproche de a."
      },
      {
        "front": "Qu’est-ce qu’une limite quand x→+∞ ?",
        "back": "Le comportement de f(x) quand x devient très grand: f(x) peut tendre vers un nombre, +∞, −∞, ou osciller.",
        "hint": "“Très grand x”."
      },
      {
        "front": "Qu’est-ce qu’une forme indéterminée (exemple) ?",
        "back": "Une expression de limite qui ne permet pas de conclure directement (ex: 0/0, ∞/∞, ∞−∞). Il faut transformer.",
        "hint": "0/0."
      },
      {
        "front": "Que signifie « f est continue en a » ?",
        "back": "f(a) existe, lim(x→a) f(x) existe, et lim(x→a) f(x)=f(a).",
        "hint": "Limite = valeur."
      },
      {
        "front": "À quoi sert la continuité pour résoudre f(x)=k ?",
        "back": "Sur un intervalle où f est continue, si f prend des valeurs de part et d’autre de k, alors il existe au moins une solution (TVI).",
        "hint": "Entre deux valeurs."
      },
      {
        "front": "Qu’est-ce que la dérivée f′(a) (sens) ?",
        "back": "Le coefficient directeur de la tangente à la courbe en x=a, donc le taux de variation instantané.",
        "hint": "Pente de la tangente."
      },
      {
        "front": "Quel lien entre le signe de f′ et les variations ?",
        "back": "Si f′(x)>0, f est croissante; si f′(x)<0, f est décroissante (sur l’intervalle considéré).",
        "hint": "Signe → sens."
      },
      {
        "front": "Dérivée de x^n (n entier) ?",
        "back": "(x^n)’ = n·x^(n−1).",
        "hint": "Descendre l’exposant."
      },
      {
        "front": "Dérivée de la somme: (u+v)’ ?",
        "back": "(u+v)’ = u’+v’.",
        "hint": "Dérive terme à terme."
      },
      {
        "front": "Dérivée du produit: (u·v)’ ?",
        "back": "(u·v)’ = u’v + uv’.",
        "hint": "u’v + uv’."
      },
      {
        "front": "Dérivée du quotient: (u/v)’ (v≠0) ?",
        "back": "(u/v)’ = (u’v − uv’)/v².",
        "hint": "(u’v−uv’)/v²."
      },
      {
        "front": "Que dit la règle de dérivation d’une composée (chaîne) ?",
        "back": "Si f(x)=g(u(x)), alors f′(x)=g′(u(x))·u′(x).",
        "hint": "g’(u)×u’."
      },
      {
        "front": "Dérivée de e^x ?",
        "back": "(e^x)’ = e^x.",
        "hint": "Inchangé."
      },
      {
        "front": "Dérivée de ln(x) (x>0) ?",
        "back": "(ln x)’ = 1/x.",
        "hint": "1/x."
      },
      {
        "front": "Que signifie qu’une fonction est convexe ?",
        "back": "Sa courbe est “au-dessus” de ses tangentes; en pratique, f″(x)≥0 sur un intervalle implique la convexité.",
        "hint": "f'' ≥ 0."
      },
      {
        "front": "Qu’est-ce qu’un point d’inflexion ?",
        "back": "Un point où la convexité change (convexe ↔ concave), souvent avec f″ qui change de signe.",
        "hint": "Changement de courbure."
      },
      {
        "front": "À quoi sert l’étude du signe de f′ pour un maximum/minimum ?",
        "back": "Un extremum local apparaît typiquement quand f′ passe de + à − (max) ou de − à + (min).",
        "hint": "Changement de signe de f′."
      },
      {
        "front": "Qu’est-ce qu’une asymptote horizontale ?",
        "back": "La droite y=L si lim f(x)=L quand x→±∞.",
        "hint": "Limite finie à l’infini."
      },
      {
        "front": "Qu’est-ce qu’une asymptote verticale ?",
        "back": "La droite x=a si f(x)→±∞ quand x→a.",
        "hint": "Limite infinie en a."
      },
      {
        "front": "Qu’est-ce qu’une suite (définition) ?",
        "back": "Une suite est une fonction définie sur les entiers (souvent n≥0) qui associe à n un terme u_n.",
        "hint": "Fonction sur ℕ."
      },
      {
        "front": "Différence entre suite explicite et récurrente ?",
        "back": "Explicite: u_n donné en fonction de n. Récurrente: u_{n+1} défini à partir de u_n (et d’un terme initial).",
        "hint": "Directe vs u(n+1) avec u(n)."
      },
      {
        "front": "Qu’est-ce qu’une suite arithmétique ?",
        "back": "Une suite où u_{n+1}=u_n+r; on a u_n=u_0+nr.",
        "hint": "+r constant."
      },
      {
        "front": "Qu’est-ce qu’une suite géométrique ?",
        "back": "Une suite où u_{n+1}=q·u_n; on a u_n=u_0·q^n.",
        "hint": "×q constant."
      },
      {
        "front": "Qu’est-ce que la convergence d’une suite ?",
        "back": "u_n converge vers ℓ si les termes se rapprochent de ℓ quand n→∞.",
        "hint": "Se rapproche d’un nombre."
      },
      {
        "front": "Quel lien entre monotonie et convergence (idée) ?",
        "back": "Une suite monotone et bornée est convergente (théorème de convergence monotone).",
        "hint": "Monotone + bornée."
      },
      {
        "front": "Qu’est-ce qu’une variable aléatoire discrète ?",
        "back": "Une variable qui prend un nombre fini ou dénombrable de valeurs, chacune avec une probabilité.",
        "hint": "Valeurs dénombrables."
      },
      {
        "front": "Qu’est-ce qu’une expérience de Bernoulli ?",
        "back": "Une expérience à deux issues: succès (probabilité p) ou échec (probabilité 1−p).",
        "hint": "Succès/échec."
      },
      {
        "front": "Quand une variable suit-elle une loi binomiale B(n,p) ?",
        "back": "Quand elle compte le nombre de succès sur n répétitions indépendantes de Bernoulli de probabilité p.",
        "hint": "n essais indépendants."
      },
      {
        "front": "Espérance d’une loi binomiale B(n,p) ?",
        "back": "E(X)=n·p.",
        "hint": "n×p."
      },
      {
        "front": "Variance d’une loi binomiale B(n,p) ?",
        "back": "V(X)=n·p·(1−p).",
        "hint": "np(1−p)."
      },
      {
        "front": "Qu’est-ce qu’une loi des grands nombres (idée) ?",
        "back": "Quand le nombre d’essais augmente, la fréquence observée d’un événement tend vers sa probabilité (sous conditions).",
        "hint": "Fréquence → probabilité."
      },
      {
        "front": "Qu’est-ce qu’un intervalle de confiance (intuition) ?",
        "back": "Un intervalle construit à partir d’un échantillon qui a une forte probabilité de contenir le paramètre (ex: proportion) de la population.",
        "hint": "Échantillon → intervalle."
      },
      {
        "front": "Qu’est-ce qu’un vecteur de l’espace ?",
        "back": "Un objet représentant un déplacement (direction, sens, norme) indépendant de la position.",
        "hint": "Déplacement."
      },
      {
        "front": "Qu’est-ce que la colinéarité de deux vecteurs ?",
        "back": "Deux vecteurs sont colinéaires si l’un est un multiple de l’autre; ils ont la même direction (ou opposée).",
        "hint": "Multiple."
      },
      {
        "front": "Condition de parallélisme de deux droites en espace (idée) ?",
        "back": "Deux droites sont parallèles si leurs vecteurs directeurs sont colinéaires.",
        "hint": "Vecteurs directeurs colinéaires."
      },
      {
        "front": "Qu’est-ce qu’un plan défini par un point et deux vecteurs ?",
        "back": "Un plan peut être défini par un point et deux vecteurs non colinéaires (directions du plan).",
        "hint": "2 vecteurs non colinéaires."
      },
      {
        "front": "Qu’est-ce qu’une représentation paramétrique d’une droite ?",
        "back": "Une écriture décrivant tous les points de la droite: un point + un paramètre multiplié par un vecteur directeur.",
        "hint": "Point + t·vecteur."
      },
      {
        "front": "Qu’est-ce qu’un produit scalaire (idée) ?",
        "back": "Un nombre qui mesure l’alignement de deux vecteurs; il sert à parler d’angles, d’orthogonalité et de projections.",
        "hint": "Alignement."
      },
      {
        "front": "Quand deux vecteurs sont-ils orthogonaux ?",
        "back": "Quand leur produit scalaire est nul.",
        "hint": "Produit scalaire = 0."
      },
      {
        "front": "Dans un repère, comment utiliser le produit scalaire pour un angle ?",
        "back": "u·v = ||u||·||v||·cos(θ). Cela relie angle et produit scalaire.",
        "hint": "cos(θ)."
      },
      {
        "front": "Qu’est-ce que la fonction exponentielle exp(x) ?",
        "back": "La fonction exp(x)=e^x, strictement positive, croissante, avec exp(0)=1 et (e^x)’=e^x.",
        "hint": "Toujours >0."
      },
      {
        "front": "À quoi sert ln(x) (logarithme népérien) ?",
        "back": "C’est la fonction réciproque de exp sur (0,+∞); elle transforme produits en sommes et apparaît en croissance/optimisation.",
        "hint": "Réciproque de exp."
      },
      {
        "front": "Résoudre e^x = a (a>0) ?",
        "back": "x = ln(a).",
        "hint": "Appliquer ln."
      },
      {
        "front": "Résoudre ln(x)=b (x>0) ?",
        "back": "x = e^b.",
        "hint": "Appliquer exp."
      },
      {
        "front": "Que représente une équation différentielle simple y’=ay ?",
        "back": "Un modèle de croissance/décroissance exponentielle; solutions de la forme y(x)=C·e^{ax}.",
        "hint": "e^{ax}."
      },
      {
        "front": "Qu’est-ce que la dichotomie (algorithme) ?",
        "back": "Une méthode numérique pour approcher une solution de f(x)=0 sur un intervalle où f est continue et change de signe.",
        "hint": "Couper l’intervalle."
      },
      {
        "front": "Qu’est-ce qu’un ordre de grandeur utile pour contrôler un résultat ?",
        "back": "Une estimation rapide (arrondi, puissance de 10) pour vérifier si une réponse est plausible avant de conclure.",
        "hint": "Estimation rapide."
      },
      {
        "front": "Où trouver le programme officiel de la spécialité maths (Terminale) ?",
        "back": "Au Bulletin officiel/Éduscol. Réf : https://www.education.gouv.fr/bo/19/Special8/MENE1921246A.htm et PDF : https://eduscol.education.fr/document/24568/download",
        "hint": "BO + Éduscol."
      },
      {
        "front": "Quelle ressource fiable propose des exercices par chapitre de Terminale spé maths ?",
        "back": "Khan Academy (Terminale spécialité maths) propose cours/exercices. Réf : https://fr.khanacademy.org/math/terminale-specialite-math",
        "hint": "Khan Academy."
      }
    ],
    "sampleIdeas": [
      {
        "name": "Programme officiel & attentes (spé maths Terminale)",
        "textDescription": "Pour réviser sans te tromper, pars toujours du programme officiel: il fixe les notions, capacités et limites de ce qui peut être évalué. C’est la source la plus sûre pour éviter d’apprendre des chapitres “hors programme” ou, au contraire, de rater une compétence attendue.\n\nTransforme le programme en plan d’action: pour chaque thème (suites, dérivation, probabilités…), écris 1 fiche avec: (1) définitions en 2 lignes, (2) 5 techniques (formules/règles), (3) 5 exercices types (niveau croissant).\n\nEnsuite, utilise Éduscol pour trouver des ressources et des sujets types. L’objectif n’est pas de tout faire, mais de devenir rapide sur les automatismes (dériver, résoudre, encadrer, lire un signe) et précis sur le vocabulaire.\n\nEnfin, vérifie tes acquis avec du rappel actif: récite une règle, applique-la sur un mini-exemple, puis explique en 2 phrases “pourquoi ça marche”.",
        "videoURL": "https://www.youtube.com/playlist?list=PL_1WVGjLTYqJIAeYa1QczoFLAogOclYlk",
        "externalLinkURL": "https://www.education.gouv.fr/bo/19/Special8/MENE1921246A.htm",
        "linkedCardIndices": []
      },
      {
        "name": "Limites & continuité: savoir conclure vite",
        "textDescription": "Les limites servent à comprendre le comportement d’une fonction près d’un point (a) ou à l’infini. Pour progresser, distingue: limites finies, limites infinies, et formes indéterminées (0/0, ∞/∞, ∞−∞).\n\nLa continuité est un outil puissant: si f est continue sur [a,b] et prend des valeurs de part et d’autre d’un nombre k, alors il existe au moins une solution à f(x)=k. C’est le réflexe “TVI”: utile pour prouver l’existence d’une solution, avant de l’approcher par dichotomie.\n\nUne bonne copie est courte et structurée: “f est continue sur…, f(a)<0 et f(b)>0, donc il existe c∈(a,b) tel que f(c)=0.” Ensuite seulement, on approche c.\n\nEn entraînement, prends 10 exercices: 5 sur limites, 5 sur existence de solutions. Le gain de points vient souvent de ces conclusions nettes.",
        "videoURL": "https://www.youtube.com/watch?v=6ZsIITPcXH4",
        "externalLinkURL": "https://fr.khanacademy.org/math/terminale-specialite-math",
        "linkedCardIndices": []
      },
      {
        "name": "Dérivation: règles + lecture graphique",
        "textDescription": "La dérivation relie calcul et géométrie: f′(a) est la pente de la tangente, et le signe de f′ commande les variations. C’est le duo le plus rentable du programme.\n\nPour être solide, maîtrise 6 règles: somme, produit, quotient, puissance, exp, ln, et la chaîne (fonction composée). Beaucoup d’erreurs viennent d’une chaîne oubliée ou d’un quotient mal dérivé.\n\nEnsuite, lis graphiquement: si la courbe monte, f′>0; si elle descend, f′<0. Les extremums apparaissent quand f′ change de signe. La convexité peut se lire via f″: f″≥0 → convexe.\n\nPour t’entraîner, fais une routine: 10 dérivées en 10 minutes, puis 2 études de fonctions (tableaux + variation) avec une copie propre.",
        "videoURL": "https://www.youtube.com/playlist?list=PLVUDmbpupCaolmlZsgQvpuNlXlUQ5D5vS",
        "externalLinkURL": "https://fr.khanacademy.org/math/terminale-specialite-math/xf1ac4b39acd29386%3Acomplements-sur-la-derivation",
        "linkedCardIndices": []
      },
      {
        "name": "Exponentielle & ln: résoudre et modéliser",
        "textDescription": "L’exponentielle exp(x)=e^x et le logarithme népérien ln(x) sont réciproques. Elles servent à résoudre des équations (e^x=a ↔ x=ln(a)) et à modéliser des phénomènes de croissance/décroissance.\n\nLes réflexes essentiels: exp est toujours positive et croissante; ln est défini seulement pour x>0 et croissant. Les dérivées sont simples: (e^x)’=e^x, (ln x)’=1/x.\n\nEn modélisation, les équations différentielles simples y’=ay conduisent à des solutions exponentielles. Même si tu n’entres pas dans tous les détails, retiens le sens: plus a est grand, plus la croissance est rapide.\n\nEn copie, montre la technique (prendre ln ou exp), puis vérifie le domaine (x>0 pour ln).",
        "videoURL": "https://www.youtube.com/watch?v=iD2uudR72p4",
        "externalLinkURL": "https://fr.khanacademy.org/math/terminale-specialite-math/xf1ac4b39acd29386%3Afonctions-logarithmes",
        "linkedCardIndices": []
      },
      {
        "name": "Suites: récurrence, limites, stratégies",
        "textDescription": "Les suites sont un passage vers l’analyse: elles décrivent des évolutions “pas à pas”. La clé est de distinguer suites explicites (u_n en fonction de n) et récurrentes (u_{n+1} en fonction de u_n).\n\nDeux familles à connaître: arithmétique (+r) et géométrique (×q). Elles servent de modèles simples et reviennent souvent comme sous-problèmes dans des exercices plus riches.\n\nPour les suites récurrentes, les méthodes fréquentes sont: montrer la monotonie (u_{n+1}−u_n) et la bornitude, puis conclure à la convergence. Ensuite, on identifie parfois la limite ℓ en résolvant l’équation ℓ=f(ℓ).\n\nRoutine efficace: 1) calculer 5 premiers termes, 2) conjecturer, 3) prouver (monotone + bornée), 4) conclure.",
        "videoURL": "https://www.youtube.com/playlist?list=PL_1WVGjLTYqLUnZ1_MbfeVZKMqr3prAF2",
        "externalLinkURL": "https://fr.khanacademy.org/math/terminale-specialite-math/xf1ac4b39acd29386%3Asuites",
        "linkedCardIndices": []
      },
      {
        "name": "Probabilités: loi binomiale (B(n,p)) sans se perdre",
        "textDescription": "La loi binomiale modélise le nombre de succès sur n répétitions indépendantes d’une expérience de Bernoulli (succès avec probabilité p). Le repère mental: “compter des succès”.\n\nLes formules à automatiser: E(X)=np et V(X)=np(1−p). Mais surtout, comprends le sens: np est le nombre moyen de succès attendu. Les calculs deviennent bien plus fiables quand tu interprètes le résultat.\n\nUne erreur fréquente est d’oublier l’indépendance ou de confondre la variable (nombre de succès) avec une probabilité. Pose toujours clairement: X = « nombre de … ».\n\nEn entraînement, fais des exercices où tu identifies la variable, écris (n,p), puis calcules P(X=k) pour quelques valeurs et interprètes.",
        "videoURL": "https://fr.khanacademy.org/math/terminale-specialite-math/xf1ac4b39acd29386%3Aprobabilites/xf1ac4b39acd29386%3Aschema-de-bernoulli-et-loi-binomiale/v/binomial-distribution",
        "externalLinkURL": "https://fr.khanacademy.org/math/terminale-specialite-math/xf1ac4b39acd29386%3Aprobabilites",
        "linkedCardIndices": []
      },
      {
        "name": "Loi des grands nombres: fréquence vs probabilité",
        "textDescription": "La loi des grands nombres formalise une intuition: quand on répète une expérience aléatoire beaucoup de fois, la fréquence observée se rapproche de la probabilité théorique. C’est un pont entre le hasard et la stabilité statistique.\n\nCe résultat explique pourquoi on peut estimer des probabilités par simulation, sondage, ou expérimentation. Mais il ne dit pas que tout devient “certain”: il parle de convergence quand le nombre d’essais grandit.\n\nLe lien bac: interpréter une simulation, comprendre pourquoi une fréquence “se stabilise”, et distinguer fluctuations à court terme et comportement à long terme.\n\nEn révision, entraîne-toi à commenter un graphique de fréquences cumulées: au début ça bouge, puis ça se stabilise autour de p.",
        "videoURL": "https://www.youtube.com/playlist?list=PLvGhGpzQZku3wcUrhx4gxkUIsgIQO0kVN",
        "externalLinkURL": "https://fr.wikipedia.org/wiki/Loi_des_grands_nombres",
        "linkedCardIndices": []
      },
      {
        "name": "Géométrie de l’espace: droites, plans, orthogonalité",
        "textDescription": "La géométrie dans l’espace combine des objets (vecteurs, droites, plans) et des relations (parallélisme, intersection, orthogonalité). Le repère central est le vecteur directeur: il te dit “dans quelle direction” va une droite.\n\nDeux droites parallèles ont des vecteurs directeurs colinéaires. Un plan peut être défini par un point et deux vecteurs non colinéaires. Les représentations paramétriques permettent de décrire tous les points d’une droite efficacement.\n\nLe produit scalaire sert à parler d’angles et d’orthogonalité: u·v=0 ↔ u ⟂ v. Dans l’espace, il est aussi utile pour démontrer qu’une droite est orthogonale à un plan (via un vecteur normal).\n\nEn révision, fais des exercices “rapides”: identifier le type (droite/plan), écrire un vecteur directeur, conclure sur position relative.",
        "videoURL": "https://www.youtube.com/watch?v=EoT48VtnUJ4",
        "externalLinkURL": "https://fr.khanacademy.org/math/linear-algebra/vectors-and-spaces",
        "linkedCardIndices": []
      },
      {
        "name": "Trigonométrie: sin/cos comme fonctions (réflexes)",
        "textDescription": "En terminale, la trigonométrie n’est pas seulement “des triangles”: sin et cos deviennent des fonctions avec périodicité, variations et propriétés. Les exercices typiques portent sur limites, dérivation, équations trigonométriques et lecture graphique.\n\nLe réflexe important est la compréhension du cercle trigonométrique: il donne les valeurs remarquables et l’interprétation géométrique. Ensuite, on utilise les propriétés (période, parité) pour résoudre des équations.\n\nEn analyse, sin et cos apparaissent dans des limites et des dérivées. Ne cherche pas des “trucs” magiques: pose les bornes (−1 ≤ sin ≤ 1), puis encadre.\n\nEn entraînement, fais 5 équations trigonométriques (solutions en radians) et 5 limites utilisant l’encadrement.",
        "videoURL": "https://www.youtube.com/watch?v=tQ-ZEjhZ2EM",
        "externalLinkURL": "https://fr.wikipedia.org/wiki/Trigonom%C3%A9trie",
        "linkedCardIndices": []
      },
      {
        "name": "Algorithmique: dichotomie et suites (raisonner en étapes)",
        "textDescription": "L’algorithmique évalue ta capacité à décrire un raisonnement en étapes: initialiser, itérer, tester une condition, conclure. En maths, elle sert à simuler des suites, approcher des solutions, et automatiser des calculs.\n\nLa dichotomie est l’algorithme “star”: si f est continue sur [a,b] et change de signe, on coupe l’intervalle en deux et on conserve la moitié où le signe change. En répétant, on obtient une approximation contrôlée.\n\nPour une suite, un pseudo-code simple calcule les termes successifs et permet d’observer la convergence. Mais l’important au bac est souvent l’interprétation: “que fait l’algorithme et pourquoi cela marche ?”.\n\nEn révision, écris le pseudo-code à la main: c’est la meilleure façon de comprendre et d’éviter les erreurs de logique.",
        "videoURL": "https://www.youtube.com/watch?v=QynKTkxP-Gk",
        "externalLinkURL": "https://fr.khanacademy.org/computing/computer-science/algorithms",
        "linkedCardIndices": []
      }
    ]
  },
  {
    "stableId": "bac_philo_notions_reperes_auteurs_terminale",
    "name": "Bac Philo: notions, repères, auteurs (Terminale)",
    "description": "Les 17 notions du programme de philosophie (terminale générale) avec repères (distinctions), exemples classiques et auteurs mobilisables. Contenu prioritaire + un minimum de méthode.",
    "color": "orange",
    "category": "Philosophy",
    "language": "fr",
    "difficulty": "Advanced",
    "tags": [
      "bac",
      "terminale",
      "philosophie",
      "notions",
      "auteurs"
    ],
    "cards": [
      {
        "front": "Qu’appelle-t-on une « notion » au programme de philosophie ?",
        "back": "Un grand thème de réflexion (ex: liberté, vérité) qui sert de cadre à des problèmes, des distinctions et des arguments à mobiliser en dissertation ou explication.",
        "hint": "Thème → problèmes → distinctions."
      },
      {
        "front": "Qu’appelle-t-on les « repères » en philosophie (terminale) ?",
        "back": "Des distinctions conceptuelles (souvent en couples) qui clarifient les questions (ex: en fait/en droit, subjectif/objectif) et évitent les confusions.",
        "hint": "Distinctions en couples."
      },
      {
        "front": "Donne un exemple de repère et explique à quoi il sert.",
        "back": "En fait / en droit: distinguer ce qui est (constat) de ce qui devrait être (norme), utile pour parler de justice, liberté, devoir.",
        "hint": "Constat vs norme."
      },
      {
        "front": "Que signifie le repère « nécessaire / contingent » ?",
        "back": "Nécessaire: ne peut pas être autrement; contingent: pourrait être autrement. Utile pour discuter lois, causalité, destin, liberté.",
        "hint": "Ne peut pas / pourrait."
      },
      {
        "front": "Que signifie le repère « absolu / relatif » ?",
        "back": "Absolu: valable sans condition; relatif: dépend d’un point de vue, d’un contexte ou d’une relation. Utile pour vérité, morale, culture.",
        "hint": "Sans condition vs dépend."
      },
      {
        "front": "Que signifie le repère « subjectif / objectif » ?",
        "back": "Subjectif: lié au point de vue d’un sujet; objectif: indépendant des préférences d’un individu, visant l’universalité (ex: science).",
        "hint": "Point de vue vs indépendant."
      },
      {
        "front": "Que signifie le repère « théorique / pratique » ?",
        "back": "Théorique: connaître/comprendre; pratique: agir/transformer. Utile pour science, technique, morale, politique.",
        "hint": "Savoir vs agir."
      },
      {
        "front": "Que signifie le repère « persuader / convaincre » ?",
        "back": "Persuader vise l’adhésion par l’émotion et la rhétorique; convaincre vise l’assentiment par raisons et preuves.",
        "hint": "Émotion vs raisons."
      },
      {
        "front": "Notion: conscience — définition simple.",
        "back": "Capacité à se rapporter à soi (se savoir exister, penser ses états) et à être présent au monde; elle fonde responsabilité et identité.",
        "hint": "Se savoir soi-même."
      },
      {
        "front": "Notion: inconscient — idée centrale.",
        "back": "Hypothèse d’une partie de la vie psychique non consciente qui influence pensées et actes; elle remet en cause la transparence de soi.",
        "hint": "Pas transparent à soi."
      },
      {
        "front": "Exemple classique pour discuter l’inconscient ?",
        "back": "Le lapsus, le rêve ou l’acte manqué: comportements interprétables comme expressions d’un désir ou d’un conflit non conscient.",
        "hint": "Lapsus/rêve."
      },
      {
        "front": "Notion: désir — définition utile.",
        "back": "Tendance vers un objet imaginé comme source de satisfaction; il peut être manque, puissance de vie, ou moteur de culture selon les analyses.",
        "hint": "Tendance vers un objet."
      },
      {
        "front": "Distinction utile: besoin vs désir.",
        "back": "Le besoin vise une satisfaction vitale et limitée; le désir dépasse le biologique, s’élargit, se transforme et peut ne pas avoir de terme.",
        "hint": "Vital vs illimité."
      },
      {
        "front": "Notion: bonheur — définition minimale.",
        "back": "État durable de satisfaction globale; il se distingue d’un plaisir ponctuel et pose la question des conditions d’une vie réussie.",
        "hint": "Durable vs plaisir."
      },
      {
        "front": "Distinction utile: plaisir vs bonheur.",
        "back": "Le plaisir est ponctuel et local; le bonheur est un état global et plus durable, souvent lié à une manière de vivre.",
        "hint": "Ponctuel vs durable."
      },
      {
        "front": "Notion: liberté — définition utile.",
        "back": "Capacité d’agir et de choisir; elle se discute entre absence de contraintes (liberté négative) et capacité réelle d’agir (liberté positive).",
        "hint": "Négative/positive."
      },
      {
        "front": "Exemple classique pour discuter la liberté et le déterminisme ?",
        "back": "Le dilemme de l’addiction ou de l’habitude: on « veut » mais on est entraîné; utile pour interroger responsabilité et autonomie.",
        "hint": "Habitude/addiction."
      },
      {
        "front": "Notion: justice — définition minimale.",
        "back": "Principe d’attribution de droits, de biens ou de sanctions selon une norme; elle vise l’équité, l’égalité ou la proportion selon les cas.",
        "hint": "Attribuer selon une norme."
      },
      {
        "front": "Distinction utile: égalité vs équité.",
        "back": "Égalité: même traitement pour tous; équité: ajuster selon les situations pour être juste (proportion, besoins, mérite).",
        "hint": "Même vs ajuster."
      },
      {
        "front": "Notion: droit — idée centrale.",
        "back": "Ensemble de règles obligatoires instituées; il organise la vie commune et se distingue de la morale même s’il peut s’en inspirer.",
        "hint": "Règles instituées."
      },
      {
        "front": "Notion: devoir — définition utile.",
        "back": "Exigence normative de faire (ou ne pas faire) quelque chose; il peut venir de la loi, de la morale ou d’un engagement.",
        "hint": "Exigence normative."
      },
      {
        "front": "Notion: État — définition simple.",
        "back": "Institution souveraine qui fait les lois, rend la justice et organise le pouvoir sur un territoire et une population.",
        "hint": "Souveraineté + lois."
      },
      {
        "front": "Notion: société — idée clé.",
        "back": "Ensemble de relations, normes et institutions qui structurent la vie collective; elle façonne individus et comportements.",
        "hint": "Normes + institutions."
      },
      {
        "front": "Notion: travail — définition utile.",
        "back": "Activité par laquelle l’humain transforme la nature et se transforme lui-même; il peut être contrainte, création ou aliénation.",
        "hint": "Transformer."
      },
      {
        "front": "Exemple classique sur travail et technique ?",
        "back": "La division du travail: augmente la productivité mais peut appauvrir le sens, la créativité ou l’autonomie du travailleur.",
        "hint": "Division du travail."
      },
      {
        "front": "Notion: technique — définition minimale.",
        "back": "Ensemble de procédés et d’outils pour produire un résultat; elle augmente la puissance d’agir et transforme nos manières de vivre.",
        "hint": "Procédés + outils."
      },
      {
        "front": "Idée clé: technique et vérité (problème possible).",
        "back": "La technique peut aider la vérité (mesure, instrumentation) mais aussi la masquer (manipulation, illusion, simulation).",
        "hint": "Aider / masquer."
      },
      {
        "front": "Notion: science — définition utile.",
        "back": "Savoir méthodique fondé sur preuves, modèles et tests; elle vise des énoncés contrôlables et partageables (objectivité).",
        "hint": "Preuves + tests."
      },
      {
        "front": "Distinction utile: opinion vs savoir.",
        "back": "Opinion: adhésion sans justification solide; savoir: croyance vraie justifiée par des raisons ou des preuves, communicable.",
        "hint": "Justification."
      },
      {
        "front": "Notion: vérité — définition minimale.",
        "back": "Caractère de ce qui est conforme au réel ou validé par des critères; elle se discute selon correspondance, cohérence, preuve, consensus.",
        "hint": "Critères de vérité."
      },
      {
        "front": "Notion: raison — définition simple.",
        "back": "Faculté de juger, argumenter et établir des liens logiques; elle sert à distinguer le vrai du faux et à orienter l’action.",
        "hint": "Argumenter/logique."
      },
      {
        "front": "Notion: langage — idée centrale.",
        "back": "Système de signes qui permet communication et pensée; il structure notre rapport au monde et peut aussi le déformer (ambiguïtés).",
        "hint": "Signes."
      },
      {
        "front": "Exemple classique sur langage et réalité ?",
        "back": "Les mots généraux (“justice”, “liberté”) simplifient; ils sont nécessaires pour penser, mais peuvent masquer la complexité du réel.",
        "hint": "Mots généraux."
      },
      {
        "front": "Notion: temps — définition utile.",
        "back": "Dimension du changement et de la durée; il se pense comme vécu (subjectif) et comme mesuré (objectif, horloge).",
        "hint": "Vécu vs mesuré."
      },
      {
        "front": "Distinction utile: temps vécu vs temps mesuré.",
        "back": "Temps vécu: expérience subjective (attente, souvenir); temps mesuré: quantification (horloges, calendriers) pour coordonner.",
        "hint": "Subjectif/objectif."
      },
      {
        "front": "Notion: nature — définition minimale.",
        "back": "Ce qui existe sans intervention humaine (monde physique, vivant) et/ou l’essence d’une chose; elle s’oppose souvent à culture/technique.",
        "hint": "Sans intervention."
      },
      {
        "front": "Distinction utile: nature vs culture.",
        "back": "Nature: donné biologique/physique; culture: acquis social et symbolique. Utile pour discuter l’humain, le langage, la morale.",
        "hint": "Donné vs acquis."
      },
      {
        "front": "Notion: religion — idée clé.",
        "back": "Ensemble de croyances, rites et institutions liés au sacré; elle pose des questions sur foi, vérité, morale et communauté.",
        "hint": "Sacré + rites."
      },
      {
        "front": "Notion: art — définition utile.",
        "back": "Production humaine visant une forme, une expression ou une expérience esthétique; il interroge imitation, création et sens.",
        "hint": "Esthétique/création."
      },
      {
        "front": "Notion: beauté — idée centrale.",
        "back": "Ce qui suscite une appréciation esthétique; elle peut être pensée comme jugement subjectif mais prétendant à l’universalité.",
        "hint": "Subjectif + prétention universelle."
      },
      {
        "front": "Notion: morale — définition minimale.",
        "back": "Ensemble de normes du bien et du mal guidant les actions; elle se discute entre règles universelles et contextes particuliers.",
        "hint": "Normes du bien/mal."
      },
      {
        "front": "Notion: bonheur et morale — tension classique.",
        "back": "On peut se demander si être moral rend heureux, ou si le bonheur peut justifier l’immoralité; cela oppose devoir et intérêt.",
        "hint": "Devoir vs intérêt."
      },
      {
        "front": "Notion: politique — définition simple.",
        "back": "Organisation et exercice du pouvoir dans une collectivité; elle porte sur loi, justice, liberté, autorité et participation.",
        "hint": "Pouvoir collectif."
      },
      {
        "front": "Exemple classique pour justice et État ?",
        "back": "Les lois peuvent être légales mais injustes: cela ouvre la question de la légitimité (droits, équité, désobéissance).",
        "hint": "Légal ≠ juste."
      },
      {
        "front": "Qu’appelle-t-on une « thèse » en dissertation ?",
        "back": "La position que tu défends à un moment du raisonnement; elle doit être justifiée par des arguments et testée par des objections.",
        "hint": "Position défendue."
      },
      {
        "front": "Pourquoi les exemples doivent-ils être « exploités » ?",
        "back": "Parce qu’un exemple n’est pas décoratif: tu dois expliquer ce qu’il montre et comment il soutient ton argument.",
        "hint": "Exemple = preuve."
      },
      {
        "front": "Quel est le but d’une explication de texte en philo ?",
        "back": "Rendre intelligible la thèse du texte et le raisonnement qui la soutient (concepts, étapes, connecteurs logiques), sans paraphrase.",
        "hint": "Thèse + raisonnement."
      },
      {
        "front": "Quelle ressource officielle contient la liste des 17 notions et des repères ?",
        "back": "Le programme de philosophie (voie générale) publié au Bulletin officiel et disponible en PDF. Réf : https://www.education.gouv.fr/media/70302/download",
        "hint": "Programme officiel PDF."
      },
      {
        "front": "Où trouver une page officielle centralisant programmes/ressources de philo (mise à jour) ?",
        "back": "Sur Éduscol: « Programmes et ressources en philosophie - voie GT ». Réf : https://eduscol.education.fr/1702/programmes-et-ressources-en-philosophie-voie-gt",
        "hint": "Éduscol philo."
      }
    ],
    "sampleIdeas": [
      {
        "name": "Programme officiel: 17 notions + repères (référence)",
        "textDescription": "Pour une révision fiable, le point de départ est le programme officiel: il liste les 17 notions et les repères (distinctions) qui structurent l’enseignement. Ce document sert de carte: il indique ce que tu dois savoir manipuler (définir, distinguer, problématiser), sans imposer une seule manière de penser.\n\nMéthode de révision “programme-first”: pour chaque notion, prépare 2 définitions (sens 1 / sens 2), 2 repères utiles, 1 exemple concret, et 1 auteur mobilisable. Tu obtiens une boîte à outils compacte et réutilisable sur beaucoup de sujets.\n\nLes repères sont essentiels: ils te permettent d’éviter les confusions et de produire des copies plus précises. Par exemple, en fait/en droit, nécessaire/contingent, subjectif/objectif servent dans de nombreux sujets.\n\nGarde le programme en favori: quand tu doutes d’une notion ou d’une distinction, c’est la source la plus sûre.",
        "videoURL": "https://www.youtube.com/watch?v=jqGPTUhca-U",
        "externalLinkURL": "https://www.education.gouv.fr/media/70302/download",
        "linkedCardIndices": []
      },
      {
        "name": "Repères: 10 distinctions qui débloquent les sujets",
        "textDescription": "Les repères sont des distinctions qui rendent un sujet plus clair en quelques secondes. Bien utilisés, ils te donnent un angle de problématisation: par exemple, en fait/en droit permet de distinguer ce qui est constaté de ce qui devrait être; subjectif/objectif clarifie la question de la vérité; nécessaire/contingent aide à discuter déterminisme et liberté.\n\nPour les mémoriser, ne les apprends pas comme une liste. Associe chaque repère à une notion typique: en droit/en fait (justice, droit), subjectif/objectif (science, vérité), théorie/pratique (technique, morale), persuader/convaincre (langage, politique).\n\nEn dissertation, un repère est souvent une transition: tu peux montrer qu’une réponse est valable “en fait” mais insuffisante “en droit”. En explication de texte, il sert à expliciter le sens d’un concept.\n\nEntraîne-toi: choisis un sujet et force-toi à écrire 3 repères possibles. Le meilleur est celui qui fait apparaître la difficulté centrale.",
        "videoURL": "https://www.youtube.com/watch?v=hNOlcgI0ioM",
        "externalLinkURL": "https://eduscol.education.fr/document/24049/download",
        "linkedCardIndices": []
      },
      {
        "name": "Liberté: négative/positive, responsabilité, déterminisme",
        "textDescription": "La liberté est souvent comprise comme absence de contraintes (liberté négative) ou comme capacité réelle d’agir (liberté positive). La difficulté philosophique est de savoir si l’on est réellement auteur de ses actes ou si l’on est déterminé par des causes (biologiques, sociales, psychiques).\n\nPour argumenter, utilise des exemples: l’habitude, l’addiction, la pression sociale. Ils montrent qu’on peut “vouloir” sans être pleinement libre, ce qui ouvre la question de l’autonomie et de l’éducation.\n\nLes repères nécessaires/contingent et en fait/en droit sont utiles: même si, en fait, beaucoup d’actions sont déterminées, peut-on maintenir, en droit, la responsabilité ?\n\nEnfin, relie liberté et politique: la liberté individuelle suppose souvent des institutions (droits, lois) qui la rendent possible et la limitent.",
        "videoURL": "https://www.youtube.com/watch?v=Vpjy0eFk5J0",
        "externalLinkURL": "https://fr.wikipedia.org/wiki/Libert%C3%A9",
        "linkedCardIndices": []
      },
      {
        "name": "Justice & droit: égalité, équité, légalité, légitimité",
        "textDescription": "La justice pose la question de l’attribution: qui mérite quoi, selon quels critères ? On distingue souvent égalité (même traitement) et équité (ajustement selon situations), ce qui aide à discuter mérite, besoins, discrimination, sanctions.\n\nAutre distinction clé: légal vs légitime. Une loi peut être légale mais jugée injuste; cela ouvre des problèmes sur la désobéissance, les droits fondamentaux et la réforme.\n\nPour des exemples, pense à l’école (égalité des chances vs équité), à la fiscalité (proportionnel/progressif), ou à la justice pénale (sanction, réinsertion).\n\nMobiliser un auteur n’est pas obligatoire, mais une idée peut structurer: justice comme équité (Rawls), justice comme vertu politique (Aristote), justice et contrat social (Rousseau).",
        "videoURL": "https://www.youtube.com/watch?v=bQyHJlLk4ds",
        "externalLinkURL": "https://fr.wikipedia.org/wiki/Justice",
        "linkedCardIndices": []
      },
      {
        "name": "Vérité & science: opinion, preuve, objectivité",
        "textDescription": "La vérité peut être pensée comme correspondance au réel, comme cohérence logique, ou comme validité démontrée. En philosophie, la difficulté est de distinguer ce qui est vrai de ce qui est simplement cru.\n\nLa science vise des énoncés testables et partageables: elle met en place des méthodes de preuve (expérience, modèle, réfutation). Les repères subjectif/objectif et certain/probable sont particulièrement utiles.\n\nExemples mobilisables: illusion perceptive (vérité des sens), controverses scientifiques (provisoire des théories), désinformation (vrai/probable).\n\nPour écrire, évite l’absolu facile: montrer comment on justifie une vérité (critères) est souvent plus fort que dire “la vérité existe / n’existe pas”.",
        "videoURL": "https://www.youtube.com/watch?v=HFEar52TFig",
        "externalLinkURL": "https://fr.wikipedia.org/wiki/V%C3%A9rit%C3%A9",
        "linkedCardIndices": []
      },
      {
        "name": "Conscience & inconscient: se connaître, se tromper sur soi",
        "textDescription": "La conscience renvoie au fait de se savoir et de réfléchir sur ses propres pensées. Mais cette transparence est contestée: l’inconscient désigne des processus psychiques qui échappent à la conscience et influencent nos actes.\n\nExemples classiques: lapsus, rêves, actes manqués. Ils sont intéressants parce qu’ils montrent une action “signifiante” sans intention consciente explicite.\n\nLe problème devient: peut-on être responsable de ce qui nous échappe ? Ici, les repères en fait/en droit et origine/fondement aident à distinguer causes et justification.\n\nDans une copie, évite le “tout est inconscient”: montre plutôt la tension entre maîtrise de soi, déterminations et possibilité d’éducation ou de thérapie.",
        "videoURL": "https://www.youtube.com/watch?v=Pcf55xWTJUo",
        "externalLinkURL": "https://fr.wikipedia.org/wiki/Inconscient",
        "linkedCardIndices": []
      },
      {
        "name": "Technique: puissance d’agir, risques, vérité",
        "textDescription": "La technique est l’ensemble des procédés et outils qui augmentent la puissance d’agir. Elle peut libérer (santé, production, communication) mais aussi créer de nouvelles dépendances, risques ou formes de contrôle.\n\nPour problématiser, utilise l’idée d’ambivalence: la technique sert la vérité (mesure, instruments) mais peut aussi la brouiller (manipulation, deepfakes, propagande). Cela relie technique, vérité et politique.\n\nExemples: réseaux sociaux (information/désinformation), IA (aide/illusion), médecine (progrès/éthique).\n\nLe repère théorie/pratique aide: la science produit des connaissances, la technique produit des effets; ils se nourrissent mais ne se confondent pas.",
        "videoURL": "https://www.youtube.com/watch?v=oXfOIMwLIME",
        "externalLinkURL": "https://fr.wikipedia.org/wiki/Technique",
        "linkedCardIndices": []
      },
      {
        "name": "Travail: contrainte, création, aliénation",
        "textDescription": "Le travail peut être pensé comme contrainte (nécessité de vivre) et comme activité de transformation (du monde et de soi). Il peut donner sens, identité, reconnaissance, mais aussi aliéner (perte de maîtrise, répétition, domination).\n\nExemples: division du travail, automatisation, précarité, métiers “utiles”. Ces exemples permettent de discuter liberté, justice, technique et société.\n\nLa distinction théorie/pratique aide: le travail est pratique, mais il suppose des savoirs. Et la distinction public/privé ouvre sur la reconnaissance sociale du travail.\n\nDans une dissertation, montre que “travailler” n’est pas seulement “être occupé”: c’est une relation à la nature, à la société, et à soi.",
        "videoURL": "https://www.youtube.com/watch?v=ZUkqthdG9zY",
        "externalLinkURL": "https://fr.wikipedia.org/wiki/Travail_(philosophie)",
        "linkedCardIndices": []
      },
      {
        "name": "Temps: vécu, mémoire, mesure",
        "textDescription": "Le temps se pense comme vécu (attente, souvenir, durée) et comme mesuré (horloges, calendriers). Cette distinction est centrale: on peut mesurer le temps sans comprendre ce que “vivre le temps” signifie.\n\nExemples: une minute d’attente paraît longue, une minute de plaisir paraît courte. Cela montre la dimension subjective du temps.\n\nLe repère objectif/subjectif est donc très utile ici. Tu peux aussi relier le temps au travail (organisation), à la technique (mesure), et à la conscience (mémoire).\n\nDans une copie, passe vite du constat à la question: qu’est-ce que le temps “est” si sa perception varie ?",
        "videoURL": "https://www.youtube.com/watch?v=jEsQ4Rrb8MM",
        "externalLinkURL": "https://fr.wikipedia.org/wiki/Temps",
        "linkedCardIndices": []
      },
      {
        "name": "Méthode minimale: dissertation vs explication de texte",
        "textDescription": "Même si le contenu est prioritaire, un minimum de méthode évite les erreurs. En dissertation, l’essentiel est de définir les termes, faire apparaître une difficulté (problématique), puis construire une progression (thèse → objection → dépassement). Les repères servent de leviers.\n\nEn explication de texte, l’essentiel est d’identifier la thèse et les étapes du raisonnement. Les connecteurs logiques (donc, car, mais) sont ta charpente. L’objectif n’est pas de paraphraser, mais d’expliquer concepts et liens.\n\nPour choisir le jour J: prends le sujet où tu peux définir clairement les termes et trouver vite une difficulté; sinon, prends le texte si tu identifies la thèse et le plan.\n\nS’entraîner efficacement: 1 sujet = 10 minutes d’analyse (définitions, repères) + 5 minutes de plan, sans rédiger au début. La vitesse vient avec la répétition.",
        "videoURL": "https://www.youtube.com/watch?v=gkeQQT7HYZo",
        "externalLinkURL": "https://www.lumni.fr/dossier/revisions-du-bac-philosophie",
        "linkedCardIndices": []
      }
    ]
  },
  {
    "stableId": "bac_physique_chimie_essentiels_terminale",
    "name": "Bac Physique-Chimie: essentiels (Terminale)",
    "description": "Notions clés de physique-chimie (Terminale générale, spécialité): ondes, optique, mécanique/énergie, électricité, transformations chimiques, acide-base, oxydoréduction, cinétique, thermodynamique, radioactivité.",
    "color": "red",
    "category": "Science",
    "language": "fr",
    "difficulty": "Advanced",
    "tags": [
      "bac",
      "terminale",
      "physique",
      "chimie",
      "formules"
    ],
    "cards": [
      {
        "front": "Qu’est-ce qu’une grandeur physique et une unité ?",
        "back": "Une grandeur physique se mesure (longueur, temps, énergie) et s’exprime avec une unité du SI (m, s, J) pour être comparable.",
        "hint": "Mesure + SI."
      },
      {
        "front": "Qu’est-ce qu’un ordre de grandeur et pourquoi l’utiliser ?",
        "back": "Une estimation approximative (souvent puissance de 10) pour vérifier qu’un résultat est plausible et repérer une erreur de calcul.",
        "hint": "Vérifier plausibilité."
      },
      {
        "front": "Qu’est-ce qu’une onde (définition) ?",
        "back": "Une perturbation qui se propage en transportant de l’énergie sans transport global de matière.",
        "hint": "Énergie sans matière."
      },
      {
        "front": "Différence entre onde mécanique et onde électromagnétique ?",
        "back": "Une onde mécanique a besoin d’un milieu matériel (son); une onde électromagnétique se propage aussi dans le vide (lumière).",
        "hint": "Milieu vs vide."
      },
      {
        "front": "Qu’est-ce que la fréquence f et son unité ?",
        "back": "Le nombre d’oscillations par seconde, en hertz (Hz).",
        "hint": "Oscillations/s."
      },
      {
        "front": "Quel lien entre période T et fréquence f ?",
        "back": "f = 1/T (avec T en secondes).",
        "hint": "Inverse."
      },
      {
        "front": "Qu’est-ce que la longueur d’onde λ ?",
        "back": "La distance parcourue par l’onde pendant une période, ou la distance entre deux points en phase, en mètres.",
        "hint": "Distance “en phase”."
      },
      {
        "front": "Relation entre vitesse v, longueur d’onde λ et fréquence f ?",
        "back": "v = λ·f.",
        "hint": "λ×f."
      },
      {
        "front": "Qu’est-ce que l’intensité sonore (niveau) et son unité ?",
        "back": "Le niveau sonore se mesure en décibels (dB) et traduit la sensation de volume liée à l’intensité du son.",
        "hint": "dB."
      },
      {
        "front": "Qu’est-ce que la diffraction et quand l’observe-t-on fortement ?",
        "back": "L’étalement d’une onde quand elle rencontre une ouverture/obstacle; elle est marquée quand la taille est comparable à λ.",
        "hint": "Taille ~ λ."
      },
      {
        "front": "Qu’est-ce que l’interférence constructive ?",
        "back": "Quand deux ondes arrivent en phase et s’additionnent, donnant un maximum d’amplitude.",
        "hint": "En phase → max."
      },
      {
        "front": "Qu’est-ce que l’interférence destructive ?",
        "back": "Quand deux ondes arrivent en opposition de phase et se compensent, donnant un minimum d’amplitude.",
        "hint": "Opposition → min."
      },
      {
        "front": "Qu’est-ce que l’indice de réfraction n ?",
        "back": "n = c/v, rapport entre la vitesse de la lumière dans le vide c et dans le milieu v.",
        "hint": "c/v."
      },
      {
        "front": "Quelle loi relie les angles en réfraction (Snell-Descartes) ?",
        "back": "n1·sin(i) = n2·sin(r).",
        "hint": "n1 sin i = n2 sin r."
      },
      {
        "front": "Qu’est-ce qu’une lentille convergente ?",
        "back": "Une lentille qui fait converger des rayons parallèles vers un foyer; elle a une distance focale f’ positive.",
        "hint": "Foyer."
      },
      {
        "front": "Relation entre distance focale f’ (m) et vergence V (dioptries) ?",
        "back": "V = 1/f’ (en m⁻¹), exprimée en dioptries.",
        "hint": "1/f’."
      },
      {
        "front": "Qu’est-ce qu’une image réelle vs virtuelle ?",
        "back": "Réelle: peut être projetée sur un écran; virtuelle: visible par l’œil mais non projetable directement.",
        "hint": "Écran ?"
      },
      {
        "front": "Qu’est-ce que l’énergie cinétique ?",
        "back": "Ec = 1/2·m·v², énergie liée au mouvement.",
        "hint": "1/2 m v²."
      },
      {
        "front": "Qu’est-ce que l’énergie potentielle de pesanteur ?",
        "back": "Epp = m·g·h (référence choisie), énergie liée à l’altitude.",
        "hint": "mgh."
      },
      {
        "front": "Que dit le principe de conservation de l’énergie mécanique (idée) ?",
        "back": "Si seules des forces conservatives agissent (sans frottements), l’énergie mécanique (Ec+Epp) reste constante.",
        "hint": "Sans frottements."
      },
      {
        "front": "Qu’est-ce qu’une force de frottement et son effet énergétique ?",
        "back": "Une force dissipative qui transforme une partie de l’énergie mécanique en énergie interne (chaleur), diminuant Em.",
        "hint": "Dissipation."
      },
      {
        "front": "Qu’est-ce que la quantité de mouvement p ?",
        "back": "p = m·v, vecteur utile pour analyser collisions et conservation dans un système isolé.",
        "hint": "m×v."
      },
      {
        "front": "Que dit la deuxième loi de Newton (forme usuelle) ?",
        "back": "Dans un référentiel galiléen, la somme des forces vaut m·a: ΣF = m·a.",
        "hint": "m·a."
      },
      {
        "front": "Qu’est-ce qu’une tension électrique U ?",
        "back": "La différence de potentiel entre deux points; elle “pousse” les charges électriques, en volts (V).",
        "hint": "Différence de potentiel."
      },
      {
        "front": "Qu’est-ce que l’intensité du courant I ?",
        "back": "Le débit de charges électriques; unité: ampère (A).",
        "hint": "Débit de charges."
      },
      {
        "front": "Loi d’Ohm pour un conducteur ohmique ?",
        "back": "U = R·I (R en ohms).",
        "hint": "R×I."
      },
      {
        "front": "Puissance électrique P dans un dipôle ?",
        "back": "P = U·I (en watts).",
        "hint": "U×I."
      },
      {
        "front": "Énergie électrique consommée: relation simple ?",
        "back": "E = P·Δt (avec Δt en secondes, E en joules).",
        "hint": "P×temps."
      },
      {
        "front": "Qu’est-ce qu’une réaction chimique (définition) ?",
        "back": "Une transformation où des réactifs se transforment en produits, avec conservation des atomes et de la charge.",
        "hint": "Atomes conservés."
      },
      {
        "front": "Qu’est-ce qu’une quantité de matière n et son unité ?",
        "back": "La quantité de matière se mesure en moles (mol) et compte un grand nombre d’entités (atomes, molécules, ions).",
        "hint": "mol."
      },
      {
        "front": "Relation entre masse m, masse molaire M et quantité n ?",
        "back": "n = m/M (avec m en g si M en g·mol⁻¹).",
        "hint": "m divisé par M."
      },
      {
        "front": "Qu’est-ce que la concentration molaire C ?",
        "back": "C = n/V (en mol·L⁻¹) : quantité de soluté par volume de solution.",
        "hint": "n/V."
      },
      {
        "front": "Qu’est-ce qu’un réactif limitant ?",
        "back": "Le réactif consommé en premier; il fixe la quantité maximale de produit formé.",
        "hint": "S’épuise en premier."
      },
      {
        "front": "Qu’est-ce qu’une transformation totale vs limitée ?",
        "back": "Totale: évolution presque complète vers les produits; limitée: état d’équilibre avec réactifs et produits présents.",
        "hint": "Équilibre ?"
      },
      {
        "front": "Qu’est-ce qu’un acide et une base (Brønsted) ?",
        "back": "Acide: donneur de proton H+; base: accepteur de proton H+.",
        "hint": "H+ donne/prise."
      },
      {
        "front": "Qu’est-ce que le pH (définition) ?",
        "back": "pH = −log10([H3O+]); il mesure l’acidité d’une solution.",
        "hint": "−log[H3O+]."
      },
      {
        "front": "Qu’est-ce qu’une solution tampon ?",
        "back": "Une solution qui résiste aux variations de pH grâce à un couple acide/base conjugué.",
        "hint": "Résiste au pH."
      },
      {
        "front": "Qu’est-ce qu’une réaction d’oxydoréduction ?",
        "back": "Une réaction avec transfert d’électrons: oxydation = perte d’e−, réduction = gain d’e−.",
        "hint": "e−."
      },
      {
        "front": "Définition d’un oxydant et d’un réducteur ?",
        "back": "Oxydant: capte des électrons (se réduit). Réducteur: cède des électrons (s’oxyde).",
        "hint": "Capte/cède e−."
      },
      {
        "front": "Qu’est-ce que la vitesse de réaction (cinétique) ?",
        "back": "La variation d’une quantité (concentration, avancement) par unité de temps; elle dépend des conditions (T, catalyse).",
        "hint": "Évolution/temps."
      },
      {
        "front": "Quels facteurs accélèrent une réaction chimique ?",
        "back": "Augmenter la température, augmenter la concentration, augmenter la surface de contact, ajouter un catalyseur.",
        "hint": "T, C, surface, catalyseur."
      },
      {
        "front": "Qu’est-ce qu’un catalyseur ?",
        "back": "Une espèce qui accélère une réaction sans être consommée; elle modifie le mécanisme en abaissant l’énergie d’activation.",
        "hint": "Accélère sans se consommer."
      },
      {
        "front": "Qu’est-ce qu’un transfert thermique (chaleur) Q ?",
        "back": "L’énergie transférée sous forme de chaleur, due à une différence de température; unité: joule (J).",
        "hint": "ΔT."
      },
      {
        "front": "Relation Q = m·c·ΔT : que représentent c et ΔT ?",
        "back": "c est la capacité thermique massique (J·kg⁻¹·K⁻¹) et ΔT la variation de température (K ou °C).",
        "hint": "c et variation T."
      },
      {
        "front": "Qu’est-ce que l’enthalpie de réaction ΔrH (idée) ?",
        "back": "La chaleur échangée à pression constante lors d’une réaction; ΔrH<0 exothermique, ΔrH>0 endothermique.",
        "hint": "Exo/endo."
      },
      {
        "front": "Qu’est-ce que la radioactivité (définition) ?",
        "back": "Transformation spontanée de noyaux instables en d’autres noyaux, avec émission de particules/rayonnements (α, β, γ).",
        "hint": "Noyaux instables."
      },
      {
        "front": "Qu’est-ce que la demi-vie (période radioactive) ?",
        "back": "Le temps au bout duquel la moitié des noyaux radioactifs initiaux se sont désintégrés.",
        "hint": "Moitié."
      },
      {
        "front": "Loi de décroissance radioactive: idée/formule ?",
        "back": "N(t)=N0·(1/2)^(t/T1/2) (ou N(t)=N0·e^(−λt)), décrivant la diminution du nombre de noyaux.",
        "hint": "(1/2)^(t/T)."
      }
    ],
    "sampleIdeas": [
      {
        "name": "Programme officiel PC (Terminale): cadre fiable",
        "textDescription": "Pour réviser avec précision, commence par le programme officiel de physique-chimie (terminales) et les ressources Éduscol. Le programme fixe les thèmes, compétences (modéliser, expérimenter, raisonner) et notions évaluables.\n\nPlan de révision efficace: (1) formules essentielles + unités, (2) définitions courtes (onde, pH, oxydant…), (3) 10 exercices types (ordre de grandeur, énergie, binomiale n’existe pas ici; cinétique, acide-base, optique), (4) erreurs classiques à éviter (unités, conversions, signes).\n\nLes ressources officielles permettent de vérifier la terminologie et d’éviter les approximations. Elles aident aussi à choisir des exemples standard et des méthodes attendues.\n\nGarde ce réflexe: toute formule doit être accompagnée de ses unités. C’est la meilleure façon d’éviter les erreurs au bac.",
        "videoURL": "https://www.youtube.com/watch?v=09eL6b6L_3s",
        "externalLinkURL": "https://eduscol.education.fr/1678/programmes-et-ressources-en-physique-chimie-voie-g",
        "linkedCardIndices": []
      },
      {
        "name": "Ondes: v=λf, diffraction et interférences (réflexes)",
        "textDescription": "Les ondes reviennent souvent parce qu’elles combinent compréhension physique et calcul simple. Le trio à maîtriser: fréquence, période, longueur d’onde, reliés par v=λf. Ce lien te permet de passer d’une grandeur à l’autre rapidement.\n\nLa diffraction et les interférences donnent des critères qualitatifs: diffraction marquée si la taille de l’ouverture est du même ordre que λ; interférences constructives/destructives selon la phase.\n\nEn exercices, on attend souvent: identifier les données, convertir les unités (Hz, m), appliquer v=λf, puis interpréter (plus f est grande, plus λ est petite si v fixe).\n\nEn entraînement, fais des mini-problèmes de 2 minutes: calcul + phrase d’interprétation. C’est ce qui fait gagner des points.",
        "videoURL": "https://www.youtube.com/watch?v=1p0D2rObJmU",
        "externalLinkURL": "https://fr.khanacademy.org/science/physics/mechanical-waves-and-sound",
        "linkedCardIndices": []
      },
      {
        "name": "Optique: réfraction et lentilles (ce qui tombe)",
        "textDescription": "L’optique combine lois simples et schémas. Pour la réfraction, retiens l’indice n=c/v et la loi de Snell-Descartes: n1 sin i = n2 sin r. Cela explique pourquoi un rayon se rapproche de la normale quand il entre dans un milieu plus réfringent.\n\nPour les lentilles, la vergence V=1/f’ et la distinction image réelle/virtuelle sont centrales. Les schémas de construction (rayons remarquables) permettent de déterminer la position et la nature de l’image.\n\nL’erreur fréquente est d’oublier les unités (f’ en mètres pour la vergence). Une autre erreur est de confondre la direction des rayons ou la nature de l’image.\n\nEn révision, fais 10 schémas: 5 lentille convergente, 5 divergence, avec conclusion “réelle/virtuelle” + “agrandie/réduite”.",
        "videoURL": "https://www.youtube.com/watch?v=4f1WZ9a1n1g",
        "externalLinkURL": "https://fr.wikipedia.org/wiki/Loi_de_Snell-Descartes",
        "linkedCardIndices": []
      },
      {
        "name": "Mécanique: énergie, frottements, Newton",
        "textDescription": "En mécanique, l’idée la plus rentable est l’énergie: Ec=1/2 mv², Epp=mgh, et conservation de l’énergie mécanique quand seules des forces conservatives agissent. Les frottements dissipent l’énergie mécanique en énergie interne.\n\nLa deuxième loi de Newton ΣF=ma te sert à relier forces et mouvement. Dans les exercices, on te demande souvent de choisir la méthode: énergie (rapide quand on a des hauteurs/vitesses) ou Newton (quand on veut une accélération ou une tension).\n\nUn bon réflexe est de faire un schéma des forces puis de choisir une direction d’étude. Ensuite, vérifie les unités: N, J, kg, m/s².\n\nEn entraînement, alterne: 1 exercice “énergie” + 1 exercice “Newton” pour construire les automatismes.",
        "videoURL": "https://www.youtube.com/watch?v=9Jp0vQeQO5Y",
        "externalLinkURL": "https://fr.khanacademy.org/science/physics/forces-newtons-laws",
        "linkedCardIndices": []
      },
      {
        "name": "Électricité: U=RI, puissance et énergie",
        "textDescription": "En électricité, trois formules structurent beaucoup d’exercices: U=RI (Ohm), P=UI (puissance) et E=PΔt (énergie). Elles permettent d’aller des grandeurs électriques aux consommations.\n\nComprends le sens: la tension “pousse” les charges, l’intensité mesure le débit, et la résistance s’oppose au passage. La puissance indique la vitesse à laquelle l’énergie est transférée.\n\nAttention aux conversions: Δt en secondes pour obtenir E en joules, ou utiliser kWh dans les consommations domestiques. Toujours préciser les unités.\n\nEn entraînement, fais des exercices “chaîne”: calculer I, puis P, puis E sur une durée. Et conclus avec une phrase interprétative (consommation, coût, échauffement).",
        "videoURL": "https://www.youtube.com/watch?v=3K5i5I3GmVQ",
        "externalLinkURL": "https://fr.khanacademy.org/science/physics/circuits-topic",
        "linkedCardIndices": []
      },
      {
        "name": "Chimie: quantité de matière, concentrations, limitant",
        "textDescription": "La chimie au bac repose sur une base de calculs: n=m/M, C=n/V, et l’identification du réactif limitant. Les erreurs viennent souvent de conversions (mL/L, g/kg) ou d’une équation non équilibrée.\n\nMéthode systématique: 1) écrire et équilibrer l’équation, 2) calculer n des réactifs, 3) utiliser les coefficients stœchiométriques pour déterminer le limitant, 4) en déduire la quantité de produits.\n\nPour gagner du temps, fais un tableau d’avancement propre. Même si tu n’écris pas tout, garde la logique.\n\nEn révision, entraîne-toi sur des exercices courts “tableau d’avancement” jusqu’à ce que la méthode devienne automatique.",
        "videoURL": "https://www.youtube.com/watch?v=I8q-0Qy2R5g",
        "externalLinkURL": "https://fr.khanacademy.org/science/chemistry/chemical-reactions-stoichiome",
        "linkedCardIndices": []
      },
      {
        "name": "Acide-base: pH, couples et tampons",
        "textDescription": "Le modèle de Brønsted définit un acide comme donneur de proton H+ et une base comme accepteur. Les couples acide/base conjugués sont une clé de lecture des réactions en solution.\n\nLe pH est lié à la concentration en ions oxonium: pH = −log10([H3O+]). Même si tu n’as pas toujours besoin de calculer exactement, comprendre que “plus [H3O+] augmente, plus le pH baisse” est indispensable.\n\nUne solution tampon limite les variations de pH grâce à un couple acide/base présent en proportions adaptées. C’est un point important pour comprendre le fonctionnement biologique (sang) ou industriel.\n\nEn exercices, pense “couple + sens de réaction + pH”. Et fais toujours attention au domaine: concentrations positives et unités cohérentes.",
        "videoURL": "https://www.youtube.com/watch?v=VZy5Oq7u9pc",
        "externalLinkURL": "https://fr.wikipedia.org/wiki/Th%C3%A9orie_acide-base_de_Br%C3%B8nsted-Lowry",
        "linkedCardIndices": []
      },
      {
        "name": "Oxydoréduction: électrons, oxydant/réducteur",
        "textDescription": "Une réaction d’oxydoréduction implique un transfert d’électrons: oxydation = perte d’e−, réduction = gain d’e−. L’oxydant capte des électrons, le réducteur les cède.\n\nPour éviter les confusions, écris les demi-équations: cela clarifie qui gagne/perd des électrons et aide à équilibrer. Ensuite, combine-les pour obtenir l’équation globale.\n\nCes notions relient chimie et applications: piles, corrosion, électrolyse. Même si tu ne fais pas tous les montages, comprendre le sens du transfert est essentiel.\n\nEn révision, fais 5 exercices d’identification (oxydant/réducteur) puis 5 exercices de demi-équations simples. La répétition rend ça automatique.",
        "videoURL": "https://www.youtube.com/watch?v=4bW2sFZlK2A",
        "externalLinkURL": "https://fr.wikipedia.org/wiki/R%C3%A9action_d%27oxydor%C3%A9duction",
        "linkedCardIndices": []
      },
      {
        "name": "Cinétique: vitesse, température, catalyse",
        "textDescription": "La cinétique étudie la vitesse d’une transformation chimique. Les facteurs classiques: température, concentration, surface de contact, catalyse. Le catalyseur accélère sans être consommé en abaissant l’énergie d’activation.\n\nDans les exercices, on te demande souvent d’identifier quel paramètre change et d’en déduire l’effet qualitatif (plus vite/moins vite). Parfois, tu peux exploiter une courbe (concentration vs temps) pour comparer des vitesses.\n\nUn bon réflexe est d’associer la température à une agitation plus grande, donc à des collisions plus fréquentes/efficaces. Pour la catalyse, pense “nouveau chemin réactionnel”.\n\nEn entraînement, commente 5 courbes et réponds en une phrase: “la vitesse augmente parce que…”.",
        "videoURL": "https://www.youtube.com/watch?v=7Yx7eQ0mL8g",
        "externalLinkURL": "https://fr.khanacademy.org/science/chemistry/chemical-reactions-rates",
        "linkedCardIndices": []
      },
      {
        "name": "Radioactivité: demi-vie et applications (datation, médecine)",
        "textDescription": "La radioactivité est la transformation spontanée de noyaux instables. Les émissions α, β, γ ont des propriétés différentes (pouvoir ionisant/pénétrant). La demi-vie T1/2 donne un repère simple: après chaque demi-vie, la quantité restante est divisée par deux.\n\nLa loi de décroissance permet de relier temps et quantité restante. Au bac, on attend souvent des calculs “par demi-vies” et une interprétation (datation, activité).\n\nApplications: datation (carbone 14), imagerie et traitement en médecine (traceurs, radiothérapie), production d’énergie (nucléaire) avec enjeux de sûreté.\n\nEn révision, fais 10 exercices: 5 par demi-vies (1/2, 1/4, 1/8) et 5 où tu retrouves le nombre de demi-vies à partir d’une fraction restante.",
        "videoURL": "https://www.youtube.com/watch?v=oeqA6N6D6gM",
        "externalLinkURL": "https://www.iaea.org/topics/radioactive-waste-management",
        "linkedCardIndices": []
      }
    ]
  },
  {
    "stableId": "bac_svt_spe_essentiels_terminale",
    "name": "Bac SVT Spé: essentiels (Terminale)",
    "description": "Notions clés de SVT (Terminale générale, spécialité): génétique/évolution, immunité, neurosciences, géologie (tectonique), climat, biodiversité et physiologie humaine.",
    "color": "green",
    "category": "Science",
    "language": "fr",
    "difficulty": "Advanced",
    "tags": [
      "bac",
      "terminale",
      "svt",
      "biologie",
      "ecologie"
    ],
    "cards": [
      {
        "front": "Qu’est-ce qu’une cellule (définition) ?",
        "back": "L’unité structurale et fonctionnelle du vivant, délimitée par une membrane et contenant du matériel génétique.",
        "hint": "Unité du vivant."
      },
      {
        "front": "Qu’est-ce qu’un gène ?",
        "back": "Une portion d’ADN portant une information héréditaire, souvent associée à la production d’un ARN/protéine.",
        "hint": "Portion d’ADN."
      },
      {
        "front": "Quelle différence entre ADN et ARN (très simple) ?",
        "back": "L’ADN stocke l’information génétique; l’ARN sert souvent d’intermédiaire pour l’expression des gènes (ARNm) ou a des rôles spécifiques.",
        "hint": "Stockage vs intermédiaire."
      },
      {
        "front": "Qu’est-ce qu’un allèle ?",
        "back": "Une version d’un même gène, pouvant produire des variations de caractère.",
        "hint": "Version d’un gène."
      },
      {
        "front": "Qu’est-ce qu’un génotype et un phénotype ?",
        "back": "Génotype: ensemble des allèles. Phénotype: caractères observables, résultant du génotype et de l’environnement.",
        "hint": "Gènes vs observable."
      },
      {
        "front": "Qu’est-ce qu’une mutation ?",
        "back": "Une modification de la séquence d’ADN; elle peut être neutre, délétère ou avantageuse et créer de la diversité génétique.",
        "hint": "Changement d’ADN."
      },
      {
        "front": "Qu’est-ce que la sélection naturelle ?",
        "back": "Le processus par lequel les individus les mieux adaptés à un environnement laissent plus de descendants, modifiant la fréquence des allèles.",
        "hint": "Adaptation → descendants."
      },
      {
        "front": "Qu’est-ce que la dérive génétique ?",
        "back": "Une variation aléatoire des fréquences alléliques, plus marquée dans les petites populations, indépendante de l’adaptation.",
        "hint": "Aléatoire."
      },
      {
        "front": "Qu’est-ce que le flux de gènes (migration) ?",
        "back": "L’échange d’allèles entre populations via la migration et la reproduction, pouvant réduire les différences entre populations.",
        "hint": "Échange d’allèles."
      },
      {
        "front": "Qu’est-ce qu’une espèce (définition biologique courante) ?",
        "back": "Un ensemble d’individus capables de se reproduire entre eux et d’avoir une descendance fertile (avec exceptions).",
        "hint": "Descendance fertile."
      },
      {
        "front": "Qu’est-ce que la spéciation ?",
        "back": "Le processus de formation de nouvelles espèces, souvent via isolement reproductif (géographique, écologique, comportemental).",
        "hint": "Isolement reproductif."
      },
      {
        "front": "Qu’est-ce qu’un arbre phylogénétique ?",
        "back": "Un schéma représentant les liens de parenté entre espèces à partir de caractères partagés et de données (souvent moléculaires).",
        "hint": "Parenté."
      },
      {
        "front": "Que montre un caractère homologue ?",
        "back": "Un caractère hérité d’un ancêtre commun, utile pour établir des liens de parenté.",
        "hint": "Ancêtre commun."
      },
      {
        "front": "Qu’est-ce que l’immunité innée ?",
        "back": "La première ligne de défense, rapide et non spécifique (barrières, inflammation, phagocytose).",
        "hint": "Rapide, non spécifique."
      },
      {
        "front": "Qu’est-ce que la phagocytose ?",
        "back": "L’ingestion et destruction de microbes/particules par certaines cellules (phagocytes).",
        "hint": "Manger/détruire."
      },
      {
        "front": "Qu’est-ce que l’immunité adaptative ?",
        "back": "Une réponse plus lente mais spécifique, impliquant lymphocytes B/T et mémoire immunitaire.",
        "hint": "Spécifique + mémoire."
      },
      {
        "front": "Rôle des lymphocytes B ?",
        "back": "Produire des anticorps spécifiques (via plasmocytes) et participer à la mémoire immunitaire.",
        "hint": "Anticorps."
      },
      {
        "front": "Rôle des lymphocytes T (idée) ?",
        "back": "Coordonner la réponse (T auxiliaires) et détruire des cellules infectées (T cytotoxiques).",
        "hint": "Coordonner/détruire."
      },
      {
        "front": "Qu’est-ce qu’un anticorps ?",
        "back": "Une protéine produite par les lymphocytes B qui se fixe spécifiquement à un antigène.",
        "hint": "Fixation spécifique."
      },
      {
        "front": "Qu’est-ce qu’un antigène ?",
        "back": "Une molécule reconnue comme étrangère pouvant déclencher une réponse immunitaire.",
        "hint": "Étranger."
      },
      {
        "front": "Qu’est-ce que la vaccination (principe) ?",
        "back": "Exposer le système immunitaire à un antigène inoffensif pour créer une mémoire protectrice sans faire la maladie.",
        "hint": "Mémoire."
      },
      {
        "front": "Qu’est-ce qu’une pandémie ?",
        "back": "Une épidémie qui s’étend à plusieurs pays/continents avec transmission soutenue.",
        "hint": "Échelle mondiale."
      },
      {
        "front": "Qu’est-ce qu’un neurone ?",
        "back": "Une cellule nerveuse spécialisée dans la transmission de signaux via des potentiels d’action et des synapses.",
        "hint": "Signal nerveux."
      },
      {
        "front": "Qu’est-ce qu’une synapse ?",
        "back": "Une zone de communication entre neurones (ou neurone et cellule cible) via des neurotransmetteurs ou contacts électriques.",
        "hint": "Communication."
      },
      {
        "front": "Qu’est-ce qu’un potentiel d’action (idée) ?",
        "back": "Une variation rapide du potentiel de membrane qui se propage le long de l’axone, codant l’information par la fréquence.",
        "hint": "Signal électrique."
      },
      {
        "front": "Qu’est-ce que la plasticité cérébrale ?",
        "back": "La capacité du cerveau à modifier ses connexions et son fonctionnement avec l’expérience, l’apprentissage ou après une lésion.",
        "hint": "Cerveau adaptable."
      },
      {
        "front": "Qu’est-ce qu’une hormone ?",
        "back": "Une molécule messagère produite par une glande et transportée par le sang, agissant à distance sur des cellules cibles.",
        "hint": "Messager sanguin."
      },
      {
        "front": "Qu’est-ce que l’homéostasie ?",
        "back": "La régulation des constantes internes (température, glycémie…) par des boucles de contrôle, malgré les variations externes.",
        "hint": "Équilibre interne."
      },
      {
        "front": "Qu’est-ce que la glycémie ?",
        "back": "La concentration de glucose dans le sang, régulée notamment par l’insuline et le glucagon.",
        "hint": "Glucose sanguin."
      },
      {
        "front": "Rôle de l’insuline (idée) ?",
        "back": "Hormone qui fait baisser la glycémie en favorisant l’entrée du glucose dans les cellules et son stockage.",
        "hint": "Baisse glycémie."
      },
      {
        "front": "Qu’est-ce que la photosynthèse (définition) ?",
        "back": "Processus où les organismes chlorophylliens produisent de la matière organique à partir de CO2 et d’eau grâce à l’énergie lumineuse, en libérant O2.",
        "hint": "CO2 + lumière."
      },
      {
        "front": "Qu’est-ce que la respiration cellulaire ?",
        "back": "Production d’énergie (ATP) en oxydant des molécules organiques (avec O2) et en produisant CO2 et H2O.",
        "hint": "ATP."
      },
      {
        "front": "Qu’est-ce que la biodiversité (définition) ?",
        "back": "La diversité du vivant à différents niveaux: écosystèmes, espèces et diversité génétique.",
        "hint": "3 niveaux."
      },
      {
        "front": "Qu’est-ce qu’un écosystème ?",
        "back": "Un ensemble formé par une communauté d’êtres vivants et leur milieu, avec échanges de matière et d’énergie.",
        "hint": "Vivants + milieu."
      },
      {
        "front": "Qu’est-ce qu’un service écosystémique ?",
        "back": "Un bénéfice fourni par les écosystèmes aux humains (pollinisation, eau, régulation du climat, ressources).",
        "hint": "Bénéfice."
      },
      {
        "front": "Qu’est-ce que l’effet de serre (idée) ?",
        "back": "Le piégeage d’une partie du rayonnement infrarouge par des gaz atmosphériques (CO2, CH4…), réchauffant la surface.",
        "hint": "IR piégé."
      },
      {
        "front": "Pourquoi l’augmentation du CO2 amplifie-t-elle l’effet de serre ?",
        "back": "Le CO2 absorbe l’infrarouge; plus sa concentration augmente, plus l’énergie est retenue dans le système climatique.",
        "hint": "Absorbe IR."
      },
      {
        "front": "Qu’est-ce qu’un rétrocontrôle (feedback) climatique ?",
        "back": "Un mécanisme qui amplifie (positif) ou atténue (négatif) une variation initiale (ex: vapeur d’eau, albédo).",
        "hint": "Amplifie/atténue."
      },
      {
        "front": "Qu’est-ce que l’albédo ?",
        "back": "La fraction de lumière réfléchie par une surface; un albédo élevé (glace) renvoie plus d’énergie et refroidit.",
        "hint": "Réflexion."
      },
      {
        "front": "Qu’est-ce que la tectonique des plaques ?",
        "back": "Théorie selon laquelle la lithosphère est découpée en plaques mobiles; leurs interactions causent séismes, volcans et reliefs.",
        "hint": "Plaques mobiles."
      },
      {
        "front": "Qu’est-ce qu’une dorsale océanique ?",
        "back": "Une chaîne sous-marine où se crée de la lithosphère océanique par remontée de magma (accrétion).",
        "hint": "Création de croûte."
      },
      {
        "front": "Qu’est-ce qu’une zone de subduction ?",
        "back": "Une zone où une plaque plonge sous une autre, recyclant la lithosphère et produisant séismes/volcanisme.",
        "hint": "Plonge."
      },
      {
        "front": "Qu’est-ce qu’un séisme (définition) ?",
        "back": "Une rupture brutale de roches libérant de l’énergie sous forme d’ondes sismiques.",
        "hint": "Rupture."
      },
      {
        "front": "Qu’est-ce qu’une échelle de magnitude (idée) ?",
        "back": "Une mesure de l’énergie libérée par un séisme (magnitude), différente de l’intensité ressentie localement.",
        "hint": "Énergie libérée."
      },
      {
        "front": "Qu’est-ce qu’un fossile et à quoi sert-il ?",
        "back": "Reste/trace d’un organisme ancien; il sert à reconstituer les environnements passés et l’histoire du vivant.",
        "hint": "Trace du passé."
      },
      {
        "front": "Qu’est-ce qu’un cycle biogéochimique (ex: carbone) ?",
        "back": "La circulation d’un élément entre biosphère, atmosphère, hydrosphère et lithosphère (ex: CO2, matière organique, roches).",
        "hint": "Circulation d’un élément."
      },
      {
        "front": "Pourquoi dit-on que le climat et le vivant sont liés ?",
        "back": "Le climat influence les écosystèmes, et le vivant modifie les cycles (carbone, oxygène) et donc le climat à long terme.",
        "hint": "Cycles."
      },
      {
        "front": "Où trouver une source scientifique fiable sur le climat (référence) ?",
        "back": "Les rapports de synthèse du GIEC (IPCC) sont des références internationales. Réf : https://www.ipcc.ch/",
        "hint": "GIEC."
      },
      {
        "front": "Où trouver une ressource fiable sur la biodiversité (référence) ?",
        "back": "La plateforme IPBES publie des synthèses scientifiques sur la biodiversité. Réf : https://ipbes.net/",
        "hint": "IPBES."
      },
      {
        "front": "Où vérifier le programme officiel SVT (Terminale) ?",
        "back": "Sur Éduscol / Bulletin officiel. Réf : https://eduscol.education.fr/1679/programmes-et-ressources-en-sciences-de-la-vie-et-de-la-terre-voie-g",
        "hint": "Éduscol SVT."
      }
    ],
    "sampleIdeas": [
      {
        "name": "Programme officiel SVT Terminale: cadre et attentes",
        "textDescription": "Pour réviser efficacement, pars du programme officiel de SVT (terminale). Il fixe les notions et les compétences (raisonnement scientifique, analyse de documents, modélisation) attendues au bac. C’est la référence la plus sûre pour éviter les approximations.\n\nTransforme le programme en plan: (1) définitions courtes (gène, sélection, immunité), (2) schémas à savoir refaire (synapse, dorsale/subduction, boucles hormonales), (3) exemples clés (vaccination, dérive génétique, effets du CO2), (4) méthodes d’analyse de documents.\n\nLes ressources Éduscol permettent de consolider les études de cas et d’actualiser certains éléments (ex: climat, santé) avec des sources reconnues.\n\nStratégie gagnante: chaque séance, 10 minutes de rappel actif (définition + schéma + exemple) puis un exercice type bac (doc).",
        "videoURL": "https://www.youtube.com/watch?v=FQvY7o9Zx0Q",
        "externalLinkURL": "https://eduscol.education.fr/1679/programmes-et-ressources-en-sciences-de-la-vie-et-de-la-terre-voie-g",
        "linkedCardIndices": []
      },
      {
        "name": "Génétique & évolution: ce qui fait varier les allèles",
        "textDescription": "L’évolution se comprend par les variations génétiques (mutations, recombinaisons) et par les mécanismes qui modifient les fréquences alléliques: sélection naturelle, dérive génétique et flux de gènes. La sélection n’a pas de “but”: elle dépend de l’environnement.\n\nLa dérive est aléatoire et forte dans les petites populations: elle peut faire disparaître un allèle même s’il n’est pas défavorable. Le flux de gènes, lui, mélange les populations et peut réduire leurs différences.\n\nLa spéciation apparaît quand l’isolement reproductif s’installe (géographique, écologique, comportemental). Les arbres phylogénétiques retracent les parentés en s’appuyant sur des caractères homologues et des données moléculaires.\n\nEn copie, l’important est d’expliquer “qui change quoi”: mutation crée de la diversité; sélection/dérive/flux trient et redistribuent.",
        "videoURL": "https://www.youtube.com/watch?v=GhHOjC4oxh8",
        "externalLinkURL": "https://fr.wikipedia.org/wiki/%C3%89volution_biologique",
        "linkedCardIndices": []
      },
      {
        "name": "Immunité: innée, adaptative et mémoire (vaccination)",
        "textDescription": "Le système immunitaire combine une réponse innée (rapide, non spécifique) et une réponse adaptative (plus lente, spécifique). L’innée inclut barrières, inflammation et phagocytose; l’adaptative mobilise lymphocytes B/T et crée une mémoire.\n\nLes anticorps produits par les lymphocytes B se fixent à des antigènes. Les lymphocytes T coordonnent et détruisent des cellules infectées. La mémoire immunitaire explique pourquoi une seconde rencontre avec un agent est souvent mieux contrôlée.\n\nLa vaccination consiste à présenter un antigène de façon sûre pour entraîner la mémoire, réduisant le risque de formes graves et la circulation d’un agent. Les calendriers vaccinaux s’appuient sur des évaluations bénéfice/risque.\n\nPour réviser, maîtrise: définitions (antigène, anticorps), rôle B/T, et le mécanisme “mémoire” en une phrase.",
        "videoURL": "https://www.youtube.com/watch?v=2A9vGf0c9z8",
        "externalLinkURL": "https://www.who.int/health-topics/vaccines-and-immunization",
        "linkedCardIndices": []
      },
      {
        "name": "Neurosciences: neurone, synapse, plasticité",
        "textDescription": "Un neurone transmet l’information via des potentiels d’action et communique avec d’autres cellules par des synapses. À la synapse chimique, un neurotransmetteur est libéré, se fixe sur des récepteurs et modifie l’activité de la cellule cible.\n\nLe codage de l’information dépend souvent de la fréquence des potentiels d’action, et les réseaux neuronaux permettent des traitements complexes. La plasticité cérébrale signifie que ces connexions changent avec l’apprentissage, l’expérience et parfois après une lésion.\n\nAu lycée, on attend de comprendre l’idée de “réseau”: ce n’est pas un neurone isolé qui fait une fonction, mais l’organisation de multiples connexions.\n\nPour réviser, entraîne-toi à faire un schéma de synapse (bouton, vésicules, neurotransmetteurs, récepteurs) et à expliquer la plasticité en 2 phrases.",
        "videoURL": "https://www.youtube.com/watch?v=OqC2B0O8f3g",
        "externalLinkURL": "https://fr.wikipedia.org/wiki/Synapse",
        "linkedCardIndices": []
      },
      {
        "name": "Homéostasie: glycémie, hormones et boucles de régulation",
        "textDescription": "L’homéostasie maintient des constantes internes malgré les variations externes. La glycémie est un exemple classique: elle est régulée par des boucles hormonales impliquant l’insuline (baisse) et le glucagon (hausse).\n\nUne boucle de rétrocontrôle comporte un capteur, un centre intégrateur et des effecteurs. Quand la glycémie monte, l’insuline favorise l’entrée du glucose dans les cellules et son stockage; quand elle baisse, le glucagon mobilise des réserves.\n\nComprendre la logique “stimulus → réponse → retour à la normale” est plus important que mémoriser une liste. Cela s’applique aussi à la température ou à d’autres équilibres.\n\nEn copie, fais un schéma de boucle et utilise les mots clés: rétrocontrôle négatif, effecteurs, correction.",
        "videoURL": "https://www.youtube.com/watch?v=0o1p0vJbY6Q",
        "externalLinkURL": "https://fr.wikipedia.org/wiki/Hom%C3%A9ostasie",
        "linkedCardIndices": []
      },
      {
        "name": "Biodiversité: 3 niveaux et services écosystémiques",
        "textDescription": "La biodiversité se décrit à trois niveaux: diversité des écosystèmes, des espèces, et diversité génétique au sein des espèces. Ces niveaux sont liés: une perte génétique peut fragiliser une espèce, et une perte d’espèces peut déstabiliser un écosystème.\n\nLes services écosystémiques sont les bénéfices que les écosystèmes fournissent: pollinisation, purification de l’eau, régulation du climat, ressources alimentaires et médicinales. Ils expliquent pourquoi la biodiversité est aussi un enjeu économique et social.\n\nLes menaces principales sont la destruction d’habitats, la surexploitation, les espèces invasives, la pollution et le changement climatique. La conservation implique aires protégées, corridors, gestion durable.\n\nPour réviser, prépare 2 exemples concrets: pollinisateurs et agriculture; forêts et stockage de carbone.",
        "videoURL": "https://www.youtube.com/watch?v=GK_vRtHJZu4",
        "externalLinkURL": "https://ipbes.net/",
        "linkedCardIndices": []
      },
      {
        "name": "Climat: effet de serre, CO2, rétroactions (sources IPCC)",
        "textDescription": "L’effet de serre est un phénomène naturel: des gaz atmosphériques absorbent une partie de l’infrarouge émis par la Terre, maintenant une température compatible avec la vie. L’augmentation des gaz à effet de serre (CO2, CH4…) amplifie ce phénomène.\n\nLe climat résulte d’un équilibre énergétique. Les rétroactions modifient la réponse: vapeur d’eau (souvent amplificatrice), albédo (glace qui fond → moins de réflexion → plus de chaleur), nuages (effets complexes).\n\nAu bac, on attend que tu distingues: phénomène naturel vs amplification anthropique, et que tu saches lire des courbes (CO2, température) en reliant mécanisme et observation.\n\nLes rapports du GIEC (IPCC) synthétisent la littérature scientifique mondiale et sont la source de référence pour les constats et scénarios.",
        "videoURL": "https://www.youtube.com/watch?v=Yc-0C1Yf4a0",
        "externalLinkURL": "https://www.ipcc.ch/",
        "linkedCardIndices": []
      },
      {
        "name": "Tectonique des plaques: dorsales, subduction, séismes",
        "textDescription": "La tectonique des plaques explique la distribution des séismes, volcans et reliefs. Aux dorsales, la lithosphère océanique se forme par accrétion; en subduction, une plaque plonge sous une autre, recyclant la lithosphère et générant des séismes profonds et du volcanisme.\n\nLes failles et la rupture brutale de roches produisent des séismes; la magnitude mesure l’énergie libérée. Les zones actives s’alignent avec les limites de plaques, ce qui permet une lecture “carte du monde” des risques.\n\nAu lycée, on attend la maîtrise des mots: lithosphère, asthénosphère, dorsale, subduction, convergence/divergence. Et la capacité à relier un schéma à un phénomène.\n\nPour réviser, refais 3 schémas: dorsale, subduction océan-continent, collision continentale, avec flèches et légendes.",
        "videoURL": "https://www.youtube.com/watch?v=kwfNGatxUJI",
        "externalLinkURL": "https://fr.wikipedia.org/wiki/Tectonique_des_plaques",
        "linkedCardIndices": []
      },
      {
        "name": "Cycles du carbone: biosphère, océans, roches",
        "textDescription": "Le cycle du carbone décrit la circulation du carbone entre atmosphère (CO2), biosphère (matière organique), océans (dissolution) et lithosphère (roches carbonatées). À court terme, photosynthèse et respiration échangent rapidement du carbone.\n\nÀ long terme, sédimentation, formation de roches et volcanisme modifient les stocks. Les activités humaines (combustibles fossiles, déforestation) transfèrent rapidement du carbone stocké vers l’atmosphère, perturbant l’équilibre.\n\nAu bac, une compréhension claire du “stock vs flux” est utile: où est le carbone, et à quelle vitesse il circule. Cela explique pourquoi de petites modifications de flux peuvent produire des effets importants.\n\nEn révision, apprends un schéma du cycle (réservoirs + flèches) et sois capable de commenter une perturbation anthropique.",
        "videoURL": "https://www.youtube.com/watch?v=2xXy9qk8x8c",
        "externalLinkURL": "https://gml.noaa.gov/ccgg/trends/",
        "linkedCardIndices": []
      },
      {
        "name": "Méthode SVT bac: analyse de documents (réflexe)",
        "textDescription": "La méthode SVT est très “documents”: lire, extraire, interpréter, conclure. Le piège est de décrire sans expliquer. Utilise une structure: 1) ce que montre le document (tendance, comparaison), 2) ce que ça signifie (mécanisme), 3) conclusion reliée à la question.\n\nPour une courbe, commente la forme (augmentation, plateau), donne des valeurs, puis relie au mécanisme (ex: CO2 ↔ température via effet de serre). Pour une micrographie, identifie structures et fonction.\n\nFais toujours attention au vocabulaire et aux unités. Et si plusieurs documents, croise-les: “Doc 1 montre…, doc 2 confirme…, ensemble ils indiquent…”.\n\nEn entraînement, fais 10 sujets courts: 2 minutes de lecture + 6 minutes de réponse structurée. La répétition rend la démarche automatique.",
        "videoURL": "https://www.youtube.com/watch?v=1h1hC2nY8p8",
        "externalLinkURL": "https://www.lumni.fr/dossier/revisions-du-bac-svt",
        "linkedCardIndices": []
      }
    ]
  }
]